{
    "visualization_index_name": "chromadb-openai-ams-589fff5c",
    "umap_params": {
        "a": null,
        "angular_rp_forest": false,
        "b": null,
        "dens_frac": 0.3,
        "dens_lambda": 2.0,
        "dens_var_shift": 0.1,
        "densmap": false,
        "disconnection_distance": null,
        "force_approximation_algorithm": false,
        "init": "spectral",
        "learning_rate": 1.0,
        "local_connectivity": 1.0,
        "low_memory": true,
        "metric": "euclidean",
        "metric_kwds": null,
        "min_dist": 0.1,
        "n_components": 2,
        "n_epochs": null,
        "n_jobs": -1,
        "n_neighbors": 5,
        "negative_sample_rate": 5,
        "output_dens": false,
        "output_metric": "euclidean",
        "output_metric_kwds": null,
        "precomputed_knn": [
            null,
            null,
            null
        ],
        "random_state": 42,
        "repulsion_strength": 1.0,
        "set_op_mix_ratio": 1.0,
        "spread": 1.0,
        "target_metric": "categorical",
        "target_metric_kwds": null,
        "target_n_neighbors": -1,
        "target_weight": 0.5,
        "tqdm_kwds": {
            "desc": "Epochs completed",
            "bar_format": "{desc}: {percentage:3.0f}%| {bar} {n_fmt}/{total_fmt} [{elapsed}]",
            "disable": true
        },
        "transform_mode": "embedding",
        "transform_queue_size": 4.0,
        "transform_seed": 42,
        "unique": false,
        "verbose": false
    },
    "viz_data": "{\"columns\":[\"id\",\"x\",\"y\",\"document\",\"document_cleaned\",\"size\",\"category\"],\"index\":[0,1,2,3,4,5,6,7,8,9,10,11,12,13,14,15,16,17,18,19,20,21,22,23,24,25,26,27,28,29,30,31,32,33,34,35,36,37,38,39,40,41,42,43,44,45,46,47,48,49],\"data\":[[\"02534848-a9ef-4e41-beac-ecb623aefb2b\",8.0286617279,1.8681207895,\"interfaces to the CBO mechanism thru a novel axially compliant lead screw that translates axially to interface with the CBO torque interface as well as provide the rotational input to fracture the core. During testing, the CBO was able to fracture all generated cores  as intended.  However, a significant problem did present itself during testing. In addition to providing a means for core{'source': 'AMS_2012.pdf', 'page': 41}\",\"interfaces to the CBO mechanism thru a novel axially compliant lead screw that<br>translates axially to interface with the CBO torque interface as well as provide<br>the rotational input to fracture the core. During testing, the CBO was able to<br>fracture all generated cores  as intended.  However, a significant problem did<br>present itself during testing. In addition to providing a means for<br>core{'source': 'AMS_2012.pdf', 'page': 41}\",3,\"Chunks\"],[\"080578cf-8d6d-487c-bdab-a303d5dbddd7\",10.5895643234,0.9119070768,\"that of the anticipated operational material. The positioning lanyards were  constructed from braided Spectra cord. The ends were bonded to steel spheres with a hole drilled  through the centroid. The membrane was folded in a conical coffee-filter-type fold pattern and guided into the containment shroud located with the tape spring members. Minus the base plate, which was intentionally oversized{'source': 'AMS_2014.pdf', 'page': 523}\",\"that of the anticipated operational material. The positioning lanyards were<br>constructed from braided Spectra cord. The ends were bonded to steel spheres<br>with a hole drilled  through the centroid. The membrane was folded in a conical<br>coffee-filter-type fold pattern and guided into the containment shroud located<br>with the tape spring members. Minus the base plate, which was intentionally<br>oversized{'source': 'AMS_2014.pdf', 'page': 523}\",3,\"Chunks\"],[\"096a8e73-ed25-4908-b53a-43dd297f93c6\",13.7464008331,-0.1133284941,\"\\u2018DARPA Phoenix HIMast  Boom \\u2019 \\u2018NASA A steroid Redirect Mission\\u2019 (ARM)   \\u2022 1\\u201d (2.5-cm) diameter with extended cross  section   \\u2022 180\\u201d (4.6-m) deployed length   \\u2022 Low CTE design, high precision distal  location   \\u2022 Embedded high current power supply  wires   \\u2022 Fits the NovaWurks  \\u2018HISat \\u2019 envelope  with an  external drive  motor  \\u2022 1.4\\u201d (3.6-cm) diameter, circular cross  section with overlap   \\u2022 80{'source': 'AMS_2016.pdf', 'page': 284}\",\"\\u2018DARPA Phoenix HIMast  Boom \\u2019 \\u2018NASA A steroid Redirect Mission\\u2019 (ARM)   \\u2022 1\\u201d<br>(2.5-cm) diameter with extended cross  section   \\u2022 180\\u201d (4.6-m) deployed length<br>\\u2022 Low CTE design, high precision distal  location   \\u2022 Embedded high current<br>power supply  wires   \\u2022 Fits the NovaWurks  \\u2018HISat \\u2019 envelope  with an  external<br>drive  motor  \\u2022 1.4\\u201d (3.6-cm) diameter, circular cross  section with overlap   \\u2022<br>80{'source': 'AMS_2016.pdf', 'page': 284}\",3,\"Chunks\"],[\"1028ddc1-be46-4f6e-acef-aa41e23c6399\",4.1757097244,6.0072407722,\"control.  Presently,  Actuator Frames are in design and commissioning for   A. 2-phase Stepper Motor application (range 10- 50 \\u03a9 \\/ 10- 100 mH) with Hall  Sensor \\/ Switch \\/  Potentiometer  sensors   B. 3-phase Brushless -DC Motor application (range 5- 15 \\u03a9 \\/ 15-50 mH) with digital serial optical  encoder   Further mechanism characteristics can be adapted by development of the respective Actuator{'source': 'AMS_2020.pdf', 'page': 276}\",\"control.  Presently,  Actuator Frames are in design and commissioning for   A.<br>2-phase Stepper Motor application (range 10- 50 \\u03a9 \\/ 10- 100 mH) with Hall<br>Sensor \\/ Switch \\/  Potentiometer  sensors   B. 3-phase Brushless -DC Motor<br>application (range 5- 15 \\u03a9 \\/ 15-50 mH) with digital serial optical  encoder<br>Further mechanism characteristics can be adapted by development of the<br>respective Actuator{'source': 'AMS_2020.pdf', 'page': 276}\",3,\"Chunks\"],[\"12c3ad9e-b76b-4cc0-b3ad-80f2f2669f12\",12.2820911407,4.8953695297,\"included in the sensor (nominal and redundant), which transforms the sine- cosine signals into a TTL- compatible pulse signal (ABZ, 0 -  5V). This is achieved by a set of  comparators and operation am plifiers, which allow to deduce from the pre- amplified sine -cosine signals, a  pulsed signal (AB , view Figure 4)  with four pulses per pole, resulting in a resolution of about 0.3\\u00b0. The A  and B{'source': 'AMS_2016.pdf', 'page': 195}\",\"included in the sensor (nominal and redundant), which transforms the sine-<br>cosine signals into a TTL- compatible pulse signal (ABZ, 0 -  5V). This is<br>achieved by a set of  comparators and operation am plifiers, which allow to<br>deduce from the pre- amplified sine -cosine signals, a  pulsed signal (AB , view<br>Figure 4)  with four pulses per pole, resulting in a resolution of about 0.3\\u00b0.<br>The A  and B{'source': 'AMS_2016.pdf', 'page': 195}\",3,\"Chunks\"],[\"14ac85c4-4e18-4739-80bd-7a5d9c90844d\",13.5504817963,12.2505073547,\"Figure 10. Mirror Protection Cover Once Installed ( Black Part), PAM T ransportation Box{'source': 'AMS_2020.pdf', 'page': 46}\",\"Figure 10. Mirror Protection Cover Once Installed ( Black Part), PAM T<br>ransportation Box{'source': 'AMS_2020.pdf', 'page': 46}\",3,\"Chunks\"],[\"164670b6-0117-4901-8fa1-5ca5bc1ff7db\",11.3173913956,6.650988102,\"revolutions experienced on top of the design life of the contact system. Moreover, the wear was observed to be uniform on all the composite brushes. It should be noted that the design life of composite brushes in industrial applications is at least more than one order of magnitude higher than the one tested in this application. Finally, the complete visual inspection of the breadboard model{'source': 'AMS_2012.pdf', 'page': 218}\",\"revolutions experienced on top of the design life of the contact system.<br>Moreover, the wear was observed to be uniform on all the composite brushes. It<br>should be noted that the design life of composite brushes in industrial<br>applications is at least more than one order of magnitude higher than the one<br>tested in this application. Finally, the complete visual inspection of the<br>breadboard model{'source': 'AMS_2012.pdf', 'page': 218}\",3,\"Chunks\"],[\"1ce72a05-b160-491c-bf86-3632989bffd9\",14.9313993454,1.3155509233,\"The GPM Solar Array Deployment and Drive System consists of two independent wings, each of which  comprise five major elements. Shown in Figure 8, these elements include: a) Solar panel assembly  consisting  of a rigid panel that supports the solar cells with electrical wiring (cell, diode board, associated  circuitry, temperature sensor) and coarse sun sensor on outboard panels ( quantity 4); b){'source': 'AMS_2020.pdf', 'page': 569}\",\"The GPM Solar Array Deployment and Drive System consists of two independent<br>wings, each of which  comprise five major elements. Shown in Figure 8, these<br>elements include: a) Solar panel assembly  consisting  of a rigid panel that<br>supports the solar cells with electrical wiring (cell, diode board, associated<br>circuitry, temperature sensor) and coarse sun sensor on outboard panels (<br>quantity 4); b){'source': 'AMS_2020.pdf', 'page': 569}\",3,\"Chunks\"],[\"1d1ede97-c363-4a38-9ffa-82c4187d3800\",7.3708930016,5.4938168526,\"calculations often required with other  programs and provides iterative design utilities  that allow the user to quickly underst and and asses the performance of their bearing system .{'source': 'AMS_2016.pdf', 'page': 134}\",\"calculations often required with other  programs and provides iterative design<br>utilities  that allow the user to quickly underst and and asses the performance<br>of their bearing system .{'source': 'AMS_2016.pdf', 'page': 134}\",3,\"Chunks\"],[\"1d869ce3-fa50-4b77-b752-91928837e759\",12.8298463821,1.5821694136,\"for the ALBus mission is to design improved and reliable SA deployment mechanisms  to reduce mission failures. This drove the design goals for the mechanism to be resettable in order to test  and retest the actual flight hardware prior to launch. Reliability also drove the design goal to release all four  SAs with one mechanism to minimize failure points. The ALBus mission chose to use new SMAs{'source': 'AMS_2018.pdf', 'page': 394}\",\"for the ALBus mission is to design improved and reliable SA deployment<br>mechanisms  to reduce mission failures. This drove the design goals for the<br>mechanism to be resettable in order to test  and retest the actual flight<br>hardware prior to launch. Reliability also drove the design goal to release all<br>four  SAs with one mechanism to minimize failure points. The ALBus mission chose<br>to use new SMAs{'source': 'AMS_2018.pdf', 'page': 394}\",3,\"Chunks\"],[\"1e532f00-3586-4f5f-9c5c-8b7c86b8741c\",17.3850631714,4.4825015068,\"Figure 2. Images of NASA\\u2019s last US-built human-rated docking system - circa 1975  NASA\\/CP\\u20142018-219887 473{'source': 'AMS_2018.pdf', 'page': 491}\",\"Figure 2. Images of NASA\\u2019s last US-built human-rated docking system - circa 1975<br>NASA\\/CP\\u20142018-219887 473{'source': 'AMS_2018.pdf', 'page': 491}\",3,\"Chunks\"],[\"1f3efbc7-6202-4f6f-a67d-450ef64d89cc\",6.6064095497,7.9778804779,\"admit  that the correlation coefficient is not good but we would need significantly more testing to assure that we  have really good control on the test variables. Nevertheless, we will use the multipliers as deduced by  Table 1 to make comparative estimates of EHDir vs. speed at 24 \\/g113C (75\\/g113F) and 52\\/g113C (125\\u00b0F) from 200 to  6000 RPM. Conservative practice to prevent ball to race contact{'source': 'AMS_2014.pdf', 'page': 125}\",\"admit  that the correlation coefficient is not good but we would need<br>significantly more testing to assure that we  have really good control on the<br>test variables. Nevertheless, we will use the multipliers as deduced by  Table 1<br>to make comparative estimates of EHDir vs. speed at 24 \\/g113C (75\\/g113F) and<br>52\\/g113C (125\\u00b0F) from 200 to  6000 RPM. Conservative practice to prevent ball to<br>race contact{'source': 'AMS_2014.pdf', 'page': 125}\",3,\"Chunks\"],[\"2448b09c-fe0e-4362-a425-e0ab5014484e\",10.5785427094,9.4797487259,\"114 Model Validation{'source': 'AMS_2016.pdf', 'page': 128}\",\"114 Model Validation{'source': 'AMS_2016.pdf', 'page': 128}\",3,\"Chunks\"],[\"263a2bbe-03bb-4197-8ed5-38da57cf024d\",12.5050020218,12.1050243378,\"paths, it was desirable to confirm the breaking of the first frangibolt prior  to releasing the second frangibolt.   Without motion of the magnetometer boom, it was unlikely that the science magnetometer on the boom  could be used for verification of the fracturing of this first frangibolt. Looking at other possible sensors  capable of detecting such an event, PSP is equipped with a Northrop{'source': 'AMS_2020.pdf', 'page': 348}\",\"paths, it was desirable to confirm the breaking of the first frangibolt prior<br>to releasing the second frangibolt.   Without motion of the magnetometer boom,<br>it was unlikely that the science magnetometer on the boom  could be used for<br>verification of the fracturing of this first frangibolt. Looking at other<br>possible sensors  capable of detecting such an event, PSP is equipped with a<br>Northrop{'source': 'AMS_2020.pdf', 'page': 348}\",3,\"Chunks\"],[\"335c1cca-b6f0-47ae-8dc3-0c91b92579e1\",10.4874544144,6.3829321861,\"needed to be answered and the root cause of the failure needed to be verified. Of primary importance was the determination that the failed pump was an \\u2018in family\\u2019 pump and no extenuating factors impacted the reduced life of the pump. A comprehensive review was conducted on all of the build records and qualification tests. No information was uncovered that would suggest that the failed pump had a{'source': 'AMS_2014.pdf', 'page': 475}\",\"needed to be answered and the root cause of the failure needed to be verified.<br>Of primary importance was the determination that the failed pump was an \\u2018in<br>family\\u2019 pump and no extenuating factors impacted the reduced life of the pump. A<br>comprehensive review was conducted on all of the build records and qualification<br>tests. No information was uncovered that would suggest that the failed pump had<br>a{'source': 'AMS_2014.pdf', 'page': 475}\",3,\"Chunks\"],[\"356314e5-0f90-43e5-ad8f-a14a33087a13\",3.7800033092,3.7908027172,\"system up to an actuator output shaft that was already in place  for the numerous other actuators on board the rover . This more common actuator and avionics arc hitecture  might also make the Mars 2020  style percussion mechanism more accessible to other projects.{'source': 'AMS_2020.pdf', 'page': 184}\",\"system up to an actuator output shaft that was already in place  for the<br>numerous other actuators on board the rover . This more common actuator and<br>avionics arc hitecture  might also make the Mars 2020  style percussion<br>mechanism more accessible to other projects.{'source': 'AMS_2020.pdf', 'page':<br>184}\",3,\"Chunks\"],[\"3a89af26-e374-4a14-ab6f-6964b3906c0e\",9.8490476608,4.5103416443,\".044 in (1.1 mm)  within the c artridge. Even this small motion  was enough to produce significant impact loads on the crimp feature, which was defeated. During the test,  the lids came off the cartridges, and due to the asymmetric friction resistance of the piston seal (i.e. higher  force needed to push seal in than to pull out), the vibration motion \\u201cratcheted\\u201d the piston and data recorder  out{'source': 'AMS_2020.pdf', 'page': 472}\",\".044 in (1.1 mm)  within the c artridge. Even this small motion  was enough to<br>produce significant impact loads on the crimp feature, which was defeated.<br>During the test,  the lids came off the cartridges, and due to the asymmetric<br>friction resistance of the piston seal (i.e. higher  force needed to push seal<br>in than to pull out), the vibration motion \\u201cratcheted\\u201d the piston and data<br>recorder  out{'source': 'AMS_2020.pdf', 'page': 472}\",3,\"Chunks\"],[\"436a545c-46a2-45dd-a718-2ca0fddc018f\",10.165137291,12.9423713684,\"allows for utilizing one actuator instead of two. Three Maxon motor combinations were tested for the drill  unit. This was done to allow a high RPM as well as a high torque option to be evaluated during testing. Outputs from these various combinations were 272 RPM at 3.1 N-m continuous, 188 RPM at 4.3 N-m continuous, and 103 RPM at 6.7 N-m continuous. The high speed option worked well at speeds{'source': 'AMS_2014.pdf', 'page': 238}\",\"allows for utilizing one actuator instead of two. Three Maxon motor combinations<br>were tested for the drill  unit. This was done to allow a high RPM as well as a<br>high torque option to be evaluated during testing. Outputs from these various<br>combinations were 272 RPM at 3.1 N-m continuous, 188 RPM at 4.3 N-m continuous,<br>and 103 RPM at 6.7 N-m continuous. The high speed option worked well at<br>speeds{'source': 'AMS_2014.pdf', 'page': 238}\",3,\"Chunks\"],[\"468d4841-3f99-4f71-97b9-a8973531632a\",7.4539980888,10.4948692322,\"of lead.  9.67 2.42 0.797.79 1.22 0.36 024681012 0% Lead 3% Lead 5% LeadWear rate ( \\u03bcm3\\/mm)Scuffing Wear Rates 50\\u00b0C 150\\u00b0C NASA\\/CP\\u20142018-219887 77{'source': 'AMS_2018.pdf', 'page': 95}\",\"of lead.  9.67 2.42 0.797.79 1.22 0.36 024681012 0% Lead 3% Lead 5% LeadWear<br>rate ( \\u03bcm3\\/mm)Scuffing Wear Rates 50\\u00b0C 150\\u00b0C NASA\\/CP\\u20142018-219887 77{'source':<br>'AMS_2018.pdf', 'page': 95}\",3,\"Chunks\"],[\"46992913-1220-4853-be21-09589c01dea1\",3.4940428734,7.2829904556,\"crew (PRS) as the output  linear stage , tapered roller bearings (TRB) to support the PRS at  the high loads , a set of spur gears   supported by cylinder roller bearings , and a brushless motor with a planetary gearhead  and magnetic detent  brake. This paper describes the role of these mechanisms  in the Mars 2020 Rover mission as a part of the  Sample Caching Subsystem (SCS) and Adaptive{'source': 'AMS_2020.pdf', 'page': 147}\",\"crew (PRS) as the output  linear stage , tapered roller bearings (TRB) to<br>support the PRS at  the high loads , a set of spur gears   supported by cylinder<br>roller bearings , and a brushless motor with a planetary gearhead  and magnetic<br>detent  brake. This paper describes the role of these mechanisms  in the Mars<br>2020 Rover mission as a part of the  Sample Caching Subsystem (SCS) and<br>Adaptive{'source': 'AMS_2020.pdf', 'page': 147}\",3,\"Chunks\"],[\"515ad9f6-118e-4882-8fbb-fcd8d6a018fb\",16.4378509521,3.2670559883,\"effort . It has been reformatted and  rewritten, with a goal of emulat ing the format of  SMC -S-016 (also TR-RS-2014- 00016, or formerly  MIL-STD-1540 C), \\u201cTest Requirements for Launch, Upper Stage, and Space Vehicles\\u201d  (References 1, 2,  and 3) .{'source': 'AMS_2020.pdf', 'page': 505}\",\"effort . It has been reformatted and  rewritten, with a goal of emulat ing the<br>format of  SMC -S-016 (also TR-RS-2014- 00016, or formerly  MIL-STD-1540 C),<br>\\u201cTest Requirements for Launch, Upper Stage, and Space Vehicles\\u201d  (References 1,<br>2,  and 3) .{'source': 'AMS_2020.pdf', 'page': 505}\",3,\"Chunks\"],[\"53719272-4159-4345-a110-06db8bd87159\",5.8951601982,5.4106755257,\"Applications\\u201d, Presented at 13th  International Ceramics Conference of CIMTECH 2014, Montecatini, Italy, June 8- 13. Published in  Advances in Science and Technology, volume 89 (2014), pp 1-9, 2014.   4. C. DellaCorte, S. V. Pepper, R. D. Noebe, D.R. Hull, an d G. Glennon: \\u201cIntermetallic Nickel -Titanium  Alloys for Oil -Lubrication Bearing Applications,\\u201d NASA TM- 2009- 215646, March 2009.   5.{'source': 'AMS_2016.pdf', 'page': 120}\",\"Applications\\u201d, Presented at 13th  International Ceramics Conference of CIMTECH<br>2014, Montecatini, Italy, June 8- 13. Published in  Advances in Science and<br>Technology, volume 89 (2014), pp 1-9, 2014.   4. C. DellaCorte, S. V. Pepper, R.<br>D. Noebe, D.R. Hull, an d G. Glennon: \\u201cIntermetallic Nickel -Titanium  Alloys<br>for Oil -Lubrication Bearing Applications,\\u201d NASA TM- 2009- 215646, March 2009.<br>5.{'source': 'AMS_2016.pdf', 'page': 120}\",3,\"Chunks\"],[\"5ca14dfd-b54c-4409-8986-b26659a1261c\",14.5318212509,6.4489455223,\"result.  See test results in Figure 13.  Figure 13. Worst-Case Long (Left) and Worst-Case Short (Right) Deploy Duration Test Data  When these test results are compared to elastomeric diaphragm test results from past projects, the  spring\\/piston damper exhibited more consistent damping rate performance under constant external torque  application, as shown in Figure 14. The suspected explanation is{'source': 'AMS_2018.pdf', 'page': 429}\",\"result.  See test results in Figure 13.  Figure 13. Worst-Case Long (Left) and<br>Worst-Case Short (Right) Deploy Duration Test Data  When these test results are<br>compared to elastomeric diaphragm test results from past projects, the<br>spring\\/piston damper exhibited more consistent damping rate performance under<br>constant external torque  application, as shown in Figure 14. The suspected<br>explanation is{'source': 'AMS_2018.pdf', 'page': 429}\",3,\"Chunks\"],[\"5d32a52d-68b8-4a7a-9b78-46703bf73055\",7.296087265,10.211107254,\"SRV under both atmospheric and vacuum  conditions. These plots illustrate the wear rate of each material which is determined by the total wear volume  (\\u00b5m3) per millimeter traveled in the test. The wear volumes were measured using an Ametek 3D Optical  Profilometer.   Table 1. Wear Performance for MAC fluid with 0% Lead at 20\\u00b0C  Table 2. Wear Performance for MAC fluid with 3% Lead at 20\\u00b0C  Table{'source': 'AMS_2018.pdf', 'page': 91}\",\"SRV under both atmospheric and vacuum  conditions. These plots illustrate the<br>wear rate of each material which is determined by the total wear volume  (\\u00b5m3)<br>per millimeter traveled in the test. The wear volumes were measured using an<br>Ametek 3D Optical  Profilometer.   Table 1. Wear Performance for MAC fluid with<br>0% Lead at 20\\u00b0C  Table 2. Wear Performance for MAC fluid with 3% Lead at 20\\u00b0C<br>Table{'source': 'AMS_2018.pdf', 'page': 91}\",3,\"Chunks\"],[\"5e8dc799-1e7c-4794-84d7-a70e51281ca5\",10.5290231705,6.6588478088,\"causes and converged upon  what they thought was the likely root cause, i.e. , that a bracket was undersized and not allowing a bar to  be smoothly pulled out of this bracket. The team was  in complete agreement that this was the likely root  cause and was about to implement some trouble- shooting steps when it was suggested to the team that  they solicit some outside input from a group of{'source': 'AMS_2020.pdf', 'page': 391}\",\"causes and converged upon  what they thought was the likely root cause, i.e. ,<br>that a bracket was undersized and not allowing a bar to  be smoothly pulled out<br>of this bracket. The team was  in complete agreement that this was the likely<br>root  cause and was about to implement some trouble- shooting steps when it was<br>suggested to the team that  they solicit some outside input from a group<br>of{'source': 'AMS_2020.pdf', 'page': 391}\",3,\"Chunks\"],[\"60bfbd94-3703-4348-9cdf-25698b8445db\",12.4309854507,2.5156540871,\"nanometric  positioning resolution combined with the ability to hold its position without power and during launch without  the need for any launch lock mechanism.{'source': 'AMS_2020.pdf', 'page': 11}\",\"nanometric  positioning resolution combined with the ability to hold its<br>position without power and during launch without  the need for any launch lock<br>mechanism.{'source': 'AMS_2020.pdf', 'page': 11}\",3,\"Chunks\"],[\"703707d7-f444-4f3d-b72a-754b68c94521\",10.3120422363,3.7661409378,\"(a)                                                                            (b)  Figure 4. Devices used in the characterization campaign of SMAR: (a) Arquimea Actuators  test bench; (b) test bench for cryogenic test.   Lifetime tests  The scope of this test is to obtain an initial approach to the lifetime capabilities of the material. The tests have been limited to probe that the material{'source': 'AMS_2012.pdf', 'page': 131}\",\"(a)<br>(b)  Figure 4. Devices used in the characterization campaign of SMAR: (a)<br>Arquimea Actuators  test bench; (b) test bench for cryogenic test.   Lifetime<br>tests  The scope of this test is to obtain an initial approach to the lifetime<br>capabilities of the material. The tests have been limited to probe that the<br>material{'source': 'AMS_2012.pdf', 'page': 131}\",3,\"Chunks\"],[\"70fc9334-ca0e-4107-adaf-99aab762840b\",14.5631933212,4.9927606583,\"tuned PID  controller follows this trajectory and ensures the velocity is close to zero when the detent is reached. 4.Enter detent. The closed-loop controller is disabled just inside the \\u201cregion of influence\\u201d of the  detent. Instead, a high-current open-loop commutation waveform is fed to the motor, lowering the  wheel into the detent.{'source': 'AMS_2014.pdf', 'page': 313}\",\"tuned PID  controller follows this trajectory and ensures the velocity is close<br>to zero when the detent is reached. 4.Enter detent. The closed-loop controller<br>is disabled just inside the \\u201cregion of influence\\u201d of the  detent. Instead, a<br>high-current open-loop commutation waveform is fed to the motor, lowering the<br>wheel into the detent.{'source': 'AMS_2014.pdf', 'page': 313}\",3,\"Chunks\"],[\"7e0b01f8-b47a-40b2-943a-0da5fe53ace3\",12.7518119812,7.8901562691,\"torque requirement for a  particular set of motors, lead screws, nuts and bearings . These results were then documented and  compared to the torque margins required by the organization .    Although the torque outputs for stepper motors and torque requirements for the AMT drive systems were   relatively simple to calculate, there were many other elements  of the calculations that were assumed{'source': 'AMS_2016.pdf', 'page': 173}\",\"torque requirement for a  particular set of motors, lead screws, nuts and<br>bearings . These results were then documented and  compared to the torque<br>margins required by the organization .    Although the torque outputs for<br>stepper motors and torque requirements for the AMT drive systems were<br>relatively simple to calculate, there were many other elements  of the<br>calculations that were assumed{'source': 'AMS_2016.pdf', 'page': 173}\",3,\"Chunks\"],[\"7fa579e0-a1b4-4893-978a-7360cdee91a9\",11.2407178879,3.4945836067,\"fixture and the SM side interface a flight-like actuator bracket. The forward lug and aft cap have  threaded aluminum 7050 interfaces to their adjoining parts, the secondary piston and actuator housing, respectively. The threads for these parts were cut and have an applied polyester locking patch and single  braided lockwire between the elements to serve as secondary locking features.{'source': 'AMS_2014.pdf', 'page': 409}\",\"fixture and the SM side interface a flight-like actuator bracket. The forward<br>lug and aft cap have  threaded aluminum 7050 interfaces to their adjoining<br>parts, the secondary piston and actuator housing, respectively. The threads for<br>these parts were cut and have an applied polyester locking patch and single<br>braided lockwire between the elements to serve as secondary locking<br>features.{'source': 'AMS_2014.pdf', 'page': 409}\",3,\"Chunks\"],[\"89d13e93-7ba0-479b-8cb6-cd2de3acffc0\",6.1760292053,5.8376393318,\"Stress 3790 MPa  (550 ksi) 2310 MPa  (335 ksi) n\\/a  Modulus 235 GPa  (34.1e6 psi) 205 GPa  (29.7e6 psi) 320 GPa  (46.4e6 psi)  Poisson's Ratio 0.29 0.283 0.26  Density \\/ Specific Gravity 8.17 g\\/cc  (0.295 lbm\\/in3) 7.8 g\\/cc  (0.282 lbm\\/in3) 3.16 g\\/cc  (0.114 lbm\\/in3)  Thermal Expansion Coefficient 10.66e-6 1\\/C 10.2e-6 1\\/C 2.9e-6 1\\/C  Type Tool Steel Stainless Steel Ceramic  Expected Hardness RC 65{'source': 'AMS_2018.pdf', 'page': 118}\",\"Stress 3790 MPa  (550 ksi) 2310 MPa  (335 ksi) n\\/a  Modulus 235 GPa  (34.1e6<br>psi) 205 GPa  (29.7e6 psi) 320 GPa  (46.4e6 psi)  Poisson's Ratio 0.29 0.283<br>0.26  Density \\/ Specific Gravity 8.17 g\\/cc  (0.295 lbm\\/in3) 7.8 g\\/cc  (0.282<br>lbm\\/in3) 3.16 g\\/cc  (0.114 lbm\\/in3)  Thermal Expansion Coefficient 10.66e-6 1\\/C<br>10.2e-6 1\\/C 2.9e-6 1\\/C  Type Tool Steel Stainless Steel Ceramic  Expected<br>Hardness RC 65{'source': 'AMS_2018.pdf', 'page': 118}\",3,\"Chunks\"],[\"968d0079-c596-4419-83b6-f0ee4a33daf0\",6.5511474609,10.4934110641,\"or the Ti interlayer in the center of the  scar.   Sb2O3\\/Au-MoS 2 Wear volumes (V) for the Sb 2O3\\/Au-MoS 2 coating and mated steel ball obtained from tests performed at  30\\u00b0C are displayed and plotted against Edin Figure 4 along with optical images of the wear scars generated  after 17,000 cycles. The wear coefficients for the ball and the Sb 2O3\\/Au-MoS 2 coating for tests performed  at 30\\u00b0C were{'source': 'AMS_2018.pdf', 'page': 163}\",\"or the Ti interlayer in the center of the  scar.   Sb2O3\\/Au-MoS 2 Wear volumes<br>(V) for the Sb 2O3\\/Au-MoS 2 coating and mated steel ball obtained from tests<br>performed at  30\\u00b0C are displayed and plotted against Edin Figure 4 along with<br>optical images of the wear scars generated  after 17,000 cycles. The wear<br>coefficients for the ball and the Sb 2O3\\/Au-MoS 2 coating for tests performed<br>at 30\\u00b0C were{'source': 'AMS_2018.pdf', 'page': 163}\",3,\"Chunks\"],[\"96a37ef2-50f3-47b2-a215-f6ef9790a231\",10.2844572067,-1.1047116518,\"362 Figure 16  shows the changes in section of the aluminum pins. The pins are the \\u201ctriggers\\u201d for the multiple  functions that occur during deployment.  At the tip of the pin is a point, then a relief, and at the shoulder of  the pin is a taper ed ramp with a recess on the back side . As the moving ring slides from the tail of ADEPT  towards the nose, the pins pass through the center of the{'source': 'AMS_2020.pdf', 'page': 372}\",\"362 Figure 16  shows the changes in section of the aluminum pins. The pins are<br>the \\u201ctriggers\\u201d for the multiple  functions that occur during deployment.  At the<br>tip of the pin is a point, then a relief, and at the shoulder of  the pin is a<br>taper ed ramp with a recess on the back side . As the moving ring slides from<br>the tail of ADEPT  towards the nose, the pins pass through the center of<br>the{'source': 'AMS_2020.pdf', 'page': 372}\",3,\"Chunks\"],[\"9d6dcda5-ce0c-4fe1-b6c9-8cfab6f962cb\",4.6171736717,10.1820373535,\"durability for gears exposed to humid air ranged from 84,700 to 21,000 pinion revolutions with an average  value of 64,900 and a median value of 68,800 revolutions. Using the unexposed-gear film durability as a  baseline, the exposure reduced the film durability by 35 percent based on average values or 18 percent  based on median values. These reductions in film durability are similar magnitude{'source': 'AMS_2018.pdf', 'page': 158}\",\"durability for gears exposed to humid air ranged from 84,700 to 21,000 pinion<br>revolutions with an average  value of 64,900 and a median value of 68,800<br>revolutions. Using the unexposed-gear film durability as a  baseline, the<br>exposure reduced the film durability by 35 percent based on average values or 18<br>percent  based on median values. These reductions in film durability are similar<br>magnitude{'source': 'AMS_2018.pdf', 'page': 158}\",3,\"Chunks\"],[\"9ebd1e61-00c7-4ee5-a4ce-dbc9885a87b1\",6.6429271698,0.4550293386,\"Application of a Remote Controlled Hammering Drill from  Space to Deep Sea.  Oceans 2009 \\u2013  Europe, IEEE. doi: 10.1109\\/OCEANSE.2009.5278132.   4. Spohn T.  et al.: InSight: Measuring the Martian  heat flow using the Heat Flow and Physical Properties  Package (HP3). In Proc . of International Workshop on Instrumentation for Planetary Missions. 2012.   5. Lichtenheldt R., Sch\\u00e4fer B., Kr\\u00f6mer O.:{'source': 'AMS_2016.pdf', 'page': 442}\",\"Application of a Remote Controlled Hammering Drill from  Space to Deep Sea.<br>Oceans 2009 \\u2013  Europe, IEEE. doi: 10.1109\\/OCEANSE.2009.5278132.   4. Spohn T.<br>et al.: InSight: Measuring the Martian  heat flow using the Heat Flow and<br>Physical Properties  Package (HP3). In Proc . of International Workshop on<br>Instrumentation for Planetary Missions. 2012.   5. Lichtenheldt R., Sch\\u00e4fer B.,<br>Kr\\u00f6mer O.:{'source': 'AMS_2016.pdf', 'page': 442}\",3,\"Chunks\"],[\"a224b2d2-6c51-43c8-9cce-469b1db4d87b\",8.8995904922,5.1756415367,\"bearing stresses.  Had the B rassboard experienced the vibration environment, it  too may have experienced similar behaviors.   Root Cause Investigation   The process of the bearing anomaly investigation was informed by a fishbone diagram ( Figure 12), which  lays out all reasonable causes for the drag torque spikes in the SCS bearing assembly . The diagram is  color -coded to indicate the status{'source': 'AMS_2020.pdf', 'page': 334}\",\"bearing stresses.  Had the B rassboard experienced the vibration environment, it<br>too may have experienced similar behaviors.   Root Cause Investigation   The<br>process of the bearing anomaly investigation was informed by a fishbone diagram<br>( Figure 12), which  lays out all reasonable causes for the drag torque spikes<br>in the SCS bearing assembly . The diagram is  color -coded to indicate the<br>status{'source': 'AMS_2020.pdf', 'page': 334}\",3,\"Chunks\"],[\"a2b63bd9-c0e4-477e-923a-a1dc60bbdc1b\",8.0519924164,7.7895488739,\"418 Low-Quantity Grease Dosing   For the M20 gearmotor, JPL required r apid acceleration to the commanded speed without an excessive  current draw over the entire specified t emperature range. This is a problem due to the high viscosity of  Braycote at low temperatures. The standard quantities of grease used per gearbox stage by maxon for  COTS products are determined by the requirement to deliver{'source': 'AMS_2020.pdf', 'page': 428}\",\"418 Low-Quantity Grease Dosing   For the M20 gearmotor, JPL required r apid<br>acceleration to the commanded speed without an excessive  current draw over the<br>entire specified t emperature range. This is a problem due to the high viscosity<br>of  Braycote at low temperatures. The standard quantities of grease used per<br>gearbox stage by maxon for  COTS products are determined by the requirement to<br>deliver{'source': 'AMS_2020.pdf', 'page': 428}\",3,\"Chunks\"],[\"a41c4571-ee0e-43e3-aa31-41fbf84d7a91\",9.2633981705,-3.3181974888,\"COEFFICIENT &  VARIATION VALUES  TORQUE CYCLES TORQUE COEFFICIENTS & % VARIATION vs CYCLES FOR #10-32 ARATHANE TESTING Ave Torque  Coeff Plots  Max Torque Coeff Plots  Min Torque Coeff Plots  % Variation  237{'source': 'AMS_2014.pdf', 'page': 253}\",\"COEFFICIENT &  VARIATION VALUES  TORQUE CYCLES TORQUE COEFFICIENTS & % VARIATION<br>vs CYCLES FOR #10-32 ARATHANE TESTING Ave Torque  Coeff Plots  Max Torque Coeff<br>Plots  Min Torque Coeff Plots  % Variation  237{'source': 'AMS_2014.pdf',<br>'page': 253}\",3,\"Chunks\"],[\"b23780db-d8d0-4bb6-9cb0-ff39428a7bc8\",9.0213527679,0.1230909079,\"the fluid capacity of the accumulator is within specified tolerances  \\uf0b7 If the assembly passes the test, weld the bellow end assembly onto the housing for a final flight  seal  \\uf0b7 Repeat the functional test above to verify no change occurred during welding{'source': 'AMS_2012.pdf', 'page': 257}\",\"the fluid capacity of the accumulator is within specified tolerances  \\uf0b7 If the<br>assembly passes the test, weld the bellow end assembly onto the housing for a<br>final flight  seal  \\uf0b7 Repeat the functional test above to verify no change<br>occurred during welding{'source': 'AMS_2012.pdf', 'page': 257}\",3,\"Chunks\"],[\"b565e8cd-048f-4800-ada5-b649c29b8711\",2.7887892723,3.9529650211,\"Laboratory, Pasadena, California. Copyright 2012 California Institute of Technology. Government sponsorship acknowledged. The authors wish to acknowledge the many individuals working on the MSL project, of which the thermal subsystem is a part of the greater whole. Dave Bame and AJ Mastropietro from the MSL Thermal team provided excellent support for the testing of the bellows at JPL. Pacific{'source': 'AMS_2012.pdf', 'page': 266}\",\"Laboratory, Pasadena, California. Copyright 2012 California Institute of<br>Technology. Government sponsorship acknowledged. The authors wish to acknowledge<br>the many individuals working on the MSL project, of which the thermal subsystem<br>is a part of the greater whole. Dave Bame and AJ Mastropietro from the MSL<br>Thermal team provided excellent support for the testing of the bellows at JPL.<br>Pacific{'source': 'AMS_2012.pdf', 'page': 266}\",3,\"Chunks\"],[\"b8147c0e-aa5d-4301-b136-04a76828dd1f\",6.3543419838,0.5727903843,\"References  \\n\\n1. Wahl, A . M. \\u201cMechanical Springs\\u201d Penton Publishing Company  (1944) , Page 359 -377.{'source': 'AMS_2016.pdf', 'page': 183}\",\"References    1. Wahl, A . M. \\u201cMechanical Springs\\u201d Penton Publishing Company<br>(1944) , Page 359 -377.{'source': 'AMS_2016.pdf', 'page': 183}\",3,\"Chunks\"],[\"c786f837-bc5a-4821-bdcb-0c266fe39e1f\",14.958442688,4.3602600098,\"through the Tracking and Data Relay Satellite System (TDRSS). The GPM mission is an international network of satellites that will provide the next-generation global observations of rain and snow. The GPM mission deploys a \\u201ccore\\u201d satellite carrying an  advanced radar\\/radiometer system to measure precipitation from space and serves as a reference  standard to unify precipitation measurements from a{'source': 'AMS_2014.pdf', 'page': 61}\",\"through the Tracking and Data Relay Satellite System (TDRSS). The GPM mission is<br>an international network of satellites that will provide the next-generation<br>global observations of rain and snow. The GPM mission deploys a \\u201ccore\\u201d satellite<br>carrying an  advanced radar\\/radiometer system to measure precipitation from<br>space and serves as a reference  standard to unify precipitation measurements<br>from a{'source': 'AMS_2014.pdf', 'page': 61}\",3,\"Chunks\"],[\"c884030b-0804-4343-8632-c3ff4a8f0f55\",12.5779027939,8.1208343506,\"Figure 13. Stepper Motor Voltage Plot Showing Clipped BEMF Voltage at -8 Volts Figure 14. Corrected Stability Model, Showing the Same Behavior as Original TVAC Failure Once the stability model was corrected, it was clear that the original motor design could not be salvaged.  With the stability model corrected, it also became apparent that the motor suppliers request to reduce the  required{'source': 'AMS_2018.pdf', 'page': 321}\",\"Figure 13. Stepper Motor Voltage Plot Showing Clipped BEMF Voltage at -8 Volts<br>Figure 14. Corrected Stability Model, Showing the Same Behavior as Original TVAC<br>Failure Once the stability model was corrected, it was clear that the original<br>motor design could not be salvaged.  With the stability model corrected, it also<br>became apparent that the motor suppliers request to reduce the<br>required{'source': 'AMS_2018.pdf', 'page': 321}\",3,\"Chunks\"],[\"f10ab223-b15c-411e-9a2d-882d7b19933d\",16.192237854,9.3586959839,\"The qualitatively noisiest overall dataset appears to be set #5 on RWA 1004; quietest overall dataset  appears to be set #1 or #3 on RWA 1003.   11) The most \\u201ctypical\\u201d dataset recommended for preliminary  jitter assessment for RWA 1003 is #3.   12) The RWA 1004 2.0 harmonic data (all DOFs)  is consistently abnormally low (no known reason);  speculation is inordinately small values for{'source': 'AMS_2016.pdf', 'page': 403}\",\"The qualitatively noisiest overall dataset appears to be set #5 on RWA 1004;<br>quietest overall dataset  appears to be set #1 or #3 on RWA 1003.   11) The most<br>\\u201ctypical\\u201d dataset recommended for preliminary  jitter assessment for RWA 1003 is<br>#3.   12) The RWA 1004 2.0 harmonic data (all DOFs)  is consistently abnormally<br>low (no known reason);  speculation is inordinately small values for{'source':<br>'AMS_2016.pdf', 'page': 403}\",3,\"Chunks\"],[\"f2bb605e-60f8-49ef-9f63-1f8d7d6acdcf\",10.7041463852,4.3402786255,\"applications) In addition, this design has demonstrated its robustness with regards to the current capacity, by working  without any damage with a current of 6.2 A on all the power lines during 24 hours at hot temperature.  The same level of performance is achieved with this type of technology compared to the standard one,  see Figure 9.  Figure 9. Standard deviation evolution  At the end of the{'source': 'AMS_2018.pdf', 'page': 233}\",\"applications) In addition, this design has demonstrated its robustness with<br>regards to the current capacity, by working  without any damage with a current<br>of 6.2 A on all the power lines during 24 hours at hot temperature.  The same<br>level of performance is achieved with this type of technology compared to the<br>standard one,  see Figure 9.  Figure 9. Standard deviation evolution  At the end<br>of the{'source': 'AMS_2018.pdf', 'page': 233}\",3,\"Chunks\"],[\"f2e2cc1f-66b4-445c-8ac9-bac9313aecaf\",0.4203341305,7.1078162193,\"Recall that RF signals travel between the center conductor and the inner surface of the outer conductor  layer with a precise separation set by the dielectric within coax cable. In the construction outlined above, the outer conductor foil is the main functional layer along with the center conductor. If either of these functional layers is damaged, a corresponding affect in insertion loss within{'source': 'AMS_2012.pdf', 'page': 228}\",\"Recall that RF signals travel between the center conductor and the inner surface<br>of the outer conductor  layer with a precise separation set by the dielectric<br>within coax cable. In the construction outlined above, the outer conductor foil<br>is the main functional layer along with the center conductor. If either of these<br>functional layers is damaged, a corresponding affect in insertion loss<br>within{'source': 'AMS_2012.pdf', 'page': 228}\",3,\"Chunks\"],[\"f347dc4d-2805-4515-b345-209058899416\",15.090010643,1.9649053812,\"the solar cells prior  to and after attachment to the substrate. After these elements were assembled, the entire subassembly  went through pre-environmental testing, environmental testing, and then post-environmental testing. Preenvironmental testing included deployment testing, electrical testing, and Large Area Pulsed Solar  Simulator (LAPSS) testing. Environmental testing consisted of{'source': 'AMS_2018.pdf', 'page': 410}\",\"the solar cells prior  to and after attachment to the substrate. After these<br>elements were assembled, the entire subassembly  went through pre-environmental<br>testing, environmental testing, and then post-environmental testing.<br>Preenvironmental testing included deployment testing, electrical testing, and<br>Large Area Pulsed Solar  Simulator (LAPSS) testing. Environmental testing<br>consisted of{'source': 'AMS_2018.pdf', 'page': 410}\",3,\"Chunks\"],[\"f4f0bcf6-058f-4a4b-80e0-8c1575c0a6ef\",15.6303348541,4.8750071526,\"newly developed contact system.  Component-level validation testing aimed specifically at the validation of the new gluing system, the validation of the sintered connection between the flexible braid and the composite brushes as well as the validation of the electrical performances of the new composite brush assembly.   Component-level validation tests specifically consisted of:  o Shear tests on{'source': 'AMS_2012.pdf', 'page': 211}\",\"newly developed contact system.  Component-level validation testing aimed<br>specifically at the validation of the new gluing system, the validation of the<br>sintered connection between the flexible braid and the composite brushes as well<br>as the validation of the electrical performances of the new composite brush<br>assembly.   Component-level validation tests specifically consisted of:  o Shear<br>tests on{'source': 'AMS_2012.pdf', 'page': 211}\",3,\"Chunks\"],[\"f5940a7b-19fc-4b6b-b10b-07e91c84a4f3\",10.2779254913,9.4842605591,\"COEFICIENT{'source': 'AMS_2014.pdf', 'page': 258}\",\"COEFICIENT{'source': 'AMS_2014.pdf', 'page': 258}\",3,\"Chunks\"],[\"f731f773-31ba-4781-8146-4a04764462a7\",3.4551007748,4.8738398552,\"Figure 1. Left: MER Spirit Pancam false-color image of Mazatzal on Sol 86 after numerous Rock Abrasion  Tool brushing and grinding operations; Right: MER Spirit  Microscopic Imager false-color image of Mazatzal  on Sol 79 after a RAT brushing operation. Image credit: NASA\\/JPL-Caltech\\/Cornell                                                    * Honeybee Robotics Spacecraft Mechanisms Corp., New{'source': 'AMS_2012.pdf', 'page': 293}\",\"Figure 1. Left: MER Spirit Pancam false-color image of Mazatzal on Sol 86 after<br>numerous Rock Abrasion  Tool brushing and grinding operations; Right: MER Spirit<br>Microscopic Imager false-color image of Mazatzal  on Sol 79 after a RAT brushing<br>operation. Image credit: NASA\\/JPL-Caltech\\/Cornell<br>* Honeybee Robotics Spacecraft Mechanisms Corp., New{'source': 'AMS_2012.pdf',<br>'page': 293}\",3,\"Chunks\"]]}"
}