{
    "visualization_index_name": "chromadb-openai-ams-87b8d21a",
    "umap_params": {
        "a": null,
        "angular_rp_forest": false,
        "b": null,
        "dens_frac": 0.3,
        "dens_lambda": 2.0,
        "dens_var_shift": 0.1,
        "densmap": false,
        "disconnection_distance": null,
        "force_approximation_algorithm": false,
        "init": "spectral",
        "learning_rate": 1.0,
        "local_connectivity": 1.0,
        "low_memory": true,
        "metric": "euclidean",
        "metric_kwds": null,
        "min_dist": 0.1,
        "n_components": 2,
        "n_epochs": null,
        "n_jobs": -1,
        "n_neighbors": 5,
        "negative_sample_rate": 5,
        "output_dens": false,
        "output_metric": "euclidean",
        "output_metric_kwds": null,
        "precomputed_knn": [
            null,
            null,
            null
        ],
        "random_state": 42,
        "repulsion_strength": 1.0,
        "set_op_mix_ratio": 1.0,
        "spread": 1.0,
        "target_metric": "categorical",
        "target_metric_kwds": null,
        "target_n_neighbors": -1,
        "target_weight": 0.5,
        "tqdm_kwds": {
            "desc": "Epochs completed",
            "bar_format": "{desc}: {percentage:3.0f}%| {bar} {n_fmt}/{total_fmt} [{elapsed}]",
            "disable": true
        },
        "transform_mode": "embedding",
        "transform_queue_size": 4.0,
        "transform_seed": 42,
        "unique": false,
        "verbose": false
    },
    "viz_data": "{\"columns\":[\"id\",\"x\",\"y\",\"document\",\"document_cleaned\",\"size\",\"category\"],\"index\":[0,1,2,3,4,5,6,7,8,9,10,11,12,13,14,15,16,17,18,19,20,21,22,23,24,25,26,27,28,29,30,31,32,33,34,35,36,37,38,39,40,41,42,43,44,45,46,47,48,49],\"data\":[[\"0f096b08-c3bb-11ee-90dd-bae7cd9d315e\",1.7419703007,-2.3999094963,\"SP-3 (MoS 2 impregnated) was sufficiently flexible that it could be wound in on itself and inserted past the  shoulder of the groove (see Figure 8) and as it turned out the Vespel\\u00ae SP-3 was also slightly slower wearing  than the prior metal\\/polymer composite bushing, a Glacier Garlock Bearings (now \\u201cGGB\\u201d) DP4\\u00ae. A key  take- away for other percussion mechanisms is to reduce or eliminate small parts whenever possible that  might not easily be able to grow to accommodate high loads , and particularly to expect high reversing l oads  at the back end of the hammer or striker.  \\n\\nChallenge: High drag during cold operation{'source': 'AMS_2020.pdf', 'page': 186}\",\"SP-3 (MoS 2 impregnated) was sufficiently flexible that it could be wound in on<br>itself and inserted past the  shoulder of the groove (see Figure 8) and as it<br>turned out the Vespel\\u00ae SP-3 was also slightly slower wearing  than the prior<br>metal\\/polymer composite bushing, a Glacier Garlock Bearings (now \\u201cGGB\\u201d) DP4\\u00ae. A<br>key  take- away for other percussion mechanisms is to reduce or eliminate small<br>parts whenever possible that  might not easily be able to grow to accommodate<br>high loads , and particularly to expect high reversing l oads  at the back end<br>of the hammer or striker.    Challenge: High drag during cold<br>operation{'source': 'AMS_2020.pdf', 'page': 186}\",3,\"Chunks\"],[\"111c856a-c3bb-11ee-90dd-bae7cd9d315e\",0.5395568013,-1.039867878,\"321   Figure 8. Cross -section view showing bearing mount geometry   Bearing analysis was performed using Orbis [1] . For all load cases, predicted contact stresses were lower  than the applicable operating and non- operating limits per GSFC -STD-7000A for 440C steel bearings (335  ksi (2310 MPa) and 400 ksi  (2760 MPa) , respectively , for non- quiet applications ). Alignment across the  temperature range was achieved by controlling the maximum interference  between the bearing races and  mounting surfaces (shaft and housing). Unloaded balls were predicted for the launch load cases at the 3sigma level but none were predicted at the 1- sigma level. Areas of concern were identified at instrument  CDR and closed out with additional analysis. There is still uncertainty related to these aspects of the design,  which are not easily modeled. None have been ruled out as contributing factors to the torque spikes  observed during thermal testing. Neither has any been singled out as the single root cause.   The driving load case for non- operational contact stress is launch vibration. Static equivalent loads were  generated for design purposes for 3 cases: Random X, Random Y and Random Z (all 3 sigma). A single  enveloping load case was constructed using the maximum components and a factor of safety of 1.3 was  applied to the l oad ( Table 2). A 1-\\u03c3 load case was also constructed.   Table 2. Enveloping static equivalent load case for launch vibration (3 \\u03c3 and 1 \\u03c3 ), including 1.3 FoS   Case  Fx (lbf)  Fy (lbf)  Fz (lbf)  Fyy (in -lbf) Fzz (in -lbf){'source': 'AMS_2020.pdf', 'page': 331}\",\"321   Figure 8. Cross -section view showing bearing mount geometry   Bearing<br>analysis was performed using Orbis [1] . For all load cases, predicted contact<br>stresses were lower  than the applicable operating and non- operating limits per<br>GSFC -STD-7000A for 440C steel bearings (335  ksi (2310 MPa) and 400 ksi  (2760<br>MPa) , respectively , for non- quiet applications ). Alignment across the<br>temperature range was achieved by controlling the maximum interference  between<br>the bearing races and  mounting surfaces (shaft and housing). Unloaded balls<br>were predicted for the launch load cases at the 3sigma level but none were<br>predicted at the 1- sigma level. Areas of concern were identified at instrument<br>CDR and closed out with additional analysis. There is still uncertainty related<br>to these aspects of the design,  which are not easily modeled. None have been<br>ruled out as contributing factors to the torque spikes  observed during thermal<br>testing. Neither has any been singled out as the single root cause.   The<br>driving load case for non- operational contact stress is launch vibration.<br>Static equivalent loads were  generated for design purposes for 3 cases: Random<br>X, Random Y and Random Z (all 3 sigma). A single  enveloping load case was<br>constructed using the maximum components and a factor of safety of 1.3 was<br>applied to the l oad ( Table 2). A 1-\\u03c3 load case was also constructed.   Table<br>2. Enveloping static equivalent load case for launch vibration (3 \\u03c3 and 1 \\u03c3 ),<br>including 1.3 FoS   Case  Fx (lbf)  Fy (lbf)  Fz (lbf)  Fyy (in -lbf) Fzz (in<br>-lbf){'source': 'AMS_2020.pdf', 'page': 331}\",3,\"Chunks\"],[\"11bb3106-c3bb-11ee-90dd-bae7cd9d315e\",5.8210754395,-1.2700840235,\"415 vibration\\/shock environment , and vacuum exposure.  After deter mining that the \\u00d820 mm and \\u00d832 mm  models provided the optimal power v ersus mass compromise, the commercial design was analyzed by a  team incorporating both JPL and maxon personnel with the intention of applying the previous experience  of both organizations  to optimiz e the design for ultimate reliability in the harsh Martian environment . Table 2  lists the features in the COTS design that needed modification.  \\n\\nTable 2.  COTS design and modifications for Martian environment   COTS Design  Design Risk for Mars  2020 Application  Solution   Flange bearing carrier out of several  parts with dissimilar materials  Connection under shock\\/vibration; c orrosion ;  coefficent of thermal expa nsion mismatch  Create one- piece flange\\/bearing carrier   Standard Hall sensors  Temperature range limitations, failure due to  radiation exposure  Use Hall sensor that can be qualified for  environmental conditions   Rotor shaft glued to bearing races  Shock and temperature environment breaks  adhesive bond and causes rotor to move Add securing\\/spacer rings to design and  mount all parts on shaft to hard stop. Weld  rotor to shaft   Main magnet only partially covered  in adhesive  Bond to rotor is not as strong as it could be and  might fail under repeated temperature cycling  Develop new bonding application process  to ensure at least 80% coverage   Flex-print PCB  Can flex under vibration environment , which  leads to mounted components breaking  Replace wit h FR4  and flying lead wire  connections   Winding taps run directly to PCB  ~1 cm lengths of unsupported thin wire  susceptible to vibration- induced resonance and{'source': 'AMS_2020.pdf', 'page': 425}\",\"415 vibration\\/shock environment , and vacuum exposure.  After deter mining that<br>the \\u00d820 mm and \\u00d832 mm  models provided the optimal power v ersus mass<br>compromise, the commercial design was analyzed by a  team incorporating both JPL<br>and maxon personnel with the intention of applying the previous experience  of<br>both organizations  to optimiz e the design for ultimate reliability in the<br>harsh Martian environment . Table 2  lists the features in the COTS design that<br>needed modification.    Table 2.  COTS design and modifications for Martian<br>environment   COTS Design  Design Risk for Mars  2020 Application  Solution<br>Flange bearing carrier out of several  parts with dissimilar materials<br>Connection under shock\\/vibration; c orrosion ;  coefficent of thermal expa nsion<br>mismatch  Create one- piece flange\\/bearing carrier   Standard Hall sensors<br>Temperature range limitations, failure due to  radiation exposure  Use Hall<br>sensor that can be qualified for  environmental conditions   Rotor shaft glued<br>to bearing races  Shock and temperature environment breaks  adhesive bond and<br>causes rotor to move Add securing\\/spacer rings to design and  mount all parts on<br>shaft to hard stop. Weld  rotor to shaft   Main magnet only partially covered<br>in adhesive  Bond to rotor is not as strong as it could be and  might fail under<br>repeated temperature cycling  Develop new bonding application process  to ensure<br>at least 80% coverage   Flex-print PCB  Can flex under vibration environment ,<br>which  leads to mounted components breaking  Replace wit h FR4  and flying lead<br>wire  connections   Winding taps run directly to PCB  ~1 cm lengths of<br>unsupported thin wire  susceptible to vibration- induced resonance and{'source':<br>'AMS_2020.pdf', 'page': 425}\",3,\"Chunks\"],[\"1484c410-c3bb-11ee-90dd-bae7cd9d315e\",-1.7982354164,3.5511536598,\"manufacturing floor) test room. This was mitigated by opening the test room during helium purge events,  and piping the LACO exhaust outside the testing area. Additionally, it should be noted that each interface  in the test set up presented a potential leak point. Each of the interfaces had to be meticulously secured  and checked (using a Helium sniffer bottle) to ensure that the cover mechanism would be isolated as  intended.   EDU to Flight Design Build and Test  Before updating the development design of the vacuum cover mechanism to flight, a system-level  requirements change was levied against the mechanism. It was determined that redundant NEG pumps  were necessary to counter outgassing inside the instrument. The NEG pumps, and subsequent housing,  could not be attached directly to the antechamber due to the antechamber\\u2019s function as the MASPEX  instrument input component. The cover\\u2019s H-seal was determined to be the only location to attach the NEG  pumps. This added a new wrinkle in the challenge of designing a deployable interface that could maintain  a hermetically sealed chamber. Additional design iterations were required to accommodate the seal growth  into the cover, hopefully without a complete re-design of the cover mechanism.{'source': 'AMS_2022.pdf', 'page': 24}\",\"manufacturing floor) test room. This was mitigated by opening the test room<br>during helium purge events,  and piping the LACO exhaust outside the testing<br>area. Additionally, it should be noted that each interface  in the test set up<br>presented a potential leak point. Each of the interfaces had to be meticulously<br>secured  and checked (using a Helium sniffer bottle) to ensure that the cover<br>mechanism would be isolated as  intended.   EDU to Flight Design Build and Test<br>Before updating the development design of the vacuum cover mechanism to flight,<br>a system-level  requirements change was levied against the mechanism. It was<br>determined that redundant NEG pumps  were necessary to counter outgassing inside<br>the instrument. The NEG pumps, and subsequent housing,  could not be attached<br>directly to the antechamber due to the antechamber\\u2019s function as the MASPEX<br>instrument input component. The cover\\u2019s H-seal was determined to be the only<br>location to attach the NEG  pumps. This added a new wrinkle in the challenge of<br>designing a deployable interface that could maintain  a hermetically sealed<br>chamber. Additional design iterations were required to accommodate the seal<br>growth  into the cover, hopefully without a complete re-design of the cover<br>mechanism.{'source': 'AMS_2022.pdf', 'page': 24}\",3,\"Chunks\"],[\"152a52d6-c3bb-11ee-90dd-bae7cd9d315e\",6.661711216,0.132277891,\"45 Calibration  Calibration not only provides information about the functionality of the measuring equipment, but also  precisely determines characteristics such as sensitivity, linearity, hysteresis, crosstalk and drift, and thus  contributes significantly to the overall accuracy of the measurement. Only a fully calibrated measurement  chain can provide the necessary confidence in the measurement equipment.  Figure 14 shows the calibration test stand where calibration is performed using a multi-component press  for high loads as illustrated below. In each axis there is a strain gage sensor to control the applied force  and a PE force sensor to quasi-statically calibrate the PE dynamometer in Fx, Fy and Fz. Figure 15 shows  the calibration results indicating very low crosstalk and highly linear operation of the multicomponent PE  force platform.  Application \\u2013 Ricor K508N Micro-Vibrations for the ATA system  Understanding the impact of micro-vibrations on spacecraft structures and payloads can be mission critical.  For example, micro-vibrations, or jitter, can cause excitation of the support structures for optical elements  during imaging operations, this can result in severe degradation of image quality due to smearing and  distortion for Earth observation satellites. A prime example of this is the inclusion of miniature cryocoolers  for sub-cooled electro-optical instrumentation on CubeSat platforms. Stirling cryocoolers in particular rely  on a dynamic compression stage which can induce high amplitude frequency dependent vibrations that can  be detrimental to sensitive optical instruments. The ATA system features an integrated Stirling based Ricor  K508N miniature cryocooler. The K508N is a long life tactical cryocooler based on a high-speed rotary{'source': 'AMS_2022.pdf', 'page': 59}\",\"45 Calibration  Calibration not only provides information about the<br>functionality of the measuring equipment, but also  precisely determines<br>characteristics such as sensitivity, linearity, hysteresis, crosstalk and drift,<br>and thus  contributes significantly to the overall accuracy of the measurement.<br>Only a fully calibrated measurement  chain can provide the necessary confidence<br>in the measurement equipment.  Figure 14 shows the calibration test stand where<br>calibration is performed using a multi-component press  for high loads as<br>illustrated below. In each axis there is a strain gage sensor to control the<br>applied force  and a PE force sensor to quasi-statically calibrate the PE<br>dynamometer in Fx, Fy and Fz. Figure 15 shows  the calibration results<br>indicating very low crosstalk and highly linear operation of the multicomponent<br>PE  force platform.  Application \\u2013 Ricor K508N Micro-Vibrations for the ATA<br>system  Understanding the impact of micro-vibrations on spacecraft structures<br>and payloads can be mission critical.  For example, micro-vibrations, or jitter,<br>can cause excitation of the support structures for optical elements  during<br>imaging operations, this can result in severe degradation of image quality due<br>to smearing and  distortion for Earth observation satellites. A prime example of<br>this is the inclusion of miniature cryocoolers  for sub-cooled electro-optical<br>instrumentation on CubeSat platforms. Stirling cryocoolers in particular rely<br>on a dynamic compression stage which can induce high amplitude frequency<br>dependent vibrations that can  be detrimental to sensitive optical instruments.<br>The ATA system features an integrated Stirling based Ricor  K508N miniature<br>cryocooler. The K508N is a long life tactical cryocooler based on a high-speed<br>rotary{'source': 'AMS_2022.pdf', 'page': 59}\",3,\"Chunks\"],[\"152a53bc-c3bb-11ee-90dd-bae7cd9d315e\",0.2152161598,3.1087625027,\"56 manufacturability, and minimize risk. It is believed that the flexures were damaged during assembly and  buckled during testing.  The second-generation cross flexure aimed to improve the design by analyzing the optimal blade thickness  to maintain the desired first mode frequency, meet power requirements and survive assembly, integration,  and test. To find the optimal blade thickness to meet frequency and power requirements, a program was  developed in MATLAB to relate first mode frequency and power consumption. To predict first mode  frequency for a given blade thickness, a structural analysis was completed to determine an approximate  first mode. The flexure blade thicknesses of 0.0381 mm (0.0015 in), 0.0483 mm (0.0023 in), 0.0635 mm  (0.0025 in), and 0.0686 mm (0.0027 in), were selected for analysis. Figure 12 plots a linear curve fit of the  predicted first mode frequency against flexure blade thicknesses.   Figure 12.  Flexure Blade Thickness (mm) vs First Mode Frequency (Hz)  To predict power consumption for a given blade thickness, the power consumed by the X2B-WASM serial  numbers X2WM1003a, X2WM1004a, and X2WM1005a from Table 2 were interpolated to create a  polynomial curve fit that could predict power consumed for a given blade thickness. To find the predicted  power for the analyzed blade thicknesses, the first mode frequencies determined from the structural  analysis are used to find the spring rate, and therefore holding current, needed to maintain the maximum  angle of travel. The power is then calculated by multiplying the square of the holding current by the{'source': 'AMS_2022.pdf', 'page': 70}\",\"56 manufacturability, and minimize risk. It is believed that the flexures were<br>damaged during assembly and  buckled during testing.  The second-generation<br>cross flexure aimed to improve the design by analyzing the optimal blade<br>thickness  to maintain the desired first mode frequency, meet power requirements<br>and survive assembly, integration,  and test. To find the optimal blade<br>thickness to meet frequency and power requirements, a program was  developed in<br>MATLAB to relate first mode frequency and power consumption. To predict first<br>mode  frequency for a given blade thickness, a structural analysis was completed<br>to determine an approximate  first mode. The flexure blade thicknesses of 0.0381<br>mm (0.0015 in), 0.0483 mm (0.0023 in), 0.0635 mm  (0.0025 in), and 0.0686 mm<br>(0.0027 in), were selected for analysis. Figure 12 plots a linear curve fit of<br>the  predicted first mode frequency against flexure blade thicknesses.   Figure<br>12.  Flexure Blade Thickness (mm) vs First Mode Frequency (Hz)  To predict power<br>consumption for a given blade thickness, the power consumed by the X2B-WASM<br>serial  numbers X2WM1003a, X2WM1004a, and X2WM1005a from Table 2 were<br>interpolated to create a  polynomial curve fit that could predict power consumed<br>for a given blade thickness. To find the predicted  power for the analyzed blade<br>thicknesses, the first mode frequencies determined from the structural  analysis<br>are used to find the spring rate, and therefore holding current, needed to<br>maintain the maximum  angle of travel. The power is then calculated by<br>multiplying the square of the holding current by the{'source': 'AMS_2022.pdf',<br>'page': 70}\",3,\"Chunks\"],[\"15cf1582-c3bb-11ee-90dd-bae7cd9d315e\",10.3012962341,0.8196710348,\"index i specifies the gas species (igniter product, output charge product, or initially present gas) and index  j specifies the control volume (CV, three total in the device presented herein), and index k specifies the  orifice (2 total in the device presented herein).  \\ud835\\udc43\\ud835\\udc57(\\ud835\\udc63\\ud835\\udc57\\u2212\\ud835\\udc4f\\u0305\\ud835\\udc57)=\\ud835\\udc45\\u0305\\ud835\\udc57\\ud835\\udc47\\ud835\\udc57 (1)  \\ud835\\udc45\\u0305\\ud835\\udc57=\\u2211\\ud835\\udc65\\ud835\\udc56,\\ud835\\udc57\\ud835\\udc45\\ud835\\udc56\\ud835\\udc56 (2)  \\ud835\\udc4f\\u0305\\ud835\\udc57=\\u2211\\ud835\\udc65\\ud835\\udc56,\\ud835\\udc57\\ud835\\udc4f\\ud835\\udc56\\ud835\\udc56 (3)  \\ud835\\udf06\\u0307\\ud835\\udc56,\\ud835\\udc57=\\ud835\\udc4e\\ud835\\udc56\\ud835\\udc43\\ud835\\udc57\\ud835\\udc5b\\ud835\\udc56 \\ud835\\udc5f\\ud835\\udc56(4){'source': 'AMS_2022.pdf', 'page': 127}\",\"index i specifies the gas species (igniter product, output charge product, or<br>initially present gas) and index  j specifies the control volume (CV, three<br>total in the device presented herein), and index k specifies the  orifice (2<br>total in the device presented herein).  \\ud835\\udc43\\ud835\\udc57(\\ud835\\udc63\\ud835\\udc57\\u2212\\ud835\\udc4f\\u0305\\ud835\\udc57)=\\ud835\\udc45\\u0305\\ud835\\udc57\\ud835\\udc47\\ud835\\udc57 (1)  \\ud835\\udc45\\u0305\\ud835\\udc57=\\u2211\\ud835\\udc65\\ud835\\udc56,\\ud835\\udc57\\ud835\\udc45\\ud835\\udc56\\ud835\\udc56 (2)<br>\\ud835\\udc4f\\u0305\\ud835\\udc57=\\u2211\\ud835\\udc65\\ud835\\udc56,\\ud835\\udc57\\ud835\\udc4f\\ud835\\udc56\\ud835\\udc56 (3)  \\ud835\\udf06\\u0307\\ud835\\udc56,\\ud835\\udc57=\\ud835\\udc4e\\ud835\\udc56\\ud835\\udc43\\ud835\\udc57\\ud835\\udc5b\\ud835\\udc56 \\ud835\\udc5f\\ud835\\udc56(4){'source': 'AMS_2022.pdf', 'page': 127}\",3,\"Chunks\"],[\"187df8e8-c3bb-11ee-90dd-bae7cd9d315e\",-2.9997007847,-0.2276394963,\"332 Figure 13. Magnetic Field of a Stator Measured with a Surrogate Magnetic Element Represented on a  Polar Plot. The Magnetic Centroid is Shown in Red.  Radial Magnetic Force as a Function of Rotor-Stator Offset in the Pump Motor Assembly  Following the magnetic characterization of the rotor and stator separately, various measurements were  made at the pump motor-assembly level. First, the stator was translated vertically with the rotor remaining  in a fixed position. Because magnetic forces increase with a reduction in distance between sources, the  offset generates a greater radial magnetic attractive force in the area of least air gap between the rotor and  stator. As shown in Figure 14, the starting point for the stator was chosen to be at a hard limit, with the  upper portion of the stator bore contacting the outside diameter of the rotor. The stator was then translated  upward, allowing the rotor to pass through the center of the stator until coming into contact with the opposite  side of the stator bore. Neither rotor nor stator were rotated during this translation.{'source': 'AMS_2022.pdf', 'page': 346}\",\"332 Figure 13. Magnetic Field of a Stator Measured with a Surrogate Magnetic<br>Element Represented on a  Polar Plot. The Magnetic Centroid is Shown in Red.<br>Radial Magnetic Force as a Function of Rotor-Stator Offset in the Pump Motor<br>Assembly  Following the magnetic characterization of the rotor and stator<br>separately, various measurements were  made at the pump motor-assembly level.<br>First, the stator was translated vertically with the rotor remaining  in a fixed<br>position. Because magnetic forces increase with a reduction in distance between<br>sources, the  offset generates a greater radial magnetic attractive force in the<br>area of least air gap between the rotor and  stator. As shown in Figure 14, the<br>starting point for the stator was chosen to be at a hard limit, with the  upper<br>portion of the stator bore contacting the outside diameter of the rotor. The<br>stator was then translated  upward, allowing the rotor to pass through the<br>center of the stator until coming into contact with the opposite  side of the<br>stator bore. Neither rotor nor stator were rotated during this<br>translation.{'source': 'AMS_2022.pdf', 'page': 346}\",3,\"Chunks\"],[\"79248bc2-c3ba-11ee-90dd-bae7cd9d315e\",2.9872684479,5.6570949554,\"cools, a Push Piston return spring resets the actuator for further ground testing. Resetting of the cover  and Latch Arm is manually performed.  Latch Mechanism  Cover 7  Hinge  Mechanism 7  Energy  Absorber  Mechanisms  Energy  Absorber  Structure Figure 1. Cover Deployment  L and Latch Cover Ring  Magnets  Instrument  Canister  Microswitches  -  LatchArm - 1  Figure 2. Latch mechanism and Cover\\/Cover Ring  66{'source': 'AMS_2006.pdf', 'page': 80}\",\"cools, a Push Piston return spring resets the actuator for further ground<br>testing. Resetting of the cover  and Latch Arm is manually performed.  Latch<br>Mechanism  Cover 7  Hinge  Mechanism 7  Energy  Absorber  Mechanisms  Energy<br>Absorber  Structure Figure 1. Cover Deployment  L and Latch Cover Ring  Magnets<br>Instrument  Canister  Microswitches  -  LatchArm - 1  Figure 2. Latch mechanism<br>and Cover\\/Cover Ring  66{'source': 'AMS_2006.pdf', 'page': 80}\",3,\"Chunks\"],[\"79248cf8-c3ba-11ee-90dd-bae7cd9d315e\",0.8648734093,4.910949707,\"Figure 6. QWKNUT Latch In-Process Test Fixture  Discussion and Lessons Learned  The vibration anomaly is an example of how insufficient controls on critical features will, in time, cause a  failure. The first four production lots were not discrepant, and there was no indication of a shortcoming in  the design -- the problem was simply dormant. Design intent must be clearly communicated in  engineering drawings. This requires a thorough understanding of which features are critical to  performance. If adequate engineering controls are not in place, the discrepancy will eventually emerge  with enough repetition (or opportunity). Parts from different lots may both meet the same drawing  requirements but perform differently in a mechanism. Proper identification and inspection of critical  features is essential, and in-process screening at the assembly level provides redundancy in detection of  variation.  Failures are sometimes created as a result of two or more prevailing conditions. Care must be taken to  ensure root cause and all contributing causes are identified before the investigation process is concluded.  Low spring force was initially thought to be the cause because with a certain minimum spring force, even  the discrepant lever geometry could not cause a vibration failure. Increasing spring force did resolve  vibration release, but did not create consistent latch performance. Proper performance under vibration  loads is now ensured by a combination of geometric drawing controls, a rigorous inspection plan,  assembly level screening tests, and finally ATP. These added controls, and a deeper understanding of  the design, were some benefits of the investigation process.  Failure to Release during ATP  Following the resolution of the vibration anomaly, production of the QWKNUT resumed with the vibration  corrective actions fully implemented. The \\\"Gen 1 A QWKNUT configuration now contained dual-springs{'source': 'AMS_2006.pdf', 'page': 94}\",\"Figure 6. QWKNUT Latch In-Process Test Fixture  Discussion and Lessons Learned<br>The vibration anomaly is an example of how insufficient controls on critical<br>features will, in time, cause a  failure. The first four production lots were<br>not discrepant, and there was no indication of a shortcoming in  the design --<br>the problem was simply dormant. Design intent must be clearly communicated in<br>engineering drawings. This requires a thorough understanding of which features<br>are critical to  performance. If adequate engineering controls are not in place,<br>the discrepancy will eventually emerge  with enough repetition (or opportunity).<br>Parts from different lots may both meet the same drawing  requirements but<br>perform differently in a mechanism. Proper identification and inspection of<br>critical  features is essential, and in-process screening at the assembly level<br>provides redundancy in detection of  variation.  Failures are sometimes created<br>as a result of two or more prevailing conditions. Care must be taken to  ensure<br>root cause and all contributing causes are identified before the investigation<br>process is concluded.  Low spring force was initially thought to be the cause<br>because with a certain minimum spring force, even  the discrepant lever geometry<br>could not cause a vibration failure. Increasing spring force did resolve<br>vibration release, but did not create consistent latch performance. Proper<br>performance under vibration  loads is now ensured by a combination of geometric<br>drawing controls, a rigorous inspection plan,  assembly level screening tests,<br>and finally ATP. These added controls, and a deeper understanding of  the<br>design, were some benefits of the investigation process.  Failure to Release<br>during ATP  Following the resolution of the vibration anomaly, production of the<br>QWKNUT resumed with the vibration  corrective actions fully implemented. The<br>\\\"Gen 1 A QWKNUT configuration now contained dual-springs{'source':<br>'AMS_2006.pdf', 'page': 94}\",3,\"Chunks\"],[\"7b45a670-c3ba-11ee-90dd-bae7cd9d315e\",2.0161163807,-0.9991881847,\"couplings with the flight misalignment duplicated. The life test was stopped after the required design life of  3 years \\/ 50 million revolutions as it was deemed unlikely that a fatigue failure would occur past that point  (and because the life test gearbox wore out). There are many different styles\\/designs of shaft couplings,  the more common being Oldham and Bellows. The Oldham can wear and have backlash issues whereas  the bellows can fail by fatigue (either in vibration testing or operation). An assessment of the life-limiting  21 4{'source': 'AMS_2006.pdf', 'page': 228}\",\"couplings with the flight misalignment duplicated. The life test was stopped<br>after the required design life of  3 years \\/ 50 million revolutions as it was<br>deemed unlikely that a fatigue failure would occur past that point  (and because<br>the life test gearbox wore out). There are many different styles\\/designs of<br>shaft couplings,  the more common being Oldham and Bellows. The Oldham can wear<br>and have backlash issues whereas  the bellows can fail by fatigue (either in<br>vibration testing or operation). An assessment of the life-limiting  21<br>4{'source': 'AMS_2006.pdf', 'page': 228}\",3,\"Chunks\"],[\"7bfc0e4c-c3ba-11ee-90dd-bae7cd9d315e\",-4.6696848869,1.6002944708,\"Yovanovich\\u2019s analysis provides an explanation for the observed trend. His model assumes the  mechanism of heat transfer through a non-lubricated static bearing is pure conductance, from the hotter  race, through the ball, and to the cooler race (Figure 2) and the driving source of resistance across the  bearing arose from the thermal constriction region between the ball and the race contacts. This  recognition presumes perfect contact (no asperities), and negligible resistance within the ball and both  races.  Q A Cooler  Race  Rball = Rin + Rout  Gball = 1 \\/Rball Hertzian  Contact  Hotter Race t Rin  Figure 2. Thermal Resistance Across One Bearing Ball  As such, Yovanovich calculated the thermal resistance across a dry static bearing by modeling the ball  and races as semi-infinite half-planes with the Hertzian contact area modeled as the thermal constriction  region. The basic equations to calculate thermal resistance across each of the ball to race contacts are:  inner race to ball thermal resistance  ball to outer race thermal resistance  total thermal resistance across the ball  Where Y is a non-dimensional geometric factor defined as:  \\\\I12 where n = i or o 17  \\u201c-b\\u201csin2 a: (4)  The Hertzian contact ellipse, and associated major and minor axes (a and b), can be calculated by a  number of existing programs based on classical Hertzian theory, such as BRGSlOC [12]. Here, the major  and minor axes are related to the applied axial load to the 113 power. Thus, the total Hertzian contact area  is related to the applied axial load to the 213 power.  a.b{'source': 'AMS_2006.pdf', 'page': 308}\",\"Yovanovich\\u2019s analysis provides an explanation for the observed trend. His model<br>assumes the  mechanism of heat transfer through a non-lubricated static bearing<br>is pure conductance, from the hotter  race, through the ball, and to the cooler<br>race (Figure 2) and the driving source of resistance across the  bearing arose<br>from the thermal constriction region between the ball and the race contacts.<br>This  recognition presumes perfect contact (no asperities), and negligible<br>resistance within the ball and both  races.  Q A Cooler  Race  Rball = Rin +<br>Rout  Gball = 1 \\/Rball Hertzian  Contact  Hotter Race t Rin  Figure 2. Thermal<br>Resistance Across One Bearing Ball  As such, Yovanovich calculated the thermal<br>resistance across a dry static bearing by modeling the ball  and races as semi-<br>infinite half-planes with the Hertzian contact area modeled as the thermal<br>constriction  region. The basic equations to calculate thermal resistance across<br>each of the ball to race contacts are:  inner race to ball thermal resistance<br>ball to outer race thermal resistance  total thermal resistance across the ball<br>Where Y is a non-dimensional geometric factor defined as:  \\\\I12 where n = i or o<br>17  \\u201c-b\\u201csin2 a: (4)  The Hertzian contact ellipse, and associated major and<br>minor axes (a and b), can be calculated by a  number of existing programs based<br>on classical Hertzian theory, such as BRGSlOC [12]. Here, the major  and minor<br>axes are related to the applied axial load to the 113 power. Thus, the total<br>Hertzian contact area  is related to the applied axial load to the 213 power.<br>a.b{'source': 'AMS_2006.pdf', 'page': 308}\",3,\"Chunks\"],[\"824b6284-c3ba-11ee-90dd-bae7cd9d315e\",5.2132520676,2.0296800137,\"377 and motor rotor are bolted and liquid pinned to the shaft. The motor stator mount houses the stator, and  attaches to the non-mirror end of the SSM. The motor stator mount is a separate part from the bearing housing so that it can be shipped to the motor vendor for stator build up independent of the rest of the SSM. Similarly, the mirror mount is a separate part from the shaft to allow concurrent, independent assembly. The motor mount, mirror mount, and rotor shaft are finished in Tiodize type II for corrosion protection. The bearing housing was not Tiodized; it was left bare since it is almost entirely covered with strip heaters and other thermal control components which require non-anodized surfaces to minimize the generation of thermal hot spots.  \\n\\nFigure 5. Internal detail of the SSM is shown in this quarter section view.  Several features were introduced to facilitate handling, reduce risk, and ease testing. Lift points and shipping interface points were independent of the flight interface points. This protected the precision flight interface from possible damage and wear from the numerous shipping and handling operations prior to installation in the instrument. A quartz optical cube was bonded to the motor housing to provide a boresight reference, facilitating SSM alignment and shimming into the TIRS instrument. Mirror pointing and stability measurements were referenced to this fiducial.{'source': 'AMS_2012.pdf', 'page': 391}\",\"377 and motor rotor are bolted and liquid pinned to the shaft. The motor stator<br>mount houses the stator, and  attaches to the non-mirror end of the SSM. The<br>motor stator mount is a separate part from the bearing housing so that it can be<br>shipped to the motor vendor for stator build up independent of the rest of the<br>SSM. Similarly, the mirror mount is a separate part from the shaft to allow<br>concurrent, independent assembly. The motor mount, mirror mount, and rotor shaft<br>are finished in Tiodize type II for corrosion protection. The bearing housing<br>was not Tiodized; it was left bare since it is almost entirely covered with<br>strip heaters and other thermal control components which require non-anodized<br>surfaces to minimize the generation of thermal hot spots.    Figure 5. Internal<br>detail of the SSM is shown in this quarter section view.  Several features were<br>introduced to facilitate handling, reduce risk, and ease testing. Lift points<br>and shipping interface points were independent of the flight interface points.<br>This protected the precision flight interface from possible damage and wear from<br>the numerous shipping and handling operations prior to installation in the<br>instrument. A quartz optical cube was bonded to the motor housing to provide a<br>boresight reference, facilitating SSM alignment and shimming into the TIRS<br>instrument. Mirror pointing and stability measurements were referenced to this<br>fiducial.{'source': 'AMS_2012.pdf', 'page': 391}\",3,\"Chunks\"],[\"8977e9ce-c3ba-11ee-90dd-bae7cd9d315e\",6.7602710724,5.0513091087,\"The CAS us es the same capture lat ch as SSAS; however , due to the alignment gui des being part of  the  load path, they are of a di fferent design (Figure 12). The berthi ng process is the same as SSAS except  once the latch is clo sed th e attachme nt is com plete (no bolting sy stem). Th e last operation i s to enga ge a  remotely operated um bilical  mechani sm (power and data). The umbilical m echani sm is driven  by either of  two inde pendent motor d rive mechani sms (sam e moto rs as used in the captu re latch) fo r redundancy and   has, additionally, a mechanical EVA-oper ated contingency override m echanism for the event of total   electrical failure.   \\n\\nCAS Verific ation  The CAS uses  the same verific ation strategy as  SSAS with one exception. Each active CAS mus t be  compatible wi th all passive CAS. Unlik e SSAS, t he CAS des ign is not over-con strained and is  therefore  more compli ant to variations between assembli es. Similar to SSAS the CAS verification entailed hardware  fit checks and digital insp ection s. Du e to there bei ng only one p assive sim ulator, all possib le variation s  could not be verified. An analysi s of th e digital in spections i n conju nction  with the fit ch eck data is used to  verify the int erface will in deed acco mmodate worst-ca se tol erances. A vari ation of the CAS wa s used{'source': 'AMS_2004.pdf', 'page': 325}\",\"The CAS us es the same capture lat ch as SSAS; however , due to the alignment<br>gui des being part of  the  load path, they are of a di fferent design (Figure<br>12). The berthi ng process is the same as SSAS except  once the latch is clo sed<br>th e attachme nt is com plete (no bolting sy stem). Th e last operation i s to<br>enga ge a  remotely operated um bilical  mechani sm (power and data). The<br>umbilical m echani sm is driven  by either of  two inde pendent motor d rive<br>mechani sms (sam e moto rs as used in the captu re latch) fo r redundancy and<br>has, additionally, a mechanical EVA-oper ated contingency override m echanism<br>for the event of total   electrical failure.     CAS Verific ation  The CAS uses<br>the same verific ation strategy as  SSAS with one exception. Each active CAS mus<br>t be  compatible wi th all passive CAS. Unlik e SSAS, t he CAS des ign is not<br>over-con strained and is  therefore  more compli ant to variations between<br>assembli es. Similar to SSAS the CAS verification entailed hardware  fit checks<br>and digital insp ection s. Du e to there bei ng only one p assive sim ulator,<br>all possib le variation s  could not be verified. An analysi s of th e digital<br>in spections i n conju nction  with the fit ch eck data is used to  verify the<br>int erface will in deed acco mmodate worst-ca se tol erances. A vari ation of<br>the CAS wa s used{'source': 'AMS_2004.pdf', 'page': 325}\",3,\"Chunks\"],[\"8977eb18-c3ba-11ee-90dd-bae7cd9d315e\",6.781188488,5.7630553246,\"Figure 9.  Berthing Case 1a: Forces In The Spring-Loaded Capture Pin  Figure 10 (case1b, 1c) shows the y-component of the pi n-cone contact forces. Sinc e there is no friction,  the y-component of the pin-cone contact is zero as  the pin rides along the cylindrical portion of the  alignment cone. After capture pins click in, P5 rebounds  as the shear cylinder hits the fine alignment nut,  and additional impacts occur between pin and cone as it is trapped inside the slot.    323{'source': 'AMS_2004.pdf', 'page': 337}\",\"Figure 9.  Berthing Case 1a: Forces In The Spring-Loaded Capture Pin  Figure 10<br>(case1b, 1c) shows the y-component of the pi n-cone contact forces. Sinc e there<br>is no friction,  the y-component of the pin-cone contact is zero as  the pin<br>rides along the cylindrical portion of the  alignment cone. After capture pins<br>click in, P5 rebounds  as the shear cylinder hits the fine alignment nut,  and<br>additional impacts occur between pin and cone as it is trapped inside the slot.<br>323{'source': 'AMS_2004.pdf', 'page': 337}\",3,\"Chunks\"],[\"8c7297f0-c3ba-11ee-90dd-bae7cd9d315e\",9.6361503601,1.9842694998,\"174 Acknowledgements \\n\\nThe authors and co-authors of this paper express their gratitude to the failure investigation teams. The  collaborative efforts of NASA, Boeing, NESC, Battelle, The Aerospace Corporation, L-3 S&N, and independent consultants resulted in comprehensive inve stigations that resulted in identifying the most  probable cause for both anomalie s. Accolades we re expressed by Boeing and NASA upper management  many times for the team work, leadership and efficiency of the teams identified below:  \\n\\n   CMG1 Failure Investigation Team     NASA\\/CP-2010-216272{'source': 'AMS_2010.pdf', 'page': 190}\",\"174 Acknowledgements   The authors and co-authors of this paper express their<br>gratitude to the failure investigation teams. The  collaborative efforts of<br>NASA, Boeing, NESC, Battelle, The Aerospace Corporation, L-3 S&N, and<br>independent consultants resulted in comprehensive inve stigations that resulted<br>in identifying the most  probable cause for both anomalie s. Accolades we re<br>expressed by Boeing and NASA upper management  many times for the team work,<br>leadership and efficiency of the teams identified below:       CMG1 Failure<br>Investigation Team     NASA\\/CP-2010-216272{'source': 'AMS_2010.pdf', 'page':<br>190}\",3,\"Chunks\"],[\"8e988dd2-c3ba-11ee-90dd-bae7cd9d315e\",9.7839889526,1.8869913816,\"Marcel-Decker, New York. Pell, Mel,  Dunson, J.B., and  Know lton, T.M. (2008). \\u201cGas-Solid Operations and Equipment,\\u201d Ch. 17 in  \\u201cPerry's Chemical Engineers' Handbook\\u201d (8th Edition), eds. Green, Don W. and Perry, Robert H.,  McGraw-Hill, New York. Sanders, G.; Larson, W., \\u201cNASA In-S itu Resource Utilization (ISRU) Development & Field Testing,\\u201d  Presentation to \\u201c Hawaii\\u2019s Aerospac e Industry: The Next Frontier\\u201d, Ho nolulu, The Hawaii State Capital  Auditorium, August 21, 2008 Schrunk, David G., Sharpe, B.L., Cooper, B.L., and Thangavelu, M. (1999). \\u201cThe Moon: Resources,  Future Development and Colonization,\\u201d Wiley-Praxis, New York. Sullivan, Thomas A., Koenig, E., Knudsen, C.W., and Gibson, M.A. (1992). \\u201cPneumatic Conveying of  Materials at Partial Gravity,\\u201d AIAA 92-1667, presented at the AIAA Space Prog. and Tech. Conf., 24-27  March 1992, Huntsville, Alabama. Sullivan, Thomas A., Koenig, E., Knudsen, C.W., and Gibson, M.A. (1994). \\u201cPneumatic Conveying of  Materials at Partial Gravity,\\u201d J. Aerosp. Eng. 7(2), 199-208.{'source': 'AMS_2010.pdf', 'page': 294}\",\"Marcel-Decker, New York. Pell, Mel,  Dunson, J.B., and  Know lton, T.M. (2008).<br>\\u201cGas-Solid Operations and Equipment,\\u201d Ch. 17 in  \\u201cPerry's Chemical Engineers'<br>Handbook\\u201d (8th Edition), eds. Green, Don W. and Perry, Robert H.,  McGraw-Hill,<br>New York. Sanders, G.; Larson, W., \\u201cNASA In-S itu Resource Utilization (ISRU)<br>Development & Field Testing,\\u201d  Presentation to \\u201c Hawaii\\u2019s Aerospac e Industry:<br>The Next Frontier\\u201d, Ho nolulu, The Hawaii State Capital  Auditorium, August 21,<br>2008 Schrunk, David G., Sharpe, B.L., Cooper, B.L., and Thangavelu, M. (1999).<br>\\u201cThe Moon: Resources,  Future Development and Colonization,\\u201d Wiley-Praxis, New<br>York. Sullivan, Thomas A., Koenig, E., Knudsen, C.W., and Gibson, M.A. (1992).<br>\\u201cPneumatic Conveying of  Materials at Partial Gravity,\\u201d AIAA 92-1667, presented<br>at the AIAA Space Prog. and Tech. Conf., 24-27  March 1992, Huntsville, Alabama.<br>Sullivan, Thomas A., Koenig, E., Knudsen, C.W., and Gibson, M.A. (1994).<br>\\u201cPneumatic Conveying of  Materials at Partial Gravity,\\u201d J. Aerosp. Eng. 7(2),<br>199-208.{'source': 'AMS_2010.pdf', 'page': 294}\",3,\"Chunks\"],[\"8fd5dce0-c3ba-11ee-90dd-bae7cd9d315e\",-1.0486627817,6.3599224091,\"340 Summary and Lessons Learned  \\n\\nThe initially used procedure of EDM machining of the thin flexible shutter hinges was not the appropriate  technology. It was shown that the unfavorable oxidati on affinity of titanium, which is accompanied by a  variation of the structural properties, lead to  arbitrary results and a low surface quality. \\n\\nWith a revised version of the shutter, it was possi ble to manufacture the complex geometry by micromachining and an adjacent pickling procedure. The va riation of the spring constant was below \\u00b11 N\\/m.  The realization as a monolithic structure offers furt her potential for miniaturization. In general, the usage  of titanium offers advantages due to the low mass, high  specific stiffness (ratio of the specific strength  and the Young\\u2019s Modulus) and high fatigue strength.   Acknowledgements   MERTIS is a joint project of the Institut f\\u00fcr Planetologie (IfP) at the Westf\\u00e4lische Wilhelms-Universit\\u00e4t (WWU) M\\u00fcnster and two institutes of the German Aerosp ace Center (DLR) in Berlin-Adlershof, as well as  several industrial partners, including Kayser-Threde GmbH M\\u00fcnchen. The MERTIS instrument, funded by the Federal Government of Germany through the German Space Agency, is part of the scientific payload  of the BepiColombo mission to Mercury. This miss ion is developed by the Eu ropean Space Agency (ESA)  in close collaboration with Japan.   References \\n\\n[1] S.D. Lewis et al.: SPACE MECHANISM DEVELOPMENT LESSONS TO BE LEARNED \\u2013 AN{'source': 'AMS_2010.pdf', 'page': 356}\",\"340 Summary and Lessons Learned    The initially used procedure of EDM machining<br>of the thin flexible shutter hinges was not the appropriate  technology. It was<br>shown that the unfavorable oxidati on affinity of titanium, which is accompanied<br>by a  variation of the structural properties, lead to  arbitrary results and a<br>low surface quality.   With a revised version of the shutter, it was possi ble<br>to manufacture the complex geometry by micromachining and an adjacent pickling<br>procedure. The va riation of the spring constant was below \\u00b11 N\\/m.  The<br>realization as a monolithic structure offers furt her potential for<br>miniaturization. In general, the usage  of titanium offers advantages due to the<br>low mass, high  specific stiffness (ratio of the specific strength  and the<br>Young\\u2019s Modulus) and high fatigue strength.   Acknowledgements   MERTIS is a<br>joint project of the Institut f\\u00fcr Planetologie (IfP) at the Westf\\u00e4lische<br>Wilhelms-Universit\\u00e4t (WWU) M\\u00fcnster and two institutes of the German Aerosp ace<br>Center (DLR) in Berlin-Adlershof, as well as  several industrial partners,<br>including Kayser-Threde GmbH M\\u00fcnchen. The MERTIS instrument, funded by the<br>Federal Government of Germany through the German Space Agency, is part of the<br>scientific payload  of the BepiColombo mission to Mercury. This miss ion is<br>developed by the Eu ropean Space Agency (ESA)  in close collaboration with<br>Japan.   References   [1] S.D. Lewis et al.: SPACE MECHANISM DEVELOPMENT LESSONS<br>TO BE LEARNED \\u2013 AN{'source': 'AMS_2010.pdf', 'page': 356}\",3,\"Chunks\"],[\"918734d0-c3ba-11ee-90dd-bae7cd9d315e\",0.4790298641,7.219127655,\"417 a profile guide for the antenna whilst they are folded. The deployment mechanism operation is analyzed  below and the features of the elements that make it up are described.   Sub-chassis  As explained, the sub-chassis is  the piece upon which all the necessary elements are attached for  deployment mechanism operation.   General requirements and design process\\n\\nAntenna design basic requirements:  \\u2022 Each antenna must be located in the center of the edge of the +X face of the CubeSat.  \\u2022 The exit angle must be 45\\u00ba ( \\u03c0\\/4 rad) with respect to the adjacent edge of each antenna.   A plaque with solar panels to power CubeSat was also expected to be installed on the +X face, so the part used to hold the antenna had to leave as much space as possible for the installation of these panels. Being the largest part in the syst em meant weight had to be kept down to a minimum to give as much  margin as possible to other elements.  In order to save mass, system design began as a set of independent parts, four for antenna attachment and another four as guides to give the folded ant enna curvature and keep them within the available  envelope. However, the large number of attachment elements needed for this set-up made it unviable. The approach was changed and a continuous profile was designed for attaching the antenna and guiding them in their folded path. The profile moved as far out from the shielding as possible so that the greatest  number of solar panels could be installed in the free interior space. The piece to which the antenna was attached was called the sub-chassis.{'source': 'AMS_2010.pdf', 'page': 433}\",\"417 a profile guide for the antenna whilst they are folded. The deployment<br>mechanism operation is analyzed  below and the features of the elements that<br>make it up are described.   Sub-chassis  As explained, the sub-chassis is  the<br>piece upon which all the necessary elements are attached for  deployment<br>mechanism operation.   General requirements and design process  Antenna design<br>basic requirements:  \\u2022 Each antenna must be located in the center of the edge of<br>the +X face of the CubeSat.  \\u2022 The exit angle must be 45\\u00ba ( \\u03c0\\/4 rad) with<br>respect to the adjacent edge of each antenna.   A plaque with solar panels to<br>power CubeSat was also expected to be installed on the +X face, so the part used<br>to hold the antenna had to leave as much space as possible for the installation<br>of these panels. Being the largest part in the syst em meant weight had to be<br>kept down to a minimum to give as much  margin as possible to other elements.<br>In order to save mass, system design began as a set of independent parts, four<br>for antenna attachment and another four as guides to give the folded ant enna<br>curvature and keep them within the available  envelope. However, the large<br>number of attachment elements needed for this set-up made it unviable. The<br>approach was changed and a continuous profile was designed for attaching the<br>antenna and guiding them in their folded path. The profile moved as far out from<br>the shielding as possible so that the greatest  number of solar panels could be<br>installed in the free interior space. The piece to which the antenna was<br>attached was called the sub-chassis.{'source': 'AMS_2010.pdf', 'page': 433}\",3,\"Chunks\"],[\"92ea04ba-c3ba-11ee-90dd-bae7cd9d315e\",1.8948040009,-4.0058269501,\"numbers of contact cycles. Using 48,000 actuations of the mechanism as the needed life, with each actuation requiring a forward and reverse traverse, the duration for some points on the mechanism\\u2019stitanium-alloy plate is 96,000 contact cycles. Other points of the mechanism\\u2019s plate are passed over by two rollers for each traverse, requiring 192,000 contact cycles. The mechanism steel roller surfaces experience up to three contact cycles per traverse, requiring 288,000 contact cycles. Further complicating selection of the VRR test duration, the lifetime of a solid lubricating film is not reliably calculated for all situations by simple proportionality to contact cycles.  For mild wear, the wear rate is often modeled, to a first approximation, using the Archard wear model [12] as proportional to the product of contact pressure  and sliding distance. The VRR test duration was selected as 90,000 contact cycles. This selection enabled a desired testing pace of two tests per week and was considered to provide a reasonable match of both total contact cycles and a simple wear index (product of sliding distance and contact pressure) in  comparing the VRR to the mechanism. Table 2 summarizes some of the key engineering parameters one  might use to compare VRR to the mechanism in terms of contact conditions and durability concepts. The VRR can be considered as an accelerated wear test in terms of higher contact pressures and faster  speeds. In this way the alternative materials were evaluated on a relative basis with good relevance to the application. The VRR tests were intended to complement but not substitute for qualification testing.  Table 1. Hertz Contact Conditions mechanism test rig pressure, max. (MPa) 330 460 pressure, mean (MPa) 220 310 a (mm) 1.77 2.30 b (mm) 0.124 0.200{'source': 'AMS_2014.pdf', 'page': 107}\",\"numbers of contact cycles. Using 48,000 actuations of the mechanism as the<br>needed life, with each actuation requiring a forward and reverse traverse, the<br>duration for some points on the mechanism\\u2019stitanium-alloy plate is 96,000<br>contact cycles. Other points of the mechanism\\u2019s plate are passed over by two<br>rollers for each traverse, requiring 192,000 contact cycles. The mechanism steel<br>roller surfaces experience up to three contact cycles per traverse, requiring<br>288,000 contact cycles. Further complicating selection of the VRR test duration,<br>the lifetime of a solid lubricating film is not reliably calculated for all<br>situations by simple proportionality to contact cycles.  For mild wear, the wear<br>rate is often modeled, to a first approximation, using the Archard wear model<br>[12] as proportional to the product of contact pressure  and sliding distance.<br>The VRR test duration was selected as 90,000 contact cycles. This selection<br>enabled a desired testing pace of two tests per week and was considered to<br>provide a reasonable match of both total contact cycles and a simple wear index<br>(product of sliding distance and contact pressure) in  comparing the VRR to the<br>mechanism. Table 2 summarizes some of the key engineering parameters one  might<br>use to compare VRR to the mechanism in terms of contact conditions and<br>durability concepts. The VRR can be considered as an accelerated wear test in<br>terms of higher contact pressures and faster  speeds. In this way the<br>alternative materials were evaluated on a relative basis with good relevance to<br>the application. The VRR tests were intended to complement but not substitute<br>for qualification testing.  Table 1. Hertz Contact Conditions mechanism test rig<br>pressure, max. (MPa) 330 460 pressure, mean (MPa) 220 310 a (mm) 1.77 2.30 b<br>(mm) 0.124 0.200{'source': 'AMS_2014.pdf', 'page': 107}\",3,\"Chunks\"],[\"939b1174-c3ba-11ee-90dd-bae7cd9d315e\",-0.3133097589,-2.6356313229,\"Starvation Results\\u201d  \\/g36\\/g54\\/g48\\/g40\\/g3\\/g45\\/g17\\/g3\\/g47\\/g88\\/g69\\/g85\\/g17\\/g3\\/g55\\/g72\\/g70\\/g75\\/g81\\/g82\\/g79\\/g17 99 (1977), 15-23 3. Coy, J.J., and Zaretsky \\u201cSome Limitations in Applying Classical EHD Film Thickness Formulas to a HighSpeed Bearing\\u201d \\/g36\\/g54\\/g48\\/g40\\/g3\\/g45\\/g17\\/g3\\/g47\\/g88\\/g69\\/g85\\/g17\\/g3\\/g55\\/g72\\/g70\\/g75\\/g81\\/g82\\/g79\\/g17 103 (1981), 295-301 4. Leveille, A. R> \\u201cDYBA \\u2013 A New Dynamic Bearing Analysis Software Tool\\u201d International Symposium on  Rolling Element Bearings, Baja Hotel, San Diego, CA May 8, 2007 112{'source': 'AMS_2014.pdf', 'page': 128}\",\"Starvation Results\\u201d  \\/g36\\/g54\\/g48\\/g40\\/g3\\/g45\\/g17\\/g3\\/g47\\/g88\\/g69\\/g85\\/g17\\/g3\\/g55\\/g<br>72\\/g70\\/g75\\/g81\\/g82\\/g79\\/g17 99 (1977), 15-23 3. Coy, J.J., and Zaretsky \\u201cSome<br>Limitations in Applying Classical EHD Film Thickness Formulas to a HighSpeed<br>Bearing\\u201d \\/g36\\/g54\\/g48\\/g40\\/g3\\/g45\\/g17\\/g3\\/g47\\/g88\\/g69\\/g85\\/g17\\/g3\\/g55\\/g72\\/g70\\/g75\\/g<br>81\\/g82\\/g79\\/g17 103 (1981), 295-301 4. Leveille, A. R> \\u201cDYBA \\u2013 A New Dynamic<br>Bearing Analysis Software Tool\\u201d International Symposium on  Rolling Element<br>Bearings, Baja Hotel, San Diego, CA May 8, 2007 112{'source': 'AMS_2014.pdf',<br>'page': 128}\",3,\"Chunks\"],[\"95f1ce04-c3ba-11ee-90dd-bae7cd9d315e\",9.6085147858,1.2950359583,\"\\/g76\\/g81\\/g3\\/g68\\/g81\\/g3\\/g36\\/g81\\/g87\\/g68\\/g85\\/g70\\/g87\\/g76\\/g70\\/g3\\/g48\\/g68\\/g85\\/g86\\/g3\\/g36\\/g81\\/g68\\/g79\\/g82\\/g74\\/g3\\/g54\\/g76\\/g87\\/g72\\/g17 AIAA SPACE 2011 Conference & Exposition, Long Beach,  September 26-29, 2011 10. Zacny K., Paulsen G., McKayC. P., Glass B., Dav\\u00e9 A., Davila A.F., Marinova M., Mellerowicz B.,  Heldmann J., Stoker C., Cabrol N., Hedlund M., and Craft J. \\/g53\\/g72\\/g68\\/g70\\/g75\\/g76\\/g81\\/g74\\/g3\\/g20\\/g3\\/g80\\/g3\\/g39\\/g72\\/g72\\/g83\\/g3\\/g82\\/g81\\/g3\\/g48\\/g68\\/g85\\/g86\\/g29\\/g3\\/g55\\/g75\\/g72\\/g3 \\/g44\\/g70\\/g72\\/g69\\/g85\\/g72\\/g68\\/g78\\/g72\\/g85\\/g3\\/g39\\/g85\\/g76\\/g79\\/g79\\/g17\\/g3 Astrobiology. December 2013, 13(12): 1166-1198. doi:10.1089\\/ast.2013.1038. 11. Zacny, K., J. Wilson, P. Chu, and J. Craft, Prototype Rotary Percussive Drill for the Mars Sample{'source': 'AMS_2014.pdf', 'page': 246}\",\"\\/g76\\/g81\\/g3\\/g68\\/g81\\/g3\\/g36\\/g81\\/g87\\/g68\\/g85\\/g70\\/g87\\/g76\\/g70\\/g3\\/g48\\/g68\\/g85\\/g86\\/g3<br>\\/g36\\/g81\\/g68\\/g79\\/g82\\/g74\\/g3\\/g54\\/g76\\/g87\\/g72\\/g17 AIAA SPACE 2011 Conference &<br>Exposition, Long Beach,  September 26-29, 2011 10. Zacny K., Paulsen G., McKayC.<br>P., Glass B., Dav\\u00e9 A., Davila A.F., Marinova M., Mellerowicz B.,  Heldmann J.,<br>Stoker C., Cabrol N., Hedlund M., and Craft J. \\/g53\\/g72\\/g68\\/g70\\/g75\\/g76\\/g81\\/g74\\/<br>g3\\/g20\\/g3\\/g80\\/g3\\/g39\\/g72\\/g72\\/g83\\/g3\\/g82\\/g81\\/g3\\/g48\\/g68\\/g85\\/g86\\/g29\\/g3\\/g55\\/g75\\/g7<br>2\\/g3 \\/g44\\/g70\\/g72\\/g69\\/g85\\/g72\\/g68\\/g78\\/g72\\/g85\\/g3\\/g39\\/g85\\/g76\\/g79\\/g79\\/g17\\/g3<br>Astrobiology. December 2013, 13(12): 1166-1198. doi:10.1089\\/ast.2013.1038. 11.<br>Zacny, K., J. Wilson, P. Chu, and J. Craft, Prototype Rotary Percussive Drill<br>for the Mars Sample{'source': 'AMS_2014.pdf', 'page': 246}\",3,\"Chunks\"],[\"95f1d1d8-c3ba-11ee-90dd-bae7cd9d315e\",9.2400941849,9.7928829193,\"\\/g55\\/g72\\/g86\\/g87\\/g86\\/g3\\/g70\\/g82\\/g81\\/g70\\/g79\\/g88\\/g86\\/g76\\/g82\\/g81\\/g86\\/g3 \\/g131The Separation Test was performed on the SSEP QM + LARES DM and was successfully completed. \\/g131The SSEP was in flight configuration and all the primary success criteria have been satisfied.  \\/g131Visual inspection did not identify any damage or physical degradation on the item under test (no  damage occurred after vibration test). \\/g131All the additional controls, measurement and investigations did not show evidence of any degradation  or loss of performance of any of the mechanical components. During the Launch Phase, the on-board camera mounted on the Support Subsystem has shown the  nominal performance of the SSEP subsystem.  Figure 22. Picture of LARES Satellite release on orbit  Lessons Learned The \\u2018lessons learned\\u2019 from the positive results obtained in the activities performed on LARES Program  SSEP is the confirmation of the importance of: \\/g131developing a design oriented to the integration feasibility; \\/g131using an \\u201cover-sensorized\\u201d model (in this case SSEP QM) to verify the sensitivity of the integration  and alignment mismatches vs performance requirement in order to minimize the influence of operator errors;  \\/g131adopting a suitable optimized model philosophy that can allow deep investigations of the critical  areas; \\/g131focusing strong effort in the testing activity at breadboard level to correlate in advance the  mathematical models in order to minimize the technical risk (the BB model testing phase has been  included in the timeframe of CDR).{'source': 'AMS_2014.pdf', 'page': 288}\",\"\\/g55\\/g72\\/g86\\/g87\\/g86\\/g3\\/g70\\/g82\\/g81\\/g70\\/g79\\/g88\\/g86\\/g76\\/g82\\/g81\\/g86\\/g3 \\/g131The<br>Separation Test was performed on the SSEP QM + LARES DM and was successfully<br>completed. \\/g131The SSEP was in flight configuration and all the primary success<br>criteria have been satisfied.  \\/g131Visual inspection did not identify any<br>damage or physical degradation on the item under test (no  damage occurred after<br>vibration test). \\/g131All the additional controls, measurement and<br>investigations did not show evidence of any degradation  or loss of performance<br>of any of the mechanical components. During the Launch Phase, the on-board<br>camera mounted on the Support Subsystem has shown the  nominal performance of<br>the SSEP subsystem.  Figure 22. Picture of LARES Satellite release on orbit<br>Lessons Learned The \\u2018lessons learned\\u2019 from the positive results obtained in the<br>activities performed on LARES Program  SSEP is the confirmation of the<br>importance of: \\/g131developing a design oriented to the integration feasibility;<br>\\/g131using an \\u201cover-sensorized\\u201d model (in this case SSEP QM) to verify the<br>sensitivity of the integration  and alignment mismatches vs performance<br>requirement in order to minimize the influence of operator errors;<br>\\/g131adopting a suitable optimized model philosophy that can allow deep<br>investigations of the critical  areas; \\/g131focusing strong effort in the<br>testing activity at breadboard level to correlate in advance the  mathematical<br>models in order to minimize the technical risk (the BB model testing phase has<br>been  included in the timeframe of CDR).{'source': 'AMS_2014.pdf', 'page': 288}\",3,\"Chunks\"],[\"973dc862-c3ba-11ee-90dd-bae7cd9d315e\",3.2148768902,-0.4196214676,\"heritage and have gone through several life tests. Each of the life tests have proven that the rotary  actuator internal losses do not increase with time in vacuum or mechanical use. The most recent life test  on a Moog Type3 actuator accumulated 5.3 million output degrees of motion without any sign of degradation. The consistency of measured threshold voltage\\/current throughout the life program at hot, cold and  ambient conditions, especially the consistency of the initial functional and final functional is indicative of the fact that the internal losses did not increase after exposure to thermal vacuum and mechanical environments of the life test.  Rotary actuators of this design are also very simple, only one reduction stage (160:1) with the minimum  number of bearings and gear meshes.  351{'source': 'AMS_2014.pdf', 'page': 367}\",\"heritage and have gone through several life tests. Each of the life tests have<br>proven that the rotary  actuator internal losses do not increase with time in<br>vacuum or mechanical use. The most recent life test  on a Moog Type3 actuator<br>accumulated 5.3 million output degrees of motion without any sign of<br>degradation. The consistency of measured threshold voltage\\/current throughout<br>the life program at hot, cold and  ambient conditions, especially the<br>consistency of the initial functional and final functional is indicative of the<br>fact that the internal losses did not increase after exposure to thermal vacuum<br>and mechanical environments of the life test.  Rotary actuators of this design<br>are also very simple, only one reduction stage (160:1) with the minimum  number<br>of bearings and gear meshes.  351{'source': 'AMS_2014.pdf', 'page': 367}\",3,\"Chunks\"],[\"9bb0177e-c3ba-11ee-90dd-bae7cd9d315e\",2.1147503853,3.1351613998,\"destination 100stepsaway). Oncethemechanism reaches thehardstop,theremaining stepsinthe command continue topulsethestepper againstthestop.Oncethestepcommand ends,thestepper holds itsposition astheunitisstillpowered, andthesoftware thencutsthepower,allowing themechanism to relax.Ifasignificant enough forcehadbeenbuiltupduringthelastpulseintothehardstop,thisrelaxation wouldforcethemechanism intheopposite direction, awayfromthehardstop. This\\\"relaxation\\\" ofthe mechanism wasneverdiscussed priortothiseventasitwasbelieved thatsincethemechanism hadgone 69{'source': 'AMS_2000.pdf', 'page': 83}\",\"destination 100stepsaway). Oncethemechanism reaches thehardstop,theremaining<br>stepsinthe command continue topulsethestepper againstthestop.Oncethestepcommand<br>ends,thestepper holds itsposition astheunitisstillpowered, andthesoftware<br>thencutsthepower,allowing themechanism to relax.Ifasignificant enough<br>forcehadbeenbuiltupduringthelastpulseintothehardstop,thisrelaxation<br>wouldforcethemechanism intheopposite direction, awayfromthehardstop.<br>This\\\"relaxation\\\" ofthe mechanism wasneverdiscussed<br>priortothiseventasitwasbelieved thatsincethemechanism hadgone 69{'source':<br>'AMS_2000.pdf', 'page': 83}\",3,\"Chunks\"],[\"9dc9859a-c3ba-11ee-90dd-bae7cd9d315e\",5.4671697617,3.8639655113,\"toward50%.Forsaturated units,therelativemassanddimensions ofthenon-redundant designmustbe increased. 184{'source': 'AMS_2000.pdf', 'page': 198}\",\"toward50%.Forsaturated units,therelativemassanddimensions ofthenon-redundant<br>designmustbe increased. 184{'source': 'AMS_2000.pdf', 'page': 198}\",3,\"Chunks\"],[\"9fe6eb6a-c3ba-11ee-90dd-bae7cd9d315e\",0.0545825399,-0.9456322789,\"ThreeFingered HandSurfaceAnomaly CloseUpOfSurface SurfaceBeforeRunning InTester_4 SurfaceAfter10,894Seconds Figure6.BallNumber 7FromTestRig 338{'source': 'AMS_2000.pdf', 'page': 352}\",\"ThreeFingered HandSurfaceAnomaly CloseUpOfSurface SurfaceBeforeRunning<br>InTester_4 SurfaceAfter10,894Seconds Figure6.BallNumber 7FromTestRig<br>338{'source': 'AMS_2000.pdf', 'page': 352}\",3,\"Chunks\"],[\"a8b0b960-c3ba-11ee-90dd-bae7cd9d315e\",0.2621081173,8.1480693817,\"isuniquefromothertypesofsatellite burnwirereleases. Thismechanism usesthewiretodirectly carry thetensileload;therefore itisahighlysimplified designthatcanbegreatlyminiaturized. Itisalsoaneasy designtoscaleupordownaccording totherequirements ofthedeviceitisattached to. AluminumHousng i\\/.,_- __ Wtthmounting ears---.-._._ _I\\/ i Aluminum Retainer_------_ ! Kick-off ' _Sprmg_ }_:\\\" BeCuBurnWir_._.._ i_:\\\"l G-lOWireAttach Jiil \\\"Button\\\"-_ f_HousingRetainer Assembly BumWire Figure7.MiniBurnWireRelease Assembly Desi,qnApproach Itwasdetermined earlyinthedesign process thattohighlyminiaturize thismechanism, ithadtocontain thefewestpartspossible. Theburnwirerelease mechanism (shown inFigure7)hasonly5components withonlyoneofthosethatarereleased withthecover.Thesecomponents arealsomultifunctional. The burnwireisusedtoholdthemechanism together, carrytherestraint load,makeelectrical connection, andinitiatetherelease action. Wiresizewasbasedonrestraining a100-gram cover.Therestofthe mechanism wasdesigned topackage ascompactly aspossible andprovide threadforasmallscrew.A kick-off compression springwasincorporated toovercome frictionorothersmallforcesthatmighthangupthemechanism. Beryllium copper waschosen forthewirematerial basedonitsexcellent mechanical{'source': 'AMS_2001.pdf', 'page': 303}\",\"isuniquefromothertypesofsatellite burnwirereleases. Thismechanism<br>usesthewiretodirectly carry thetensileload;therefore itisahighlysimplified<br>designthatcanbegreatlyminiaturized. Itisalsoaneasy<br>designtoscaleupordownaccording totherequirements ofthedeviceitisattached to.<br>AluminumHousng i\\/.,_- __ Wtthmounting ears---.-._._ _I\\/ i Aluminum Retainer_<br>------_ ! Kick-off ' _Sprmg_ }_:\\\" BeCuBurnWir_._.._ i_:\\\"l G-lOWireAttach Jiil<br>\\\"Button\\\"-_ f_HousingRetainer Assembly BumWire Figure7.MiniBurnWireRelease<br>Assembly Desi,qnApproach Itwasdetermined earlyinthedesign process<br>thattohighlyminiaturize thismechanism, ithadtocontain thefewestpartspossible.<br>Theburnwirerelease mechanism (shown inFigure7)hasonly5components<br>withonlyoneofthosethatarereleased withthecover.Thesecomponents<br>arealsomultifunctional. The burnwireisusedtoholdthemechanism together,<br>carrytherestraint load,makeelectrical connection, andinitiatetherelease action.<br>Wiresizewasbasedonrestraining a100-gram cover.Therestofthe mechanism wasdesigned<br>topackage ascompactly aspossible andprovide threadforasmallscrew.A kick-off<br>compression springwasincorporated toovercome<br>frictionorothersmallforcesthatmighthangupthemechanism. Beryllium copper<br>waschosen forthewirematerial basedonitsexcellent mechanical{'source':<br>'AMS_2001.pdf', 'page': 303}\",3,\"Chunks\"],[\"a9633d2e-c3ba-11ee-90dd-bae7cd9d315e\",6.7475500107,-3.0442290306,\"73  \\n\\nFigure 6.  Feedback loop for controlling the mirror angle  \\ud835\\udc9a\\ud835\\udc9a(\\ud835\\udc95\\ud835\\udc95) via the actuator phase \\ud835\\udf36\\ud835\\udf36(\\ud835\\udc95\\ud835\\udc95). \\n\\nThe controller parameters have been tuned specifically on the measured FRFs in Figure 5(a), i.e., based  on the high- resolution  interferometer measurements. The parameters  have been chosen such that all  local FRFs yield a robustly  stable closed loop with a high as possible bandwidth.  In this case the  robustness has been defined by both a maximum  phase margin of 55\\u00b0  and a modulus margin (maximum   value of the closed- loop sensitivity function) of at  most 3 .5 dB. The resulting open loops \\ud835\\udc3b\\ud835\\udc3b\\ud835\\udc58\\ud835\\udc58(\\ud835\\udc57\\ud835\\udc57\\ud835\\udc57\\ud835\\udc57)\\ud835\\udc36\\ud835\\udc36(\\ud835\\udc57\\ud835\\udc57\\ud835\\udc57\\ud835\\udc57) are  depicted in Figure 7, both as a Bode and a Nyquist diagram. The latter shows that the closed loop is  indeed stable for all local FRFs, since all curves are on the right side of the point ( -1,0) [9]. Moreover, all  loops indeed satisfy the set modulus margin (black circle) and phase margin (black arc). Figure 7(a)  shows that t he achieved bandwidth lies between 26 and 62 Hz.     \\n\\nFigure 7.  Frequency domain representations of the open  loop \\ud835\\udc6f\\ud835\\udc6f\\ud835\\udc8c\\ud835\\udc8c(\\ud835\\udc8b\\ud835\\udc8b\\ud835\\udc8b\\ud835\\udc8b)\\ud835\\udc6a\\ud835\\udc6a(\\ud835\\udc8b\\ud835\\udc8b\\ud835\\udc8b\\ud835\\udc8b).{'source': 'AMS_2016.pdf', 'page': 87}\",\"73    Figure 6.  Feedback loop for controlling the mirror angle  \\ud835\\udc9a\\ud835\\udc9a(\\ud835\\udc95\\ud835\\udc95) via the<br>actuator phase \\ud835\\udf36\\ud835\\udf36(\\ud835\\udc95\\ud835\\udc95).   The controller parameters have been tuned specifically<br>on the measured FRFs in Figure 5(a), i.e., based  on the high- resolution<br>interferometer measurements. The parameters  have been chosen such that all<br>local FRFs yield a robustly  stable closed loop with a high as possible<br>bandwidth.  In this case the  robustness has been defined by both a maximum<br>phase margin of 55\\u00b0  and a modulus margin (maximum   value of the closed- loop<br>sensitivity function) of at  most 3 .5 dB. The resulting open loops<br>\\ud835\\udc3b\\ud835\\udc3b\\ud835\\udc58\\ud835\\udc58(\\ud835\\udc57\\ud835\\udc57\\ud835\\udc57\\ud835\\udc57)\\ud835\\udc36\\ud835\\udc36(\\ud835\\udc57\\ud835\\udc57\\ud835\\udc57\\ud835\\udc57) are  depicted in Figure 7, both as a Bode and a Nyquist<br>diagram. The latter shows that the closed loop is  indeed stable for all local<br>FRFs, since all curves are on the right side of the point ( -1,0) [9]. Moreover,<br>all  loops indeed satisfy the set modulus margin (black circle) and phase margin<br>(black arc). Figure 7(a)  shows that t he achieved bandwidth lies between 26 and<br>62 Hz.       Figure 7.  Frequency domain representations of the open  loop<br>\\ud835\\udc6f\\ud835\\udc6f\\ud835\\udc8c\\ud835\\udc8c(\\ud835\\udc8b\\ud835\\udc8b\\ud835\\udc8b\\ud835\\udc8b)\\ud835\\udc6a\\ud835\\udc6a(\\ud835\\udc8b\\ud835\\udc8b\\ud835\\udc8b\\ud835\\udc8b).{'source': 'AMS_2016.pdf', 'page': 87}\",3,\"Chunks\"],[\"a9fc4c8a-c3ba-11ee-90dd-bae7cd9d315e\",0.2571724951,-2.2370827198,\"[3]  S. H. Loewenthal, \\\"Two Gimbal Bearing Case Stdies: Some Lessons Learn ed,\\\" in 22nd Aerospace  Mechanisms Symposium , Hampton, 1988.   [4]  J. V. Poplawski, S. H. Loewenthal, F. B. Oswald, E. V. Zaretski, W. Morales and K. W. Street,  \\\"NASA\\/TP -20142217906 Analysis of Space Station Centrifuge Rotor Bearing Systems: A Case  Study,\\\"  NASA, Cleveland, 2014.{'source': 'AMS_2016.pdf', 'page': 134}\",\"[3]  S. H. Loewenthal, \\\"Two Gimbal Bearing Case Stdies: Some Lessons Learn ed,\\\"<br>in 22nd Aerospace  Mechanisms Symposium , Hampton, 1988.   [4]  J. V. Poplawski,<br>S. H. Loewenthal, F. B. Oswald, E. V. Zaretski, W. Morales and K. W. Street,<br>\\\"NASA\\/TP -20142217906 Analysis of Space Station Centrifuge Rotor Bearing<br>Systems: A Case  Study,\\\"  NASA, Cleveland, 2014.{'source': 'AMS_2016.pdf',<br>'page': 134}\",3,\"Chunks\"],[\"abe2dd8e-c3ba-11ee-90dd-bae7cd9d315e\",5.3853397369,0.6648820639,\"Overall Instrument Pointing  87.2 120  ISS Low Frequency  \\u00b140 \\u00b153  star tracker calibration &  structural\\/optical analysis  \\u00b19 11.5  DAPS System  46.3 66 \\n\\nEarly analysis showed that the actuators induced pointing error is much greater than the requirement . As  expected, the largest error occurs when the actuator step rate coincides with structural resonant frequencies.    The NICER\\/SEXTANT payload has resonant structural frequencies <10 Hz which are excited by the pointing actuator s. Since the operational actuator step rates will always pass through this frequency  range, there are no feasible workarounds to avoid exciting these low frequency structural modes.    In order to reduce the excited pointing errors and meet the requirement, several mitigation methods have been implemented, including microstepping, actuator detent torque reduction, and the use of dampers.  \\n\\nMicrostepping   Implementation of microstepping in the actuator drive electronics was the first measure taken to reduce the stepper motor induced pointing error . Microstepping breaks a single cardinal step into smaller ones  and softens the impacts on the output load, instead of moving through a single motor step quickly and generating a larger impulsive torque on the system . While microstepping did reduce the stepper induced  pointing error, it was not sufficient to meet the pointing requirements . The issue resides in the motor  detent torque. The motor powered torque must overcome the detent torque before it can move the motor  from one step to the next step, even when microstepping. Overcoming the detent torque essentially  generates torque impulses that exceed the detent torque. While these torque impulses are smaller than  the cardinal step torque levels, they generate disturbances on the instrument and limit the benefits gained by microstepping.{'source': 'AMS_2016.pdf', 'page': 278}\",\"Overall Instrument Pointing  87.2 120  ISS Low Frequency  \\u00b140 \\u00b153  star tracker<br>calibration &  structural\\/optical analysis  \\u00b19 11.5  DAPS System  46.3 66<br>Early analysis showed that the actuators induced pointing error is much greater<br>than the requirement . As  expected, the largest error occurs when the actuator<br>step rate coincides with structural resonant frequencies.    The NICER\\/SEXTANT<br>payload has resonant structural frequencies <10 Hz which are excited by the<br>pointing actuator s. Since the operational actuator step rates will always pass<br>through this frequency  range, there are no feasible workarounds to avoid<br>exciting these low frequency structural modes.    In order to reduce the excited<br>pointing errors and meet the requirement, several mitigation methods have been<br>implemented, including microstepping, actuator detent torque reduction, and the<br>use of dampers.    Microstepping   Implementation of microstepping in the<br>actuator drive electronics was the first measure taken to reduce the stepper<br>motor induced pointing error . Microstepping breaks a single cardinal step into<br>smaller ones  and softens the impacts on the output load, instead of moving<br>through a single motor step quickly and generating a larger impulsive torque on<br>the system . While microstepping did reduce the stepper induced  pointing error,<br>it was not sufficient to meet the pointing requirements . The issue resides in<br>the motor  detent torque. The motor powered torque must overcome the detent<br>torque before it can move the motor  from one step to the next step, even when<br>microstepping. Overcoming the detent torque essentially  generates torque<br>impulses that exceed the detent torque. While these torque impulses are smaller<br>than  the cardinal step torque levels, they generate disturbances on the<br>instrument and limit the benefits gained by microstepping.{'source':<br>'AMS_2016.pdf', 'page': 278}\",3,\"Chunks\"],[\"af544caa-c3ba-11ee-90dd-bae7cd9d315e\",2.6214895248,2.5164420605,\"463   Figure 18.  Random vibration spectrum in the axial direction  \\n\\nFigure 19.  Random vibration spectrum in the radial  direction  \\n\\nThe SMA actuator successfully sustained both axial and transvers e random vibrational  loads  with overall  acceleration of 28.3 g RMS and duration of 3 minutes each. No changes  in the resonance search results  were observed before and after the random loads application showing that no structural failures have{'source': 'AMS_2016.pdf', 'page': 477}\",\"463   Figure 18.  Random vibration spectrum in the axial direction    Figure 19.<br>Random vibration spectrum in the radial  direction    The SMA actuator<br>successfully sustained both axial and transvers e random vibrational  loads<br>with overall  acceleration of 28.3 g RMS and duration of 3 minutes each. No<br>changes  in the resonance search results  were observed before and after the<br>random loads application showing that no structural failures have{'source':<br>'AMS_2016.pdf', 'page': 477}\",3,\"Chunks\"],[\"b2953898-c3ba-11ee-90dd-bae7cd9d315e\",3.37398386,5.7272148132,\"program.Thestructuraltubesoftheantenna(thin-wallS-Glass\\/Kevlar composite,38-mmdiameterforthe dipolesand20-mmforthemonopole) areunabletosustaintheirownweightinEarth'sgravity.{'source': 'AMS_2002.pdf', 'page': 200}\",\"program.Thestructuraltubesoftheantenna(thin-wallS-Glass\\/Kevlar<br>composite,38-mmdiameterforthe dipolesand20-mmforthemonopole)<br>areunabletosustaintheirownweightinEarth'sgravity.{'source': 'AMS_2002.pdf',<br>'page': 200}\",3,\"Chunks\"],[\"b3764680-c3ba-11ee-90dd-bae7cd9d315e\",6.1762704849,6.5843067169,\"Automating Separation System Reliability Testing , RyanL.Perroy Abstract Thispaperpresents thedevelopment, execution, andresulting testdataofanautomated separation reliability testprocedure fortheLightband separation system. Theautomated procedure wasdeveloped to exploitthe\\\"easy-to-test\\\" designoftheLightband andresulted inaturnaround timeoftenminutes between successive separation tests.Theautomated testprocedure wasusedsuccessfully forseveral different Lightband separation systems, including a45.72-cm (18-in)hexagonal Lightband builtfortheNanosat program anda66.04-cm (26-in) Lightband builtandrecently launched fortheStarshine-3 satellite program. Aconcise description oftheLightband andthetestset-upispresented, including discussion of air-bearing assemblies, angular ratesensors, linearposition transducer, satellite mock-up andmass properties, instrument calibration, LabVIEW program andcode,dataflow, electrical circuithardware, and electrical signalnoiseandconditioning issues. Separation reliability testresultsarepresented, alongwith adiscussion oflessons learned. Introduction Traditional methods ofdetermining thereliability ofseparation systems generally consist ofsuspending theengaged system abovethefloor,triggering aseparation event,andallowing thedeployed separable section tofallduetotheforceofgravity. Instruments tocharacterize tip-offratesarerarelyused,and measuring accurate rotational andtranslational separation ratesmaybeimpossible asgravitational torques candominate system dynamics. Traditional separation testsaregenerally time-consuming. Itmay{'source': 'AMS_2002.pdf', 'page': 295}\",\"Automating Separation System Reliability Testing , RyanL.Perroy Abstract<br>Thispaperpresents thedevelopment, execution, andresulting testdataofanautomated<br>separation reliability testprocedure fortheLightband separation system.<br>Theautomated procedure wasdeveloped to exploitthe\\\"easy-to-test\\\"<br>designoftheLightband andresulted inaturnaround timeoftenminutes between<br>successive separation tests.Theautomated testprocedure wasusedsuccessfully<br>forseveral different Lightband separation systems, including a45.72-cm<br>(18-in)hexagonal Lightband builtfortheNanosat program anda66.04-cm (26-in)<br>Lightband builtandrecently launched fortheStarshine-3 satellite program.<br>Aconcise description oftheLightband andthetestset-upispresented, including<br>discussion of air-bearing assemblies, angular ratesensors, linearposition<br>transducer, satellite mock-up andmass properties, instrument calibration,<br>LabVIEW program andcode,dataflow, electrical circuithardware, and electrical<br>signalnoiseandconditioning issues. Separation reliability<br>testresultsarepresented, alongwith adiscussion oflessons learned. Introduction<br>Traditional methods ofdetermining thereliability ofseparation systems generally<br>consist ofsuspending theengaged system abovethefloor,triggering aseparation<br>event,andallowing thedeployed separable section tofallduetotheforceofgravity.<br>Instruments tocharacterize tip-offratesarerarelyused,and measuring accurate<br>rotational andtranslational separation ratesmaybeimpossible asgravitational<br>torques candominate system dynamics. Traditional separation testsaregenerally<br>time-consuming. Itmay{'source': 'AMS_2002.pdf', 'page': 295}\",3,\"Chunks\"],[\"b7df5432-c3ba-11ee-90dd-bae7cd9d315e\",0.2672332525,-1.8760004044,\"References \\u2022 o 3. . \\u2022 6. \\u00b0 8. 9. 10. 11. 12.ARPACeramic Technology Insertion Program, ACTIP Annual Review, Aug2526,1997,Annapolis, MD.Program Manager: Dr.BillCoblenz, Tel:703-6962288. R.W.Bursey, \\\"Space Shuttle MainEngine Turbopump Applications\\\", ACTIP Annual Review, Aug28-29, 1995,Annapolis, MD. H.A.Chin,R.W.Bursey, D.D.Ehlert,R.Biroscak, E.Streit,andW.Trojahn, \\\"Cronidur 30-AnAdvanced Nitrogen Alloyed Stainless SteelforAdvanced Corrosion Resistant Fracture Tough Cryogenic Bearings\\\", 1994Earth-to-Orbit Conference, Univ.ofHuntsville andNASAMSFC, pp321-330. P.K.Pearson, J.H.Moll,C.J.Hannigan, D.R.Atwell, \\\"Evaluation ofP\\/MTool SteelsforBearing Aplications\\\", 1994Int.Conf.&Exposition onPowder Metallurgy &Particulate Materials, 8-11May,1994,Toronto, CAMPIF, Princeton, NJ. Crucible DataSheet, Issue#3onCPMREX20, Crucible Specialty Metals, Syracuse, NY. (A)Y.P.ChiuTheTorrington Company, \\\"Rotating BeamFatigue Testing and Hybrid Ceramic Bearings\\\", AirForceWright Laboratory Technical Report, WL-{'source': 'AMS_1998.pdf', 'page': 263}\",\"References \\u2022 o 3. . \\u2022 6. \\u00b0 8. 9. 10. 11. 12.ARPACeramic Technology Insertion<br>Program, ACTIP Annual Review, Aug2526,1997,Annapolis, MD.Program Manager:<br>Dr.BillCoblenz, Tel:703-6962288. R.W.Bursey, \\\"Space Shuttle MainEngine Turbopump<br>Applications\\\", ACTIP Annual Review, Aug28-29, 1995,Annapolis, MD.<br>H.A.Chin,R.W.Bursey, D.D.Ehlert,R.Biroscak, E.Streit,andW.Trojahn, \\\"Cronidur<br>30-AnAdvanced Nitrogen Alloyed Stainless SteelforAdvanced Corrosion Resistant<br>Fracture Tough Cryogenic Bearings\\\", 1994Earth-to-Orbit Conference,<br>Univ.ofHuntsville andNASAMSFC, pp321-330. P.K.Pearson, J.H.Moll,C.J.Hannigan,<br>D.R.Atwell, \\\"Evaluation ofP\\/MTool SteelsforBearing Aplications\\\",<br>1994Int.Conf.&Exposition onPowder Metallurgy &Particulate Materials,<br>8-11May,1994,Toronto, CAMPIF, Princeton, NJ. Crucible DataSheet,<br>Issue#3onCPMREX20, Crucible Specialty Metals, Syracuse, NY.<br>(A)Y.P.ChiuTheTorrington Company, \\\"Rotating BeamFatigue Testing and Hybrid<br>Ceramic Bearings\\\", AirForceWright Laboratory Technical Report, WL-{'source':<br>'AMS_1998.pdf', 'page': 263}\",3,\"Chunks\"],[\"ba71af9c-c3ba-11ee-90dd-bae7cd9d315e\",8.0077571869,2.4294297695,\"climbing thevertical wallofonewheeldiameter inheight. Twovaluesareshown, an_n 120{'source': 'AMS_1999.pdf', 'page': 134}\",\"climbing thevertical wallofonewheeldiameter inheight. Twovaluesareshown, an_n<br>120{'source': 'AMS_1999.pdf', 'page': 134}\",3,\"Chunks\"],[\"bd93171a-c3ba-11ee-90dd-bae7cd9d315e\",7.4452981949,4.1997056007,\"Figureg.Pyrotechnic ReleaseBracket,sideview REeF REF [F Figure10.Pyrotechnic Release Bracket, cross-section ofconical lug\\/pin Interface 401{'source': 'AMS_1999.pdf', 'page': 415}\",\"Figureg.Pyrotechnic ReleaseBracket,sideview REeF REF [F Figure10.Pyrotechnic<br>Release Bracket, cross-section ofconical lug\\/pin Interface 401{'source':<br>'AMS_1999.pdf', 'page': 415}\",3,\"Chunks\"],[\"be31ed54-c3ba-11ee-90dd-bae7cd9d315e\",6.5479197502,3.7725231647,\"Thetelescoping masthasarangeof0-2.31meters(91inches), whichis0.3meter(12 inches) higherthanCarts1and2,enabling thestingtobepositioned 0.3meterabove thetunnelcenterline. Thetelescoping mastdesignconsists ofthemast,which supports thesting,themastsupport, whichslidesinsidethemastandaddsan additional reaction pointforthemastwhenraised,andthescopehousing insideof whichthemastandmastsupport slide.Themastandthemastsupport haveflanges attheirdrivenendandarekeyedtothescopehousing toprevent rotation. Thesystem usesfourballscrews todrivethescope;twoballscrewsdrivethemast,andtwoball screwsdrivethemastsupport. Themastscrewsdrivetwicethespeedofthemast support screws suchthatthemastsupport ishalfwayupwhenthemastisfully extended. Eachofthefourballscrewsisconnected toa22.9-cm (9-inch) gearatthe bottom. Aninternal ringgeardrivesthefour22.9-cm gears.Theinternal ringgearis connected toanexternal ringgearthatisdrivenbya26.7-kW DCservomotor and gearbox. Theservomotor iscloselycontrolled byanon-board computer usingclosedloopposition feedback algorithms (asarethepitchandyawdrives). Internal sliding components arecoatedwithMagnaplate HTRandgreasetoreducefriction. Thetop ofthescopehaspreloaded slipperpadswherethemastexitsthescope. Aband{'source': 'AMS_1999.pdf', 'page': 438}\",\"Thetelescoping masthasarangeof0-2.31meters(91inches), whichis0.3meter(12 inches)<br>higherthanCarts1and2,enabling thestingtobepositioned 0.3meterabove<br>thetunnelcenterline. Thetelescoping mastdesignconsists ofthemast,which supports<br>thesting,themastsupport, whichslidesinsidethemastandaddsan additional reaction<br>pointforthemastwhenraised,andthescopehousing insideof whichthemastandmastsupport<br>slide.Themastandthemastsupport haveflanges<br>attheirdrivenendandarekeyedtothescopehousing toprevent rotation. Thesystem<br>usesfourballscrews todrivethescope;twoballscrewsdrivethemast,andtwoball<br>screwsdrivethemastsupport. Themastscrewsdrivetwicethespeedofthemast support<br>screws suchthatthemastsupport ishalfwayupwhenthemastisfully extended.<br>Eachofthefourballscrewsisconnected toa22.9-cm (9-inch) gearatthe bottom.<br>Aninternal ringgeardrivesthefour22.9-cm gears.Theinternal ringgearis connected<br>toanexternal ringgearthatisdrivenbya26.7-kW DCservomotor and gearbox.<br>Theservomotor iscloselycontrolled byanon-board computer usingclosedloopposition<br>feedback algorithms (asarethepitchandyawdrives). Internal sliding components<br>arecoatedwithMagnaplate HTRandgreasetoreducefriction. Thetop<br>ofthescopehaspreloaded slipperpadswherethemastexitsthescope. Aband{'source':<br>'AMS_1999.pdf', 'page': 438}\",3,\"Chunks\"],[\"c048e868-c3ba-11ee-90dd-bae7cd9d315e\",-1.0483905077,5.4968767166,\"Design), andPhilRobertson(Consulting) fortheirinvaluable experience and perseverance inthiseffort.Without theirinputsandexpertise, thisexperiment would nothavebeensuccessful indemonstrating theuniquebenefits andpossibilities Shape Memory AlloyTechnology canbringtofutureaerospace mechanism developments. 154{'source': 'AMS_1997.pdf', 'page': 170}\",\"Design), andPhilRobertson(Consulting) fortheirinvaluable experience and<br>perseverance inthiseffort.Without theirinputsandexpertise, thisexperiment would<br>nothavebeensuccessful indemonstrating theuniquebenefits andpossibilities Shape<br>Memory AlloyTechnology canbringtofutureaerospace mechanism developments.<br>154{'source': 'AMS_1997.pdf', 'page': 170}\",3,\"Chunks\"],[\"c0e5497e-c3ba-11ee-90dd-bae7cd9d315e\",1.6338828802,-1.5528789759,\"Loadsrangingfrom10N(on-orbitloads)upto100N(Hexapod assembly ground testing),anddifferentloadingconditions (tensionandcompression) wereconsidered duringtesting.Table3containsthemostimportant resultsoftheLAaccuracy testing campaign inambientconditions. Duringtesting,option\\\"B\\\"wasmodifiedaspartofthedevelopment process: \\u2022Theplasticbushings usedtosupportthespindleweresubstituted bybearings, sincethetoohighthermalexpansion coefficient ofDELRINmaterialproduces a thermaldeformation ofthebushings andblocksthespindlerotation. \\u2022DELRINcomponents weresubstituted byVESPELonesbecauseofthebetter thermalproperties andwearresistance ofthelatter. \\u2022Twoplasticbushings wereaddedtothenutendsinordertosupportdirectlythe actionoftheactuatorweightandprovideaguidingcapability ofthenutalongthe spindle(Figure2). Vespel nut50 d+_04 Vespel bushing Figure 2.VESPEL nutassembly Thetestsetupwasimproved byadding weights onboththefixedandmovable partsoftheactuator tocounterbalance theeffectoftheactuator weight. Finally, thespindle-nut assembly wasre-designed byincreasing thescrew diameter andchanging toatrapezoidal thread shapewith2.5-mm pitchinstead of1mm(toimprove theguiding capability bymaintaining thesamespecific pressure onthethread). Theactuator withtheVESPEL nutwasalsosubjected tolifetime testing, performing{'source': 'AMS_1997.pdf', 'page': 236}\",\"Loadsrangingfrom10N(on-orbitloads)upto100N(Hexapod assembly ground<br>testing),anddifferentloadingconditions (tensionandcompression) wereconsidered<br>duringtesting.Table3containsthemostimportant resultsoftheLAaccuracy testing<br>campaign inambientconditions.<br>Duringtesting,option\\\"B\\\"wasmodifiedaspartofthedevelopment process:<br>\\u2022Theplasticbushings usedtosupportthespindleweresubstituted bybearings,<br>sincethetoohighthermalexpansion coefficient ofDELRINmaterialproduces a<br>thermaldeformation ofthebushings andblocksthespindlerotation. \\u2022DELRINcomponents<br>weresubstituted byVESPELonesbecauseofthebetter thermalproperties<br>andwearresistance ofthelatter. \\u2022Twoplasticbushings<br>wereaddedtothenutendsinordertosupportdirectlythe<br>actionoftheactuatorweightandprovideaguidingcapability ofthenutalongthe<br>spindle(Figure2). Vespel nut50 d+_04 Vespel bushing Figure 2.VESPEL nutassembly<br>Thetestsetupwasimproved byadding weights onboththefixedandmovable<br>partsoftheactuator tocounterbalance theeffectoftheactuator weight. Finally,<br>thespindle-nut assembly wasre-designed byincreasing thescrew diameter<br>andchanging toatrapezoidal thread shapewith2.5-mm pitchinstead of1mm(toimprove<br>theguiding capability bymaintaining thesamespecific pressure onthethread).<br>Theactuator withtheVESPEL nutwasalsosubjected tolifetime testing,<br>performing{'source': 'AMS_1997.pdf', 'page': 236}\",3,\"Chunks\"],[\"ca0a57ce-c3ba-11ee-90dd-bae7cd9d315e\",6.3237299919,3.0014007092,\"22. E. W. Roberts, P. Bridgeman, M. Jansson, M. Schulke, and A. Tvaruzka, \\u201cThe Performance and Life of Fluid-Lubricated Harmonic Drive\\u00ae Gears,\\u201d Proccedings of the ESMATS , 2015. NASA\\/CP\\u20142018-219887 262{'source': 'AMS_2018.pdf', 'page': 280}\",\"22. E. W. Roberts, P. Bridgeman, M. Jansson, M. Schulke, and A. Tvaruzka, \\u201cThe<br>Performance and Life of Fluid-Lubricated Harmonic Drive\\u00ae Gears,\\u201d Proccedings of<br>the ESMATS , 2015. NASA\\/CP\\u20142018-219887 262{'source': 'AMS_2018.pdf', 'page':<br>280}\",3,\"Chunks\"],[\"caa72518-c3ba-11ee-90dd-bae7cd9d315e\",1.6337457895,0.2479276508,\"10-mm Motor\\/Gearbox Life-Test-to-Failure Determination of Failure Source 10-mm Motor\\/Gearbox Application Hardware Description The 10-mm motor and gearbox assembly is comprised of a three-phase brushless dc motor attached to a  16:1 reduction ratio planetary gearbox. The motor has ball bearings on the rotor and the gearbox planet  gears use plane bearings. The gearbox is lubricated with Bray grease, type 601. There are two preloaded  ball bearings on the output of the gearbox to provide a moment carrying capacity for offset loads on the  output shaft. The face width of the planet gears is approximately one millimeter and the ring gear is made  from bronze.  The 10-mm actuator drives the filter wheel of the Mast cameras on the Curiosity rover operating on the  surface of Mars. The actuator has a pinion gear attached to the output shaft and is mounted into a housing  that contains the larger filter wheel for the camera. The pinion gear on the actuator output drives the filter  wheel directly with a gear mesh on the outside diameter of the filter wheel disc. The motor is operated as a  stepper motor in this application, so no rotor position sensors are mounted within the motor housing. There  is a magnetic detent wheel attached to the back of the rotor to provide the necessary magnetic detent for  proper stepper motor function. The filter wheel assembly is shown in Figure 17. Magnets on the filter wheel  itself are sensed with hall sensors in the housing to confirm filter position during operation of the mechanism.  Figure 17. Filter Wheel Assembly Application of the 10-mm Actuator  Life Test Setup  Two Filter Wheel Assemblies were used on the Curiosity Rover mission. Two Filter Wheel Assemblies are{'source': 'AMS_2018.pdf', 'page': 332}\",\"10-mm Motor\\/Gearbox Life-Test-to-Failure Determination of Failure Source 10-mm<br>Motor\\/Gearbox Application Hardware Description The 10-mm motor and gearbox<br>assembly is comprised of a three-phase brushless dc motor attached to a  16:1<br>reduction ratio planetary gearbox. The motor has ball bearings on the rotor and<br>the gearbox planet  gears use plane bearings. The gearbox is lubricated with<br>Bray grease, type 601. There are two preloaded  ball bearings on the output of<br>the gearbox to provide a moment carrying capacity for offset loads on the<br>output shaft. The face width of the planet gears is approximately one millimeter<br>and the ring gear is made  from bronze.  The 10-mm actuator drives the filter<br>wheel of the Mast cameras on the Curiosity rover operating on the  surface of<br>Mars. The actuator has a pinion gear attached to the output shaft and is mounted<br>into a housing  that contains the larger filter wheel for the camera. The pinion<br>gear on the actuator output drives the filter  wheel directly with a gear mesh<br>on the outside diameter of the filter wheel disc. The motor is operated as a<br>stepper motor in this application, so no rotor position sensors are mounted<br>within the motor housing. There  is a magnetic detent wheel attached to the back<br>of the rotor to provide the necessary magnetic detent for  proper stepper motor<br>function. The filter wheel assembly is shown in Figure 17. Magnets on the filter<br>wheel  itself are sensed with hall sensors in the housing to confirm filter<br>position during operation of the mechanism.  Figure 17. Filter Wheel Assembly<br>Application of the 10-mm Actuator  Life Test Setup  Two Filter Wheel Assemblies<br>were used on the Curiosity Rover mission. Two Filter Wheel Assemblies<br>are{'source': 'AMS_2018.pdf', 'page': 332}\",3,\"Chunks\"],[\"cbcf2d82-c3ba-11ee-90dd-bae7cd9d315e\",1.1992851496,4.7734646797,\"functionality. Initially, the latch had some issues staying latched. The hook would jump out of the detent  when the array hit the hard stops and then rebound. Several mitigation methods were used to prevent this.  Proper installation of the hook is key to ensure that it is preloaded with enough force. This is done by  installing the hook in the deployed configuration. The latch design is a steel on aluminum surface. The{'source': 'AMS_2018.pdf', 'page': 401}\",\"functionality. Initially, the latch had some issues staying latched. The hook<br>would jump out of the detent  when the array hit the hard stops and then<br>rebound. Several mitigation methods were used to prevent this.  Proper<br>installation of the hook is key to ensure that it is preloaded with enough<br>force. This is done by  installing the hook in the deployed configuration. The<br>latch design is a steel on aluminum surface. The{'source': 'AMS_2018.pdf',<br>'page': 401}\",3,\"Chunks\"],[\"cbcf2fc6-c3ba-11ee-90dd-bae7cd9d315e\",3.5665385723,7.0093302727,\"demonstrate negligible change in spring\\/hinge pin assembly performance from 20\\u00b0C to -100\\u00b0C as shown  in Figure 10. This is consistent with design expectations, as no wet lubricants are used in the spring  assembly design and adequate clearance has been incorporated between all materials with dissimilar  coefficients of thermal expansion internal to the mechanism. Furthermore, the flexural modulus of 17-7  CH900 springs changes negligibly from 20\\u00b0C to -100\\u00b0C. Similar results were observed between room  temperature and the maximum flight design temperature for both projects (+105\\u00b0C).  Figure 10. SWOT Mid-Hinge Spring Assembly Output Torque at Hinge Closure at Various Temperatures  Rotary Viscous Damper Design Overview  Rotary viscous dampers have been used in dozens of spaceflight missions. Significant challenges have  been encountered in the development and qualification of these dampers and several noteworthy  breakthroughs in the design and assembly process, including vacuum fluid degassing and fill methods as  well as gasket sealing designs, have been established as standard practice to ensure acceptably consistent  performance and reliable operation in flight [2].   Building upon the state of the art for rotary viscous dampers, JPL partnered with D.E.B. Manufacturing Inc.  to qualify an improved spring\\/piston rotary viscous damper design. The rotary viscous damper design used  in this program is a variant of the heritage D.E.B. Manufacturing Inc. 1025 model damper. New design  features include the following items:  1. Higher strength steel single wing vane shaft 2. Updated custom ball bearing shields to reduce unintended leak paths from the damping chamber to the expansion chamber through the ball bearings{'source': 'AMS_2018.pdf', 'page': 427}\",\"demonstrate negligible change in spring\\/hinge pin assembly performance from 20\\u00b0C<br>to -100\\u00b0C as shown  in Figure 10. This is consistent with design expectations,<br>as no wet lubricants are used in the spring  assembly design and adequate<br>clearance has been incorporated between all materials with dissimilar<br>coefficients of thermal expansion internal to the mechanism. Furthermore, the<br>flexural modulus of 17-7  CH900 springs changes negligibly from 20\\u00b0C to -100\\u00b0C.<br>Similar results were observed between room  temperature and the maximum flight<br>design temperature for both projects (+105\\u00b0C).  Figure 10. SWOT Mid-Hinge Spring<br>Assembly Output Torque at Hinge Closure at Various Temperatures  Rotary Viscous<br>Damper Design Overview  Rotary viscous dampers have been used in dozens of<br>spaceflight missions. Significant challenges have  been encountered in the<br>development and qualification of these dampers and several noteworthy<br>breakthroughs in the design and assembly process, including vacuum fluid<br>degassing and fill methods as  well as gasket sealing designs, have been<br>established as standard practice to ensure acceptably consistent  performance<br>and reliable operation in flight [2].   Building upon the state of the art for<br>rotary viscous dampers, JPL partnered with D.E.B. Manufacturing Inc.  to qualify<br>an improved spring\\/piston rotary viscous damper design. The rotary viscous<br>damper design used  in this program is a variant of the heritage D.E.B.<br>Manufacturing Inc. 1025 model damper. New design  features include the following<br>items:  1. Higher strength steel single wing vane shaft 2. Updated custom ball<br>bearing shields to reduce unintended leak paths from the damping chamber to the<br>expansion chamber through the ball bearings{'source': 'AMS_2018.pdf', 'page':<br>427}\",3,\"Chunks\"],[\"cc63c2f8-c3ba-11ee-90dd-bae7cd9d315e\",5.3372206688,3.4460976124,\"The nature of mechanisms is that test is often the only true method of validating performance and  reliability. Reducing the amount of testing goes against the author\\u2019s comfort zone, yet it can and must be  done for volume production of space mechanisms as it is done successfully in other manufacturing fields.  Most mechanisms engineers would agree that the nature of mechanisms is that testing is crucial to  proving performance and reliability. Verification by analysis and inspection of mechanisms without a test  has historically proven inadequate. This is a particular challenge for mechanism production where testing  is very expensive, and we are looking to drive cost out of the program. There is no easy answer \\u2013  extensive testing is great for proving reliability. Limited testing is great for cost reduction but exposes the  risk of the severe pain of an on-orbit failure.  Each testing program is unique, so the following is a discussion of options for the reader to consider for  their unique mechanism effort. Each mechanism team must make their own tough choices regarding the  balance of testing versus cost.  Development testing: The goal of development testing is to expose all flaws in a design so that they will  be removed prior to going into production because design flaws found while in a production run are  extremely damaging. Extensive development testing is key to eliminating flaws and benefits considerably  from the hardware rich approach described above. When time is short, one can also find value by  finishing development testing in parallel with early production. While it is ideal to finish development  before starting production, continuing development can serve useful to expose a remaining flaw while still  early in production instead of building the flaw into a large quantity of delivered mechanisms. Life testing  of development units is a prime example of the value in finishing development in parallel with early  production since it takes so much time to complete.{'source': 'AMS_2018.pdf', 'page': 472}\",\"The nature of mechanisms is that test is often the only true method of<br>validating performance and  reliability. Reducing the amount of testing goes<br>against the author\\u2019s comfort zone, yet it can and must be  done for volume<br>production of space mechanisms as it is done successfully in other manufacturing<br>fields.  Most mechanisms engineers would agree that the nature of mechanisms is<br>that testing is crucial to  proving performance and reliability. Verification by<br>analysis and inspection of mechanisms without a test  has historically proven<br>inadequate. This is a particular challenge for mechanism production where<br>testing  is very expensive, and we are looking to drive cost out of the program.<br>There is no easy answer \\u2013  extensive testing is great for proving reliability.<br>Limited testing is great for cost reduction but exposes the  risk of the severe<br>pain of an on-orbit failure.  Each testing program is unique, so the following<br>is a discussion of options for the reader to consider for  their unique<br>mechanism effort. Each mechanism team must make their own tough choices<br>regarding the  balance of testing versus cost.  Development testing: The goal of<br>development testing is to expose all flaws in a design so that they will  be<br>removed prior to going into production because design flaws found while in a<br>production run are  extremely damaging. Extensive development testing is key to<br>eliminating flaws and benefits considerably  from the hardware rich approach<br>described above. When time is short, one can also find value by  finishing<br>development testing in parallel with early production. While it is ideal to<br>finish development  before starting production, continuing development can serve<br>useful to expose a remaining flaw while still  early in production instead of<br>building the flaw into a large quantity of delivered mechanisms. Life testing<br>of development units is a prime example of the value in finishing development in<br>parallel with early  production since it takes so much time to<br>complete.{'source': 'AMS_2018.pdf', 'page': 472}\",3,\"Chunks\"],[\"ce5d3800-c3ba-11ee-90dd-bae7cd9d315e\",5.2130689621,0.7330818772,\"ground. Phase C is open and is not connected through either FET. For the transition from step one to  step two, Phase A remains connected to +28V, but now Phase C is connected to ground through C- FET  and Phase B is open. The terminology of wave comes from this open leg shifting, and is analogous to  two-phase wave operation. Referring back to Figure 7, this is a scope trace of the three phase stepping  sequence of a wave drive with a regulated power supply, notice how the voltage in the open leg oscillates  during the overshoot transient. This is the back-emf circulating and causing the underdamped  characteristics when no damping coils are present.  For bipolar operation, all legs are active during each stepping sequence. For bipolar step one, Phase B is  \\u201chigh\\u201d through the B+ FET, and both A and C are connected to ground through the A- and C- FETS  respectively. At the second pulse, Phase B and C do not change state, but Phase A transitions from  ground to +28V. This controlled and continuous  reversal of current flow is why we call this method bipolar,  and is analogous to two-phase bipolar operation.  Control Method Trades For either control method, during the transition of each pulse, you should never  have the situation where  the high and low side FETs of a common node (e.g. A+ and A-) are simultaneously active. If they were to  41{'source': 'AMS_2008.pdf', 'page': 55}\",\"ground. Phase C is open and is not connected through either FET. For the<br>transition from step one to  step two, Phase A remains connected to +28V, but<br>now Phase C is connected to ground through C- FET  and Phase B is open. The<br>terminology of wave comes from this open leg shifting, and is analogous to  two-<br>phase wave operation. Referring back to Figure 7, this is a scope trace of the<br>three phase stepping  sequence of a wave drive with a regulated power supply,<br>notice how the voltage in the open leg oscillates  during the overshoot<br>transient. This is the back-emf circulating and causing the underdamped<br>characteristics when no damping coils are present.  For bipolar operation, all<br>legs are active during each stepping sequence. For bipolar step one, Phase B is<br>\\u201chigh\\u201d through the B+ FET, and both A and C are connected to ground through the<br>A- and C- FETS  respectively. At the second pulse, Phase B and C do not change<br>state, but Phase A transitions from  ground to +28V. This controlled and<br>continuous  reversal of current flow is why we call this method bipolar,  and is<br>analogous to two-phase bipolar operation.  Control Method Trades For either<br>control method, during the transition of each pulse, you should never  have the<br>situation where  the high and low side FETs of a common node (e.g. A+ and A-)<br>are simultaneously active. If they were to  41{'source': 'AMS_2008.pdf', 'page':<br>55}\",3,\"Chunks\"],[\"cf0a48e2-c3ba-11ee-90dd-bae7cd9d315e\",-0.7609895468,-3.9030153751,\"or PAO-based based lubricants primarily because it offers the lowest kinematic viscosity at the cold end  of the temperature range and has a comparable vapor pressure.   \\n\\nThe well-documented Achilles\\u2019 heel of PFPE lubricants is their tendency to rapidly degrade due to  catalytic chemical breakdown of the oil\\u2019s polymeric structure when used with common bearing materials  (e.g., 440C stainless steel). All polymer molecules are subject to degradation under high mechanical  shear and in a lubricant, high shear loads will act to rip apart the molecular chains. PFPE fluids react with  bearing surfaces producing \\u201ca friction polymer, which, in turn, reacts with existing oxides to produce  metallic fluorides [that] are effective, in situ solid lubricants, which reduce friction and prevent catastrophic  surface damage\\u201d [4]. Unfortunately, these metallic fluorides act as catalysts that speed up the breakdown of PFPE oils \\u2013 they are Lewis acids (electron acceptors) that catalytically attack and pull the polymer\\u2019s  molecular structure apart. It is the worst under bou ndary lubrication conditions where there is a large area  of metal-on-metal contact and more of these fluorides are created. PFPE Z-fluids, which perform better at  low temperatures, are even more vulnerable to this phenomenon since they possess a more linear  structure (straight polymer chains as opposed to branched). To effectively inhibit the degradation of PFPE  fluids one must \\u201cprevent the catalytic action of strong Lewis acids on the functional surfaces\\u201d [3]. There  are two ways to reduce the catalytic action. First, one can minimize or avoid operating in a boundary{'source': 'AMS_2008.pdf', 'page': 87}\",\"or PAO-based based lubricants primarily because it offers the lowest kinematic<br>viscosity at the cold end  of the temperature range and has a comparable vapor<br>pressure.     The well-documented Achilles\\u2019 heel of PFPE lubricants is their<br>tendency to rapidly degrade due to  catalytic chemical breakdown of the oil\\u2019s<br>polymeric structure when used with common bearing materials  (e.g., 440C<br>stainless steel). All polymer molecules are subject to degradation under high<br>mechanical  shear and in a lubricant, high shear loads will act to rip apart the<br>molecular chains. PFPE fluids react with  bearing surfaces producing \\u201ca friction<br>polymer, which, in turn, reacts with existing oxides to produce  metallic<br>fluorides [that] are effective, in situ solid lubricants, which reduce friction<br>and prevent catastrophic  surface damage\\u201d [4]. Unfortunately, these metallic<br>fluorides act as catalysts that speed up the breakdown of PFPE oils \\u2013 they are<br>Lewis acids (electron acceptors) that catalytically attack and pull the<br>polymer\\u2019s  molecular structure apart. It is the worst under bou ndary<br>lubrication conditions where there is a large area  of metal-on-metal contact<br>and more of these fluorides are created. PFPE Z-fluids, which perform better at<br>low temperatures, are even more vulnerable to this phenomenon since they possess<br>a more linear  structure (straight polymer chains as opposed to branched). To<br>effectively inhibit the degradation of PFPE  fluids one must \\u201cprevent the<br>catalytic action of strong Lewis acids on the functional surfaces\\u201d [3]. There<br>are two ways to reduce the catalytic action. First, one can minimize or avoid<br>operating in a boundary{'source': 'AMS_2008.pdf', 'page': 87}\",3,\"Chunks\"],[\"cf0a4a0e-c3ba-11ee-90dd-bae7cd9d315e\",1.8366839886,-3.7985708714,\"hard anodized coating Stainless steel coated with MoS 2 based bonded film lubricant with  \\u201cphosphate-like\\u201d binder 0.084  std dev 0.028  Al 7075-T7351 with PTFE  hard anodized coating Stainless steel coated with PTFE  based bonded film lubricant with  \\u201cphosphate-like\\u201d binder 0.120  std dev 0.020  Al 7075-T7351 with PTFE  hard anodized coating Stainless steel coated with MoS 2 based bonded film lubricant with  silicate binder 0.139  std dev 0.054  Ti6Al4V with PTFE anodic  coatingStainless steel coated with MoS 2 based bonded film lubricant with  \\u201cphosphate-like\\u201d binder 0.070  std dev 0.031  Ti6Al4V with PTFE anodic  coatingStainless steel coated with PTFE  based bonded film lubricant with  \\u201cphosphate-like\\u201d binder 0.194  std dev 0.047  Ti6Al4V with PTFE anodic  coatingStainless steel coated with MoS 2 based bonded film lubricant with  silicate binder 0.145  std dev 0.005  Al 7075-T7351 with PTFE  hard anodized coating Bare stainless steel 0.266  std dev 0.070  Ti6Al4V with PTFE anodic coatingBare stainless steel 0.212  std dev 0.048  Phase Two:  Application Specific Bushing Testing{'source': 'AMS_2008.pdf', 'page': 98}\",\"hard anodized coating Stainless steel coated with MoS 2 based bonded film<br>lubricant with  \\u201cphosphate-like\\u201d binder 0.084  std dev 0.028  Al 7075-T7351 with<br>PTFE  hard anodized coating Stainless steel coated with PTFE  based bonded film<br>lubricant with  \\u201cphosphate-like\\u201d binder 0.120  std dev 0.020  Al 7075-T7351 with<br>PTFE  hard anodized coating Stainless steel coated with MoS 2 based bonded film<br>lubricant with  silicate binder 0.139  std dev 0.054  Ti6Al4V with PTFE anodic<br>coatingStainless steel coated with MoS 2 based bonded film lubricant with<br>\\u201cphosphate-like\\u201d binder 0.070  std dev 0.031  Ti6Al4V with PTFE anodic<br>coatingStainless steel coated with PTFE  based bonded film lubricant with<br>\\u201cphosphate-like\\u201d binder 0.194  std dev 0.047  Ti6Al4V with PTFE anodic<br>coatingStainless steel coated with MoS 2 based bonded film lubricant with<br>silicate binder 0.145  std dev 0.005  Al 7075-T7351 with PTFE  hard anodized<br>coating Bare stainless steel 0.266  std dev 0.070  Ti6Al4V with PTFE anodic<br>coatingBare stainless steel 0.212  std dev 0.048  Phase Two:  Application<br>Specific Bushing Testing{'source': 'AMS_2008.pdf', 'page': 98}\",3,\"Chunks\"],[\"d2c8d1ec-c3ba-11ee-90dd-bae7cd9d315e\",-2.4645757675,2.5372097492,\"The Engineering Unit was then subject to a vacuum bake-out at 90\\u00b0C for 24 hours. Following the bakeout, the cup stems exhibited stick-slip behavior, which was not entirely unexpected given the performance in clean room bench testing. Most of the cup stems would only release after a much higher load was  applied by the Elevator actuator than was previously necessary. Some did not release at all. It was  determined that the combination of increased compression on the canted coil spring, precision cleaned components lacking surface lubricants (particularly after the vacuum bake-out), and a sharp corner on the  bottom edge of the sample cup groove (Figure 13) resulted in high contact stresses at the spring\\/stem  interface which caused the intermittent and unreliable behavior of the restraint\\/release device. Some cup  stems were then modified with a radius on the bottom edge of the groove in the sample cup stem.  reliminary testing showed promise that eliminating thP the contact stress at the interface would allow the cup stem to release in a predictable and reliable  manner.          312{'source': 'AMS_2008.pdf', 'page': 326}\",\"The Engineering Unit was then subject to a vacuum bake-out at 90\\u00b0C for 24 hours.<br>Following the bakeout, the cup stems exhibited stick-slip behavior, which was<br>not entirely unexpected given the performance in clean room bench testing. Most<br>of the cup stems would only release after a much higher load was  applied by the<br>Elevator actuator than was previously necessary. Some did not release at all. It<br>was  determined that the combination of increased compression on the canted coil<br>spring, precision cleaned components lacking surface lubricants (particularly<br>after the vacuum bake-out), and a sharp corner on the  bottom edge of the sample<br>cup groove (Figure 13) resulted in high contact stresses at the spring\\/stem<br>interface which caused the intermittent and unreliable behavior of the<br>restraint\\/release device. Some cup  stems were then modified with a radius on<br>the bottom edge of the groove in the sample cup stem.  reliminary testing showed<br>promise that eliminating thP the contact stress at the interface would allow the<br>cup stem to release in a predictable and reliable  manner.<br>312{'source': 'AMS_2008.pdf', 'page': 326}\",3,\"Chunks\"],[\"d5ad0982-c3ba-11ee-90dd-bae7cd9d315e\",11.2431468964,2.382597208,\"63   Figure 9: Improving resilience throughout the complete CLUPI f ocus mechanism development  \\n\\nTable 1: CFM random vibration specifications   Specification  Rationale  Random Levels   Early specification  Very early specification \\u2013 Only quasi -static  -  PDR  From the last issue of instrument specification  which followed a  mission configuration change (Pasteur Payload IRD v8)  X: 19.05 Grms   Y: 16.90 Grms   Z: 18.00 Grms   1st CFM  specification  Derived from PDR: the level at CFM interface are amplified by   the instrument structure  All: 36 .04 Grms   2nd CFM  specification  Following random test failures, a formal request was issued to  reduce the instrument and CFM random levels. This led to the  issue of the 2nd CFM specification.  X: 17.56 Grms   Y: 17.86 Grms   Z: 27.49 Grms   3rd CFM  specification  Testing of the rover drill box on which the CLUPI is mounted  showed higher random level than expected. Along with  instrument design update this led to the 3rd CFM specification.  X: 19.27 Grms   Y: 18.03 Grms   Z: 33.44 Grms  \\n\\nWhile the specification evolved, the design was improved and tested many times to e nsure that the CFM  would survive  the mission mechanical environment . These design iterations were presented in detail in [ 2]  and can be summarized in the following steps ill ustrated by Figure 10.{'source': 'AMS_2020.pdf', 'page': 73}\",\"63   Figure 9: Improving resilience throughout the complete CLUPI f ocus<br>mechanism development    Table 1: CFM random vibration specifications<br>Specification  Rationale  Random Levels   Early specification  Very early<br>specification \\u2013 Only quasi -static  -  PDR  From the last issue of instrument<br>specification  which followed a  mission configuration change (Pasteur Payload<br>IRD v8)  X: 19.05 Grms   Y: 16.90 Grms   Z: 18.00 Grms   1st CFM  specification<br>Derived from PDR: the level at CFM interface are amplified by   the instrument<br>structure  All: 36 .04 Grms   2nd CFM  specification  Following random test<br>failures, a formal request was issued to  reduce the instrument and CFM random<br>levels. This led to the  issue of the 2nd CFM specification.  X: 17.56 Grms   Y:<br>17.86 Grms   Z: 27.49 Grms   3rd CFM  specification  Testing of the rover drill<br>box on which the CLUPI is mounted  showed higher random level than expected.<br>Along with  instrument design update this led to the 3rd CFM specification.  X:<br>19.27 Grms   Y: 18.03 Grms   Z: 33.44 Grms    While the specification evolved,<br>the design was improved and tested many times to e nsure that the CFM  would<br>survive  the mission mechanical environment . These design iterations were<br>presented in detail in [ 2]  and can be summarized in the following steps ill<br>ustrated by Figure 10.{'source': 'AMS_2020.pdf', 'page': 73}\",3,\"Chunks\"]]}"
}