{
    "visualization_index_name": "chromadb-openai-ams-f7dc37bc-99b4c0f0",
    "umap_params": {
        "a": null,
        "angular_rp_forest": false,
        "b": null,
        "dens_frac": 0.3,
        "dens_lambda": 2.0,
        "dens_var_shift": 0.1,
        "densmap": false,
        "disconnection_distance": null,
        "force_approximation_algorithm": false,
        "init": "spectral",
        "learning_rate": 1.0,
        "local_connectivity": 1.0,
        "low_memory": true,
        "metric": "euclidean",
        "metric_kwds": null,
        "min_dist": 0.1,
        "n_components": 2,
        "n_epochs": null,
        "n_jobs": -1,
        "n_neighbors": 5,
        "negative_sample_rate": 5,
        "output_dens": false,
        "output_metric": "euclidean",
        "output_metric_kwds": null,
        "precomputed_knn": [
            null,
            null,
            null
        ],
        "random_state": 42,
        "repulsion_strength": 1.0,
        "set_op_mix_ratio": 1.0,
        "spread": 1.0,
        "target_metric": "categorical",
        "target_metric_kwds": null,
        "target_n_neighbors": -1,
        "target_weight": 0.5,
        "tqdm_kwds": {
            "desc": "Epochs completed",
            "bar_format": "{desc}: {percentage:3.0f}%| {bar} {n_fmt}/{total_fmt} [{elapsed}]",
            "disable": true
        },
        "transform_mode": "embedding",
        "transform_queue_size": 4.0,
        "transform_seed": 42,
        "unique": false,
        "verbose": false
    },
    "viz_data": "{\"columns\":[\"id\",\"x\",\"y\",\"document\",\"document_cleaned\",\"size\",\"category\"],\"index\":[0,1,2,3,4,5,6,7,8,9,10,11,12,13,14,15,16,17,18,19,20,21,22,23,24,25,26,27,28,29,30,31,32,33,34,35,36,37,38,39,40,41,42,43,44,45,46,47,48,49],\"data\":[[\"01c867d6-e316-4c61-a5e2-e9108791e3d0\",3.9932348728,8.5139389038,\"Canada (2014) .  14. Herman, Jason and Kiel Davis , Evaluation of Perflour opolyether Lubricant Lifetime in the High Stress  and High Stress -Cycle Regime for Mars Applications , 39th Aerospace Mechanisms Symposium (2008) .{'source': 'AMS_2020.pdf', 'page': 435}\",\"Canada (2014) .  14. Herman, Jason and Kiel Davis , Evaluation of Perflour<br>opolyether Lubricant Lifetime in the High Stress  and High Stress -Cycle Regime<br>for Mars Applications , 39th Aerospace Mechanisms Symposium (2008) .{'source':<br>'AMS_2020.pdf', 'page': 435}\",3,\"Chunks\"],[\"02faf497-c965-4810-8f86-45b9acfae506\",-1.2954076529,6.5786347389,\"mounting of the coils to the  stator . The team assumed the coils were potted to the stator, but a coil was accidentally damaged and  became detached from the stator . Upon further analysis, it became clear that each coi l was potted to the  stator in a single location, with a single dab of adhesive which was not especially thermally conductive . An  example of this potting location is shown in{'source': 'AMS_2020.pdf', 'page': 558}\",\"mounting of the coils to the  stator . The team assumed the coils were potted to<br>the stator, but a coil was accidentally damaged and  became detached from the<br>stator . Upon further analysis, it became clear that each coi l was potted to<br>the  stator in a single location, with a single dab of adhesive which was not<br>especially thermally conductive . An  example of this potting location is shown<br>in{'source': 'AMS_2020.pdf', 'page': 558}\",3,\"Chunks\"],[\"053abb17-2c5e-4ca2-a376-042b568806c1\",0.319693923,7.2698292732,\"Figure 4. Fully reversed range of deflection of the p rototype flexure at (a)  max extension from tensile  load, (b) nominal unloaded state, and (c) max compression from compressive load.{'source': 'AMS_2020.pdf', 'page': 441}\",\"Figure 4. Fully reversed range of deflection of the p rototype flexure at (a)<br>max extension from tensile  load, (b) nominal unloaded state, and (c) max<br>compression from compressive load.{'source': 'AMS_2020.pdf', 'page': 441}\",3,\"Chunks\"],[\"07b63752-19b2-418f-b5fd-8cd3e06de519\",-0.9807513356,10.0809383392,\"is considered fast 6 Moderate capability satellites in high volume High capability satellites in low volume  7 Reliability of business plan Reliability of satellites  8 Space Environment Space Environment  9 Rockets are a rough environment Rockets are a rough environment  10 Streamlined processes Very thorough processes  11 Ignore, adapt or use established standards Mandated use of established{'source': 'AMS_2018.pdf', 'page': 463}\",\"is considered fast 6 Moderate capability satellites in high volume High<br>capability satellites in low volume  7 Reliability of business plan Reliability<br>of satellites  8 Space Environment Space Environment  9 Rockets are a rough<br>environment Rockets are a rough environment  10 Streamlined processes Very<br>thorough processes  11 Ignore, adapt or use established standards Mandated use<br>of established{'source': 'AMS_2018.pdf', 'page': 463}\",3,\"Chunks\"],[\"12bc0c26-560b-4093-aefb-a94aa19b7674\",1.2483404875,11.2633485794,\"determined. It was not possible to account for the orientation of the  inter-panel hinges to the deployment floor.  NASA\\/CP\\u20142018-219887 398{'source': 'AMS_2018.pdf', 'page': 416}\",\"determined. It was not possible to account for the orientation of the  inter-<br>panel hinges to the deployment floor.  NASA\\/CP\\u20142018-219887 398{'source':<br>'AMS_2018.pdf', 'page': 416}\",3,\"Chunks\"],[\"17b26f07-b051-4202-a823-b39f08d4b0d0\",-0.1362161636,7.0724740028,\"The principle of the Large- Angle Flexib le Pivot is based on controlled deformation of structures  in pure  bending within their elastic limit. The flexible pivot  consists of two interface rings connected by flexible  elements  (Figure 1) . The first ring is the stator and the second is the rotor. A first set of flexible elements   connect the stator ring to a central cylinder. These  spokes{'source': 'AMS_2020.pdf', 'page': 513}\",\"The principle of the Large- Angle Flexib le Pivot is based on controlled<br>deformation of structures  in pure  bending within their elastic limit. The<br>flexible pivot  consists of two interface rings connected by flexible  elements<br>(Figure 1) . The first ring is the stator and the second is the rotor. A first<br>set of flexible elements   connect the stator ring to a central cylinder. These<br>spokes{'source': 'AMS_2020.pdf', 'page': 513}\",3,\"Chunks\"],[\"1fd5ca11-53ab-4dcf-ae9d-ce63b4d4cf99\",0.3492693007,11.983959198,\"instrument is too large for the entire instrument to be tested. A  larger facility may need to be developed in order to test the complete instrument. However, the scan  mechanism in the instrument is compatible with these two facilities.   NASA\\/CP\\u20142018-219887 201{'source': 'AMS_2018.pdf', 'page': 219}\",\"instrument is too large for the entire instrument to be tested. A  larger<br>facility may need to be developed in order to test the complete instrument.<br>However, the scan  mechanism in the instrument is compatible with these two<br>facilities.   NASA\\/CP\\u20142018-219887 201{'source': 'AMS_2018.pdf', 'page': 219}\",3,\"Chunks\"],[\"22d917b2-36b6-4056-aca3-06ba5896d950\",4.0875406265,8.7331895828,\"The heritage bearing lubricant for most scanning mechanisms at Airbus Friedrichshafen is grease Maplub  SH051 -a, in combination with phenolic resin cages that are impregnated with Nye 2001a.  These MAC - based lubricants were chosen due to their excellent lifetime (in terms of revolutions) which exceeds the  lifetime of PFPE -based lubricants by far [2]. However, according to current literature,{'source': 'AMS_2020.pdf', 'page': 58}\",\"The heritage bearing lubricant for most scanning mechanisms at Airbus<br>Friedrichshafen is grease Maplub  SH051 -a, in combination with phenolic resin<br>cages that are impregnated with Nye 2001a.  These MAC - based lubricants were<br>chosen due to their excellent lifetime (in terms of revolutions) which exceeds<br>the  lifetime of PFPE -based lubricants by far [2]. However, according to<br>current literature,{'source': 'AMS_2020.pdf', 'page': 58}\",3,\"Chunks\"],[\"2484390b-0f98-4bdf-aa67-eaf02b3f3b8d\",3.2260537148,10.1272258759,\"Alcal\\u00e1 de Henares, Spain ;  Ignacio Valiente -Blanco et al.,  MAG SOAR S.L, Valdemoro, Spai n   -A Mechanis ms Perspective on Microvibration \\u2013 Good Practices and Lessons Learned Geert Smet & Sandro Patti, European Space Agency, Noordwijk, The Netherlands 4:00 SESSION  V \\u2013 POTPOURRI  OF POSTERS   Session  Chair : Joseph Pellicciotti, NASA HQ , Washington, D. C.   -Investiga tion of Bolt Preload{'source': 'AMS_2018.pdf', 'page': 12}\",\"Alcal\\u00e1 de Henares, Spain ;  Ignacio Valiente -Blanco et al.,  MAG SOAR S.L,<br>Valdemoro, Spai n   -A Mechanis ms Perspective on Microvibration \\u2013 Good<br>Practices and Lessons Learned Geert Smet & Sandro Patti, European Space Agency,<br>Noordwijk, The Netherlands 4:00 SESSION  V \\u2013 POTPOURRI  OF POSTERS   Session<br>Chair : Joseph Pellicciotti, NASA HQ , Washington, D. C.   -Investiga tion of<br>Bolt Preload{'source': 'AMS_2018.pdf', 'page': 12}\",3,\"Chunks\"],[\"2cbe6e2f-69e6-4d93-9fba-0dad201577de\",1.0315457582,9.6906585693,\"deploys.   Figure 1. RF Reflector Boom Deployment Sequences  The boom hinge deploy and latching mechanism design includes a spring\\/damper mechanism for hinge  closure and an actuator-driven latching mechanism for hinge joint preloading (Figure 2). The spring\\/damper  mechanism automatically proceeds with hinge closure immediately following mast launch restraint  separation. Hinge latching does not{'source': 'AMS_2018.pdf', 'page': 421}\",\"deploys.   Figure 1. RF Reflector Boom Deployment Sequences  The boom hinge<br>deploy and latching mechanism design includes a spring\\/damper mechanism for<br>hinge  closure and an actuator-driven latching mechanism for hinge joint<br>preloading (Figure 2). The spring\\/damper  mechanism automatically proceeds with<br>hinge closure immediately following mast launch restraint  separation. Hinge<br>latching does not{'source': 'AMS_2018.pdf', 'page': 421}\",3,\"Chunks\"],[\"306c2b82-115f-48ad-ad2d-2098ba3c6f16\",-1.2024174929,7.9250397682,\"been earlier  acceptance of the need for a change of design concept for these two items  and better integration between  mechanical and electr ical aspects of the design process in the crucial early phases .{'source': 'AMS_2020.pdf', 'page': 477}\",\"been earlier  acceptance of the need for a change of design concept for these<br>two items  and better integration between  mechanical and electr ical aspects of<br>the design process in the crucial early phases .{'source': 'AMS_2020.pdf',<br>'page': 477}\",3,\"Chunks\"],[\"32106003-7924-47de-a706-17be68748e75\",0.562489748,10.8018865585,\"of the fairing\\u2019s  rotation axis   during the separ ation event :  \\u2022 The hinges common rotation axis needs to be outside the launcher\\u2019s envelope as visible in Figure  5. This is necessary as to avoid jamming or the need of tr ansversal movement before the rotation  phase.   \\u2022 The rotation axis needs to be below the fairing\\u2019s interface line to the launcher last stage, in order  to avoid jamming at{'source': 'AMS_2020.pdf', 'page': 359}\",\"of the fairing\\u2019s  rotation axis   during the separ ation event :  \\u2022 The hinges<br>common rotation axis needs to be outside the launcher\\u2019s envelope as visible in<br>Figure  5. This is necessary as to avoid jamming or the need of tr ansversal<br>movement before the rotation  phase.   \\u2022 The rotation axis needs to be below the<br>fairing\\u2019s interface line to the launcher last stage, in order  to avoid jamming<br>at{'source': 'AMS_2020.pdf', 'page': 359}\",3,\"Chunks\"],[\"39c654e1-006b-4249-b02f-e368347f2000\",-1.2899795771,8.3516101837,\"and the model was found to be inadequate. The model issue could have been found  much sooner in the flow by validating the model against BEMF voltage plots taken during baseline functional  testing. Comparing predicted to actual BEMF plots would have unearthed the modelling issue sooner.   Recommendations  The issues discussed in this paper may be lessons learned to some, and to others they may{'source': 'AMS_2018.pdf', 'page': 323}\",\"and the model was found to be inadequate. The model issue could have been found<br>much sooner in the flow by validating the model against BEMF voltage plots taken<br>during baseline functional  testing. Comparing predicted to actual BEMF plots<br>would have unearthed the modelling issue sooner.   Recommendations  The issues<br>discussed in this paper may be lessons learned to some, and to others they<br>may{'source': 'AMS_2018.pdf', 'page': 323}\",3,\"Chunks\"],[\"3e664b46-845b-4700-abcb-fff10f9a9a0a\",-0.5322858691,7.1850409508,\"element adds up. The other approach is to stiffen the compensation ring itself and to concentrate mass at  the suspension points (nodes of mode shape). Taking strain energy out of the mode will reduce its  magnitude. Please note that the inertia tensor of the ring has to remain unchanged to retain its original  functionality.   Figure 4. Two design concepts to eliminate the 300-Hz structural{'source': 'AMS_2018.pdf', 'page': 186}\",\"element adds up. The other approach is to stiffen the compensation ring itself<br>and to concentrate mass at  the suspension points (nodes of mode shape). Taking<br>strain energy out of the mode will reduce its  magnitude. Please note that the<br>inertia tensor of the ring has to remain unchanged to retain its original<br>functionality.   Figure 4. Two design concepts to eliminate the 300-Hz<br>structural{'source': 'AMS_2018.pdf', 'page': 186}\",3,\"Chunks\"],[\"40bd298c-f19f-4d57-8e0a-74ec796ab56c\",-0.6840261817,10.9611701965,\"The  RADAR instrument then went through a 6.1 G RMS workmanship vibe, which was the minimum required as  actual launch loads for RainCube are expected to be much lower, closer to 2 G RMS (given it is being stowed  with soft cargo to the International Space Station). After vibe, the antenna went through a second thermal  vacuum test, this time where it was deployed at 0\\u00b0C.  The antenna behaved{'source': 'AMS_2018.pdf', 'page': 388}\",\"The  RADAR instrument then went through a 6.1 G RMS workmanship vibe, which was<br>the minimum required as  actual launch loads for RainCube are expected to be<br>much lower, closer to 2 G RMS (given it is being stowed  with soft cargo to the<br>International Space Station). After vibe, the antenna went through a second<br>thermal  vacuum test, this time where it was deployed at 0\\u00b0C.  The antenna<br>behaved{'source': 'AMS_2018.pdf', 'page': 388}\",3,\"Chunks\"],[\"4397d353-45cd-46e9-8089-4d4f2c5de615\",2.6788051128,6.7340159416,\"operational speeds. The  overcurrent provided a \\u201cfalse positive\\u201d:  overpowering the motors produced more torque than the datasheets  and designs allowed. The overcurrent lasted for the 15-minute deployment duration and showed no  evidence of failure through about 50+ prototype tests. However, it did give a false sense of confidence that  the smaller motors could produce the required torques due{'source': 'AMS_2018.pdf', 'page': 343}\",\"operational speeds. The  overcurrent provided a \\u201cfalse positive\\u201d:  overpowering<br>the motors produced more torque than the datasheets  and designs allowed. The<br>overcurrent lasted for the 15-minute deployment duration and showed no  evidence<br>of failure through about 50+ prototype tests. However, it did give a false sense<br>of confidence that  the smaller motors could produce the required torques<br>due{'source': 'AMS_2018.pdf', 'page': 343}\",3,\"Chunks\"],[\"4c4ed49c-52b3-496d-a092-1997e2b31c14\",-0.7781466842,10.7788696289,\"masses  installed on the ends of the deployable SAs to eventually point the CubeSat radiator down toward Earth.  The final deployment angle was determined to be 135\\u00b0 from the stowed configuration for optimal power  generation. However, a power analysis has shown that a 90\\u00b0 deployment angle is sufficient to recharge the  batteries with acceptable power generation degradation.   The underlying goal{'source': 'AMS_2018.pdf', 'page': 394}\",\"masses  installed on the ends of the deployable SAs to eventually point the<br>CubeSat radiator down toward Earth.  The final deployment angle was determined<br>to be 135\\u00b0 from the stowed configuration for optimal power  generation. However,<br>a power analysis has shown that a 90\\u00b0 deployment angle is sufficient to recharge<br>the  batteries with acceptable power generation degradation.   The underlying<br>goal{'source': 'AMS_2018.pdf', 'page': 394}\",3,\"Chunks\"],[\"4e8d6c9a-f153-4439-a7c4-6ab8f67018ee\",-0.1620322019,8.8426828384,\"305  \\n\\nFigure 3. Schematic of Mini Traction Machine, image courtesy of PCS Instruments{'source': 'AMS_2020.pdf', 'page': 315}\",\"305    Figure 3. Schematic of Mini Traction Machine, image courtesy of PCS<br>Instruments{'source': 'AMS_2020.pdf', 'page': 315}\",3,\"Chunks\"],[\"4ffc6b7c-6676-4f9b-bd80-339bda111e84\",3.35151124,7.8785338402,\"material (Saddleback Basalt ~130 MPa) in 10 minutes. This desired penetration rate drives the drilling  power which, in turn, drives the actuator sizing.  Honeybee Robotics has developed a rotary-percussive rock sampling drill and high temperature (HT)  electromagnetic actuator (motor, sensor and gearbox) for Venus [1]. The motors have been characterized  in dynamometer tests and simulations to{'source': 'AMS_2018.pdf', 'page': 59}\",\"material (Saddleback Basalt ~130 MPa) in 10 minutes. This desired penetration<br>rate drives the drilling  power which, in turn, drives the actuator sizing.<br>Honeybee Robotics has developed a rotary-percussive rock sampling drill and high<br>temperature (HT)  electromagnetic actuator (motor, sensor and gearbox) for Venus<br>[1]. The motors have been characterized  in dynamometer tests and simulations<br>to{'source': 'AMS_2018.pdf', 'page': 59}\",3,\"Chunks\"],[\"5a8d1439-4f4c-441f-88c4-46fb6716479c\",2.6229519844,10.4019079208,\"Figure 11. Collected particles after HIP.{'source': 'AMS_2020.pdf', 'page': 536}\",\"Figure 11. Collected particles after HIP.{'source': 'AMS_2020.pdf', 'page': 536}\",3,\"Chunks\"],[\"5bc72129-7b5d-4637-8b55-431c546a80f3\",-0.2493977994,8.9297084808,\"mini phono jack on the dispenser mating end.{'source': 'AMS_2020.pdf', 'page': 475}\",\"mini phono jack on the dispenser mating end.{'source': 'AMS_2020.pdf', 'page':<br>475}\",3,\"Chunks\"],[\"5cd3871d-958b-4432-9a7f-bc82d882b031\",1.8479635715,11.1428146362,\"of Safety Values  In 2009, after hardware storage, concerns were raised about the variability of output torques in the hinges  and it was determined that better characterization of the hinge lines was required. IPH testing was carried  out to measure the output torque across the full range of motion in both directions and the available torque  dropped from previously measured values thanks to{'source': 'AMS_2018.pdf', 'page': 409}\",\"of Safety Values  In 2009, after hardware storage, concerns were raised about<br>the variability of output torques in the hinges  and it was determined that<br>better characterization of the hinge lines was required. IPH testing was carried<br>out to measure the output torque across the full range of motion in both<br>directions and the available torque  dropped from previously measured values<br>thanks to{'source': 'AMS_2018.pdf', 'page': 409}\",3,\"Chunks\"],[\"5f68f223-bef5-40ed-98a9-b0a6de5fdad1\",-1.3677588701,7.1065702438,\"Several lessons were learned in the prototyping  of the magnet  housing. The magnet housing is two  separate pieces that when mated together there is a void that would fit the ring magnet. To have the{'source': 'AMS_2020.pdf', 'page': 445}\",\"Several lessons were learned in the prototyping  of the magnet  housing. The<br>magnet housing is two  separate pieces that when mated together there is a void<br>that would fit the ring magnet. To have the{'source': 'AMS_2020.pdf', 'page':<br>445}\",3,\"Chunks\"],[\"683fa5a8-04ce-4ad7-a1a0-01b5f7ea3c04\",2.0320427418,7.5976366997,\"Lifetime   The lifetime requirement of the Scanner mechanism is 201 million revolutions; the requirement for  the  Derotator mechanism is 101 million revolutions . Both values include on-ground operation and margins as  per ECSS -E-ST-33-01C.  The design operating range of  both mechanisms was specified as  10\\u00b0C to 34\\u00b0C.   Due to local dissipation, bearing temperatures were calculated to reach{'source': 'AMS_2020.pdf', 'page': 60}\",\"Lifetime   The lifetime requirement of the Scanner mechanism is 201 million<br>revolutions; the requirement for  the  Derotator mechanism is 101 million<br>revolutions . Both values include on-ground operation and margins as  per ECSS<br>-E-ST-33-01C.  The design operating range of  both mechanisms was specified as<br>10\\u00b0C to 34\\u00b0C.   Due to local dissipation, bearing temperatures were calculated<br>to reach{'source': 'AMS_2020.pdf', 'page': 60}\",3,\"Chunks\"],[\"68465771-c241-46b8-9ac2-a1939644127c\",1.5457257032,6.2554240227,\"synchronization, and this rate limiting in combination with the discrete step size has the associated  effect of limiting the control bandwidth. While this limitation may be acceptable for coarse pointing  applications, it can be a hindrance for more precise pointing applications where improved tracking and  disturbance attenuation capabilities are needed.   In contrast, BLDC actuators behave{'source': 'AMS_2018.pdf', 'page': 291}\",\"synchronization, and this rate limiting in combination with the discrete step<br>size has the associated  effect of limiting the control bandwidth. While this<br>limitation may be acceptable for coarse pointing  applications, it can be a<br>hindrance for more precise pointing applications where improved tracking and<br>disturbance attenuation capabilities are needed.   In contrast, BLDC actuators<br>behave{'source': 'AMS_2018.pdf', 'page': 291}\",3,\"Chunks\"],[\"6d40160e-cdbd-4c48-9846-001810d1f5c5\",1.9162663221,11.0217962265,\"torsion  springs needed to  produce  a minimum deployment -direction torque of 28 inch- pounds  (3.2 N -m) at hinge closure. A standard round  wire 17-7 precipitation -hardened stainless -steel  torsion spring would not produce adequate torque in the  volume available without  violating mission critical factors of safety.  Alternative materials such as Elgiloy and  MP35N were considered, but all{'source': 'AMS_2020.pdf', 'page': 239}\",\"torsion  springs needed to  produce  a minimum deployment -direction torque of<br>28 inch- pounds  (3.2 N -m) at hinge closure. A standard round  wire 17-7<br>precipitation -hardened stainless -steel  torsion spring would not produce<br>adequate torque in the  volume available without  violating mission critical<br>factors of safety.  Alternative materials such as Elgiloy and  MP35N were<br>considered, but all{'source': 'AMS_2020.pdf', 'page': 239}\",3,\"Chunks\"],[\"7a19d2ce-6ee7-4224-81c4-d3aa2d994f4d\",3.1254689693,7.5096745491,\"Table 5 shows the average motor torque and speed for each of the two mechanisms comprising the Venus  drill under different test conditions. Average torque was calculated by taking the average motor current over  the entire drilling time and multiplying by the motor torque constant K t. Peak torque was measured directly  NASA\\/CP\\u20142018-219887 49{'source': 'AMS_2018.pdf', 'page': 67}\",\"Table 5 shows the average motor torque and speed for each of the two mechanisms<br>comprising the Venus  drill under different test conditions. Average torque was<br>calculated by taking the average motor current over  the entire drilling time<br>and multiplying by the motor torque constant K t. Peak torque was measured<br>directly  NASA\\/CP\\u20142018-219887 49{'source': 'AMS_2018.pdf', 'page': 67}\",3,\"Chunks\"],[\"82123325-0ab1-458d-9443-6f8ebeaaa2df\",1.779479146,11.2180919647,\"were not  adjusted correctly.  The air bearing support was supplied with air through a single hose to each panel and can be seen in  Figure 15. It became apparent that the manual handling of these hoses could potentially impact how the  array deployed and care had to be taken in how the hoses were managed. If they were twisted the wrong  way, then a retarding torque could be applied at the hinge{'source': 'AMS_2018.pdf', 'page': 417}\",\"were not  adjusted correctly.  The air bearing support was supplied with air<br>through a single hose to each panel and can be seen in  Figure 15. It became<br>apparent that the manual handling of these hoses could potentially impact how<br>the  array deployed and care had to be taken in how the hoses were managed. If<br>they were twisted the wrong  way, then a retarding torque could be applied at<br>the hinge{'source': 'AMS_2018.pdf', 'page': 417}\",3,\"Chunks\"],[\"8e37ee94-2742-4fe3-a208-d23860284cc4\",-0.5440003276,6.1874117851,\"that was easier to remove entrained air  bubbles and with a CTE that was more compatible  with the encapsulated materials. The degas process  was improved to ensure bubbles were removed from  the potting material and the HED was also encased in RTV silicone to cushion it during thermal expansion.  Additional measures were also taken to ensure that if  a motor with large voids was produced in{'source': 'AMS_2018.pdf', 'page': 510}\",\"that was easier to remove entrained air  bubbles and with a CTE that was more<br>compatible  with the encapsulated materials. The degas process  was improved to<br>ensure bubbles were removed from  the potting material and the HED was also<br>encased in RTV silicone to cushion it during thermal expansion.  Additional<br>measures were also taken to ensure that if  a motor with large voids was<br>produced in{'source': 'AMS_2018.pdf', 'page': 510}\",3,\"Chunks\"],[\"9760fbc8-af12-496a-8c10-68329ca1b191\",-0.4124567509,12.0667743683,\"levels across the full spectrum. The shock is created using a  pneumatic gun and a shock test fixture. The pneumatic gun uses compressed air to propel a metal projectile  that impacts the shock test fixture. The projectile and shock test fixture are specially designed and tuned to  recreate a specific Shock Response Spectrum (SRS) upon impact. Once tuning of the fixture is complete,  shock levels{'source': 'AMS_2018.pdf', 'page': 313}\",\"levels across the full spectrum. The shock is created using a  pneumatic gun and<br>a shock test fixture. The pneumatic gun uses compressed air to propel a metal<br>projectile  that impacts the shock test fixture. The projectile and shock test<br>fixture are specially designed and tuned to  recreate a specific Shock Response<br>Spectrum (SRS) upon impact. Once tuning of the fixture is complete,  shock<br>levels{'source': 'AMS_2018.pdf', 'page': 313}\",3,\"Chunks\"],[\"985d9322-54ab-4d23-9ef4-09aa16871640\",-0.5832913518,12.0652980804,\"near 200 Hz, Moog was contacted to perform a mechanical impact shock test tailored to  mitigate the low frequency over-test. Typically, shock level overages at lower frequencies are not a concern,  but this was a critical parameter for the CSADA. Moog had developed shock test fixtures and techniques  to provide this kind of pulse shaping capability previously and were able to adjust and tune an{'source': 'AMS_2018.pdf', 'page': 313}\",\"near 200 Hz, Moog was contacted to perform a mechanical impact shock test<br>tailored to  mitigate the low frequency over-test. Typically, shock level<br>overages at lower frequencies are not a concern,  but this was a critical<br>parameter for the CSADA. Moog had developed shock test fixtures and techniques<br>to provide this kind of pulse shaping capability previously and were able to<br>adjust and tune an{'source': 'AMS_2018.pdf', 'page': 313}\",3,\"Chunks\"],[\"9ff85833-06a5-4538-9e67-f7af00cbeeaa\",0.8101373315,9.0579977036,\"Figure 4. (a) A conventional Scotch yoke which is the means of converting rotation into translation in the  percussion mechanism (b) Vertical section view through bevel pinion, crank shaft, roller ball, and driver  plate (c) Horizontal section through divider plate sh owing three cranks and anti -rotation rollers in guides{'source': 'AMS_2020.pdf', 'page': 179}\",\"Figure 4. (a) A conventional Scotch yoke which is the means of converting<br>rotation into translation in the  percussion mechanism (b) Vertical section view<br>through bevel pinion, crank shaft, roller ball, and driver  plate (c) Horizontal<br>section through divider plate sh owing three cranks and anti -rotation rollers<br>in guides{'source': 'AMS_2020.pdf', 'page': 179}\",3,\"Chunks\"],[\"a17e638c-6e60-4f84-baf9-ac81677152fd\",0.4957559407,11.8701715469,\"Other . SIH items , including the  sample tubes , hermetic seals, bits, and volume station,  have the most stringent handling constraints  and  required  sterile assembly techniques in an ISO 5 cleanroom . SHH items include the hermetic seal  dispensers, gloves and covers, and the vision station, which were assembled in similar conditions to the  SIH hardware.{'source': 'AMS_2020.pdf', 'page': 132}\",\"Other . SIH items , including the  sample tubes , hermetic seals, bits, and<br>volume station,  have the most stringent handling constraints  and  required<br>sterile assembly techniques in an ISO 5 cleanroom . SHH items include the<br>hermetic seal  dispensers, gloves and covers, and the vision station, which were<br>assembled in similar conditions to the  SIH hardware.{'source': 'AMS_2020.pdf',<br>'page': 132}\",3,\"Chunks\"],[\"a48d8695-6d32-442b-a1e1-47c0eba0b613\",-0.0158608854,7.146446228,\"flexures. The mechanism is nominally athermalized via an athermal fitting, illustrated in  Figure 4. The remaining radial flexures remove thermoelastic distortion uncertainty.  Flexure Design  All flexures were fabricated by electrical discharge machining (EDM), with the titanium flexures requiring  chemical etching post-machining to remove the beta-alpha recast layer. Trade studies were{'source': 'AMS_2018.pdf', 'page': 49}\",\"flexures. The mechanism is nominally athermalized via an athermal fitting,<br>illustrated in  Figure 4. The remaining radial flexures remove thermoelastic<br>distortion uncertainty.  Flexure Design  All flexures were fabricated by<br>electrical discharge machining (EDM), with the titanium flexures requiring<br>chemical etching post-machining to remove the beta-alpha recast layer. Trade<br>studies were{'source': 'AMS_2018.pdf', 'page': 49}\",3,\"Chunks\"],[\"a6a04521-7b66-42dd-a10b-3edbfdebfc77\",3.6508545876,9.6781625748,\"(ESA) R&D study, Surrey Satellite Technology Ltd (SSTL) performed inorbit microvibration measurements using an in-situ microvibration monitoring system [1]. Several different  noise sources were measured, but the most surprising results appear on two reaction wheels that are  identical except for the lubricant used. One wheel uses a synthetic oil, whereas the other uses dry  lubricant in the form{'source': 'AMS_2018.pdf', 'page': 211}\",\"(ESA) R&D study, Surrey Satellite Technology Ltd (SSTL) performed inorbit<br>microvibration measurements using an in-situ microvibration monitoring system<br>[1]. Several different  noise sources were measured, but the most surprising<br>results appear on two reaction wheels that are  identical except for the<br>lubricant used. One wheel uses a synthetic oil, whereas the other uses dry<br>lubricant in the form{'source': 'AMS_2018.pdf', 'page': 211}\",3,\"Chunks\"],[\"b5a0c25b-c456-45fe-a31b-d4d78b1f75a1\",-0.044908531,9.5916996002,\"a hatch opening and the clunk of the final structural connection to  symbolize the consequence and finality of arrival and departure.  NASA\\u2019s newest docking system evolved from systems developed during the Apollo-Soyuz Test Project.  This paper will trace the considerations that drove that evolution to the current design. It will provide an  overview of the NDS architecture, components, and{'source': 'AMS_2018.pdf', 'page': 490}\",\"a hatch opening and the clunk of the final structural connection to  symbolize<br>the consequence and finality of arrival and departure.  NASA\\u2019s newest docking<br>system evolved from systems developed during the Apollo-Soyuz Test Project.<br>This paper will trace the considerations that drove that evolution to the<br>current design. It will provide an  overview of the NDS architecture,<br>components, and{'source': 'AMS_2018.pdf', 'page': 490}\",3,\"Chunks\"],[\"b8dfd15e-723b-465f-9e9f-e1c46e45af48\",-0.7932416201,10.6427087784,\"Near Earth Asteroid (NEA) Scout is a deep space satellite manifested on NASA\\u2019s ARTEMIS 1 as a  secondary payload. The spacecraft meets the CubeSat 6U standard (about 300 x 200 x 100 mm) and is  designed to travel 1 AU  (150,000,000 km)  over a 2- year mission t o observe a NEA 1. Once dispensed from  SLS, the NEA Scout will use an 85- m2 solar sail to maneuver from lunar orbit to the asteroid.{'source': 'AMS_2020.pdf', 'page': 553}\",\"Near Earth Asteroid (NEA) Scout is a deep space satellite manifested on NASA\\u2019s<br>ARTEMIS 1 as a  secondary payload. The spacecraft meets the CubeSat 6U standard<br>(about 300 x 200 x 100 mm) and is  designed to travel 1 AU  (150,000,000 km)<br>over a 2- year mission t o observe a NEA 1. Once dispensed from  SLS, the NEA<br>Scout will use an 85- m2 solar sail to maneuver from lunar orbit to the<br>asteroid.{'source': 'AMS_2020.pdf', 'page': 553}\",3,\"Chunks\"],[\"b915f9f4-188b-45a1-a7f7-5b23f08e8df7\",-1.0285260677,8.9677295685,\"schedule to design and  development. Leveraging rapid prototyping, out of house manufacturing shops, and communicative  vendors allowed the project to be successful and absorb all of the lessons learned while still delivering flight  hardware. Use of the lien development process allowed to team to get familiar with the hardware and  confident in the design. This gave the project confidence in{'source': 'AMS_2018.pdf', 'page': 310}\",\"schedule to design and  development. Leveraging rapid prototyping, out of house<br>manufacturing shops, and communicative  vendors allowed the project to be<br>successful and absorb all of the lessons learned while still delivering flight<br>hardware. Use of the lien development process allowed to team to get familiar<br>with the hardware and  confident in the design. This gave the project confidence<br>in{'source': 'AMS_2018.pdf', 'page': 310}\",3,\"Chunks\"],[\"badff0cf-b99d-4c78-b7fe-7bc65343c3b2\",0.4484985769,6.8277630806,\"-recoverable pr eload is an  enormous advantage. As already mentioned above, the reliability has been tested at SpaceTech GmbH in  a lifetime  comprising either electrical or mechanical releases far above the qualification limits.{'source': 'AMS_2020.pdf', 'page': 108}\",\"-recoverable pr eload is an  enormous advantage. As already mentioned above, the<br>reliability has been tested at SpaceTech GmbH in  a lifetime  comprising either<br>electrical or mechanical releases far above the qualification limits.{'source':<br>'AMS_2020.pdf', 'page': 108}\",3,\"Chunks\"],[\"ca97cb66-d9cc-4035-b9ad-ef23354b4d71\",0.0796681643,9.5953865051,\"Figure 2. The Ball-Lock Mechanism Prior to Commanding (left) and After Commanding (right). A slight  retraction of the central plunger can be seen.  Concurrently an effort began to develop and fly a secondary latching system that was designed to prevent  inadvertent deployment in the case that commanding did not result in immediate satellite release. The  system was designed and handed over to{'source': 'AMS_2018.pdf', 'page': 372}\",\"Figure 2. The Ball-Lock Mechanism Prior to Commanding (left) and After<br>Commanding (right). A slight  retraction of the central plunger can be seen.<br>Concurrently an effort began to develop and fly a secondary latching system that<br>was designed to prevent  inadvertent deployment in the case that commanding did<br>not result in immediate satellite release. The  system was designed and handed<br>over to{'source': 'AMS_2018.pdf', 'page': 372}\",3,\"Chunks\"],[\"cef9779c-8bff-40b6-8a8a-b6d55d61f0b0\",2.1071288586,7.6988348961,\"of 10 EM1s  (3\\u00d7 10 mN \\u2022m and 7\\u00d7   20 mN\\u2022m), 35 FM1s  (14\\u00d7 10 mN\\u2022m and 24 \\u00d7 20 mN\\u2022m), and 54 FM2 s (33\\u00d7 10 mNm and 21\\u00d7  20 mN\\u2022m).  Similarly, the M20 gearmotor had a JPL need of 6 units but a total of 40 units were delivered. The 40 units  consisted of 16 EMs  and 24  FMs. On the FM units, the carrier s with sun  gear were made out of two different  material t ypes, with 12 units of each type{'source': 'AMS_2020.pdf', 'page': 432}\",\"of 10 EM1s  (3\\u00d7 10 mN \\u2022m and 7\\u00d7   20 mN\\u2022m), 35 FM1s  (14\\u00d7 10 mN\\u2022m and 24 \\u00d7 20<br>mN\\u2022m), and 54 FM2 s (33\\u00d7 10 mNm and 21\\u00d7  20 mN\\u2022m).  Similarly, the M20 gearmotor<br>had a JPL need of 6 units but a total of 40 units were delivered. The 40 units<br>consisted of 16 EMs  and 24  FMs. On the FM units, the carrier s with sun  gear<br>were made out of two different  material t ypes, with 12 units of each<br>type{'source': 'AMS_2020.pdf', 'page': 432}\",3,\"Chunks\"],[\"d1e8fb1d-0a8d-4000-8e4c-0b8f28997b76\",3.9931440353,9.2956905365,\"these selected conditions and ratio we might expect these results to provide a demanding (even  perhaps a kind of \\u201cworst\\u201d) test case for the lubricants used.  NASA\\/CP\\u20142018-219887 159{'source': 'AMS_2018.pdf', 'page': 177}\",\"these selected conditions and ratio we might expect these results to provide a<br>demanding (even  perhaps a kind of \\u201cworst\\u201d) test case for the lubricants used.<br>NASA\\/CP\\u20142018-219887 159{'source': 'AMS_2018.pdf', 'page': 177}\",3,\"Chunks\"],[\"dc903cdb-dc46-4211-81bc-cbb02e752874\",3.0525784492,10.2117233276,\"Laboratory, University of Akron, Akron, OH \\u2020Currently at Sentient Science, West Lafayette, IN \\u2021Currently at Argonne National Laboratory, Lemont, IL Proceedings of the 44th Aerospace Mechanisms Symposium, NASA Glenn Research Center, May 16-18, 2018 NASA\\/CP\\u20142018-219887 141{'source': 'AMS_2018.pdf', 'page': 159}\",\"Laboratory, University of Akron, Akron, OH \\u2020Currently at Sentient Science, West<br>Lafayette, IN \\u2021Currently at Argonne National Laboratory, Lemont, IL Proceedings<br>of the 44th Aerospace Mechanisms Symposium, NASA Glenn Research Center, May<br>16-18, 2018 NASA\\/CP\\u20142018-219887 141{'source': 'AMS_2018.pdf', 'page': 159}\",3,\"Chunks\"],[\"de69e63e-3a6c-44fd-a448-cde8ad7f1ec4\",0.8140425086,8.0448112488,\"footprint would  increase by 465 millimeters. Instead of using a 44.26 volume ratio, the design again fit the largest volume  ratio within the given 95-mm footprint.   The 5.82 volume ratio results in a pressure-volume (P-V) curve as shown in Figure 4. The purple curve is  the ideal P-V curve for the operating pressures required. The compression process starts at the far right of  the curve, when{'source': 'AMS_2018.pdf', 'page': 22}\",\"footprint would  increase by 465 millimeters. Instead of using a 44.26 volume<br>ratio, the design again fit the largest volume  ratio within the given 95-mm<br>footprint.   The 5.82 volume ratio results in a pressure-volume (P-V) curve as<br>shown in Figure 4. The purple curve is  the ideal P-V curve for the operating<br>pressures required. The compression process starts at the far right of  the<br>curve, when{'source': 'AMS_2018.pdf', 'page': 22}\",3,\"Chunks\"],[\"df49ee64-80f4-4b60-905b-86138bb2eca6\",-1.0905748606,7.4013032913,\"there are two technical limitations of this system:  \\u2022The stacking of only two modules \\u2022The thermal aspect For the stacking, some change in the design can be foreseen to have the possibility to stack an infinity of  modules. The main change will be the output of the wires that shall go out on the external side of the  stator, respectively on the internal side of the rotor.   For the thermal{'source': 'AMS_2018.pdf', 'page': 234}\",\"there are two technical limitations of this system:  \\u2022The stacking of only two<br>modules \\u2022The thermal aspect For the stacking, some change in the design can be<br>foreseen to have the possibility to stack an infinity of  modules. The main<br>change will be the output of the wires that shall go out on the external side of<br>the  stator, respectively on the internal side of the rotor.   For the<br>thermal{'source': 'AMS_2018.pdf', 'page': 234}\",3,\"Chunks\"],[\"e118bd97-8dc0-4b30-8ebb-153770014060\",2.6644687653,6.7399010658,\"284 Steel Motors   The same recovery techniques were applied to motors 7 and 29 with all steel bearing configuration and  which failed at approximately 1 billion rev olution s. They were rested 37 days at ambient and then heat   soaked. Motor 7 reversed direction 5 times and was rested for a total of 227 days w ith no signs of  improvement.  Motor 29 was rested for 37 days then heat soaked{'source': 'AMS_2020.pdf', 'page': 294}\",\"284 Steel Motors   The same recovery techniques were applied to motors 7 and 29<br>with all steel bearing configuration and  which failed at approximately 1<br>billion rev olution s. They were rested 37 days at ambient and then heat<br>soaked. Motor 7 reversed direction 5 times and was rested for a total of 227<br>days w ith no signs of  improvement.  Motor 29 was rested for 37 days then heat<br>soaked{'source': 'AMS_2020.pdf', 'page': 294}\",3,\"Chunks\"],[\"e16d27bc-3134-4f14-a093-ce552655a6e2\",1.8641973734,9.6533966064,\"any return mission.   Air Squared has been working with JPL and NASA on developing flight-ready hardware for MOXIE. Air  Squared\\u2019s contribution to this system is a compressor that compresses CO 2 from 5 torr up to at least 540  torr. The mechanism that feeds the MOXIE experiment with Martian atmosphere comprises an  electronically commutated direct current motor coupled to a \\u201cscroll pack\\u201d gas{'source': 'AMS_2018.pdf', 'page': 19}\",\"any return mission.   Air Squared has been working with JPL and NASA on<br>developing flight-ready hardware for MOXIE. Air  Squared\\u2019s contribution to this<br>system is a compressor that compresses CO 2 from 5 torr up to at least 540<br>torr. The mechanism that feeds the MOXIE experiment with Martian atmosphere<br>comprises an  electronically commutated direct current motor coupled to a<br>\\u201cscroll pack\\u201d gas{'source': 'AMS_2018.pdf', 'page': 19}\",3,\"Chunks\"],[\"f5706f37-32c0-4864-b3d7-52be056bcf9e\",1.2577499151,9.0392332077,\"321   Figure 8. Cross -section view showing bearing mount geometry   Bearing analysis was performed using Orbis [1] . For all load cases, predicted contact stresses were lower  than the applicable operating and non- operating limits per GSFC -STD-7000A for 440C steel bearings (335  ksi (2310 MPa) and 400 ksi  (2760 MPa) , respectively , for non- quiet applications ). Alignment across the{'source': 'AMS_2020.pdf', 'page': 331}\",\"321   Figure 8. Cross -section view showing bearing mount geometry   Bearing<br>analysis was performed using Orbis [1] . For all load cases, predicted contact<br>stresses were lower  than the applicable operating and non- operating limits per<br>GSFC -STD-7000A for 440C steel bearings (335  ksi (2310 MPa) and 400 ksi  (2760<br>MPa) , respectively , for non- quiet applications ). Alignment across<br>the{'source': 'AMS_2020.pdf', 'page': 331}\",3,\"Chunks\"],[\"fdb3240f-3e89-4ded-9570-3e9de2e42dc1\",2.1508264542,7.7642307281,\"maxon brushed motors have significant flight heritage on JPL Mars missions . The Mars Pathfinder  Sojourner rover contained 11 brushed direct current ( DC) motors based on the RE16 d esign  [2]. The Mars  Exploration Rover s (MER ), Spirit and Opportunity , each utilized 39 maxon brushed DC motors, based on  modified commercial \\u201cRE\\u201d series designs. At the end of the Opportunity rover\\u2019s mission ,{'source': 'AMS_2020.pdf', 'page': 421}\",\"maxon brushed motors have significant flight heritage on JPL Mars missions . The<br>Mars Pathfinder  Sojourner rover contained 11 brushed direct current ( DC)<br>motors based on the RE16 d esign  [2]. The Mars  Exploration Rover s (MER ),<br>Spirit and Opportunity , each utilized 39 maxon brushed DC motors, based on<br>modified commercial \\u201cRE\\u201d series designs. At the end of the Opportunity rover\\u2019s<br>mission ,{'source': 'AMS_2020.pdf', 'page': 421}\",3,\"Chunks\"],[\"fdc25183-4538-4da8-93c1-409f776b1f97\",1.3962997198,6.3012094498,\"cycles , and extend the life  of the actuators and the mission itself.{'source': 'AMS_2020.pdf', 'page': 565}\",\"cycles , and extend the life  of the actuators and the mission itself.{'source':<br>'AMS_2020.pdf', 'page': 565}\",3,\"Chunks\"]]}"
}