{
    "umap_params": {
        "a": null,
        "angular_rp_forest": false,
        "b": null,
        "dens_frac": 0.3,
        "dens_lambda": 2.0,
        "dens_var_shift": 0.1,
        "densmap": false,
        "disconnection_distance": null,
        "force_approximation_algorithm": false,
        "init": "spectral",
        "learning_rate": 1.0,
        "local_connectivity": 1.0,
        "low_memory": true,
        "metric": "euclidean",
        "metric_kwds": null,
        "min_dist": 0.1,
        "n_components": 2,
        "n_epochs": null,
        "n_jobs": -1,
        "n_neighbors": 15,
        "negative_sample_rate": 5,
        "output_dens": false,
        "output_metric": "euclidean",
        "output_metric_kwds": null,
        "precomputed_knn": [
            null,
            null,
            null
        ],
        "random_state": null,
        "repulsion_strength": 1.0,
        "set_op_mix_ratio": 1.0,
        "spread": 1.0,
        "target_metric": "categorical",
        "target_metric_kwds": null,
        "target_n_neighbors": -1,
        "target_weight": 0.5,
        "tqdm_kwds": {
            "desc": "Epochs completed",
            "bar_format": "{desc}: {percentage:3.0f}%| {bar} {n_fmt}/{total_fmt} [{elapsed}]",
            "disable": true
        },
        "transform_mode": "embedding",
        "transform_queue_size": 4.0,
        "transform_seed": 42,
        "unique": false,
        "verbose": false
    },
    "viz_data": "{\"columns\":[\"id\",\"x\",\"y\",\"document\",\"document_cleaned\",\"size\",\"category\"],\"index\":[0,1,2,3,4,5,6,7,8,9,10,11,12,13,14,15,16,17,18,19,20,21,22,23,24,25,26,27,28,29,30,31,32,33,34,35,36,37,38,39,40,41,42,43,44,45,46,47,48,49],\"data\":[[\"009bc68e-bd43-11ee-801f-bae7cd9d315f\",4.0592823029,12.4333209991,\"169 Main Functional Requirements \\n\\nThermal Constraints  The operating temperature range from -10\\u00b0C (safety range -30\\u00b0C) up to +40\\u00b0C creates some different friction characteristics. Each lubricated bearing needs a little higher torque under cold conditions.   At begin of the project it was not possible to calculate the friction characteristic for the double row instrument bearing. Equivalent data were not available from the manufacturer. Due to the special construction, quality criteria, preload and specified materials, no similar bearing was usable for a representative friction test at that time.  36 balls in each bearing race, 72 balls in total. 144 wet lubricated single contact points creates a higher friction uncertainty. Torque loss with affects to the functional safety was a critical issue. Agglomeration effects during long time storage were an additional uncertainty. Other bearings in the mechanism and the lubrication inside the planetary gear increase the complex of friction problems. The thermal characteristic influences all parameters. These are well known effects.   On the other hand, the stepper motor, driven by a constant voltage driver, must create enough torque to overcome all static and dynamical friction parameters. The integrated 2-stage planetary gear with a ratio of 49:1 increases the available stepper motor torque.   Friction Torque Separation{'source': 'AMS_2012.pdf', 'page': 183}\",\"169 Main Functional Requirements   Thermal Constraints  The operating<br>temperature range from -10\\u00b0C (safety range -30\\u00b0C) up to +40\\u00b0C creates some<br>different friction characteristics. Each lubricated bearing needs a little<br>higher torque under cold conditions.   At begin of the project it was not<br>possible to calculate the friction characteristic for the double row instrument<br>bearing. Equivalent data were not available from the manufacturer. Due to the<br>special construction, quality criteria, preload and specified materials, no<br>similar bearing was usable for a representative friction test at that time.  36<br>balls in each bearing race, 72 balls in total. 144 wet lubricated single contact<br>points creates a higher friction uncertainty. Torque loss with affects to the<br>functional safety was a critical issue. Agglomeration effects during long time<br>storage were an additional uncertainty. Other bearings in the mechanism and the<br>lubrication inside the planetary gear increase the complex of friction problems.<br>The thermal characteristic influences all parameters. These are well known<br>effects.   On the other hand, the stepper motor, driven by a constant voltage<br>driver, must create enough torque to overcome all static and dynamical friction<br>parameters. The integrated 2-stage planetary gear with a ratio of 49:1 increases<br>the available stepper motor torque.   Friction Torque Separation{'source':<br>'AMS_2012.pdf', 'page': 183}\",3,\"Chunks\"],[\"01492522-bd43-11ee-801f-bae7cd9d315f\",3.4442775249,17.8483295441,\"telepresent on-orbit servicing,\\u201d in Proc. Mechatronics & Robotics 2004, 2004.  [6] C. Preusche, D. Reintsema, K. Landzettel, and G. Hirzinger, \\u201cROKVISS - towards telepresence control in advanced space missions,\\u201d in Proc. 3rd. International Conference on Humanoid Robots (Humanoids 2003), Munich and Karlsruhe, Oct. 2003.  [7] B. Sch\\u00e4fer, K. Landzettel, A. Albu-Sch\\u00a8affer, and G. Hirzinger, \\u201cROKVISS:  Orbital testbed for tele-presence experiments, novel robotic components and dynamics models verification,\\u201d in Proc. 8th ESA Workshop on Advanced Space Technologies for Robotics and Automation (ASTRA), Noordwijk, The Netherlands, Nov. 2-4 2004. [8] K. Landzettel, B. Brunner, R. Lampariello, C. Preusche, D. Reintsema, and G. Hirzinger, \\u201cSystem prerequisites and operational modes for on orbit servicing,\\u201d in Proc. ISTS International Symposium on Space Technology and Science, Miyazaki, Japan, May 30-June 6 2004.  [9] G. Hirzinger, K. Landzettel, and et al., \\u201cROKVISS robotics component verification on ISS,\\u201d in Proc. of \\u2019the 8th Int. Symposium on Artificial Intelligence, Robotics and Automation in Space - iSAIRAS, Munich, Germany, 2005.  [10] A. Albu-Sch\\u00e4ffer, W. Bertleff, B. Rebele, B. Sch\\u00e4fer, K. Landzettel, and G. Hirzinger, \\u201cRokviss - robotics component verification on ISS{'source': 'AMS_2012.pdf', 'page': 251}\",\"telepresent on-orbit servicing,\\u201d in Proc. Mechatronics & Robotics 2004, 2004.<br>[6] C. Preusche, D. Reintsema, K. Landzettel, and G. Hirzinger, \\u201cROKVISS -<br>towards telepresence control in advanced space missions,\\u201d in Proc. 3rd.<br>International Conference on Humanoid Robots (Humanoids 2003), Munich and<br>Karlsruhe, Oct. 2003.  [7] B. Sch\\u00e4fer, K. Landzettel, A. Albu-Sch\\u00a8affer, and G.<br>Hirzinger, \\u201cROKVISS:  Orbital testbed for tele-presence experiments, novel<br>robotic components and dynamics models verification,\\u201d in Proc. 8th ESA Workshop<br>on Advanced Space Technologies for Robotics and Automation (ASTRA), Noordwijk,<br>The Netherlands, Nov. 2-4 2004. [8] K. Landzettel, B. Brunner, R. Lampariello,<br>C. Preusche, D. Reintsema, and G. Hirzinger, \\u201cSystem prerequisites and<br>operational modes for on orbit servicing,\\u201d in Proc. ISTS International Symposium<br>on Space Technology and Science, Miyazaki, Japan, May 30-June 6 2004.  [9] G.<br>Hirzinger, K. Landzettel, and et al., \\u201cROKVISS robotics component verification<br>on ISS,\\u201d in Proc. of \\u2019the 8th Int. Symposium on Artificial Intelligence,<br>Robotics and Automation in Space - iSAIRAS, Munich, Germany, 2005.  [10] A.<br>Albu-Sch\\u00e4ffer, W. Bertleff, B. Rebele, B. Sch\\u00e4fer, K. Landzettel, and G.<br>Hirzinger, \\u201cRokviss - robotics component verification on ISS{'source':<br>'AMS_2012.pdf', 'page': 251}\",3,\"Chunks\"],[\"0210354a-bd43-11ee-801f-bae7cd9d315f\",6.1354594231,16.0983982086,\"314 h) As the test cell bottoms out into the injector needle, the needle pushes the bottom plunger  valve open  i) While the test cell is bottomed out in the injector station, a solvent is selected on the multiport  valve and then pumped into the sample cell  j) The capping arm is retracted and a spring housed under the sample cell pushes it back to its  neutral position; an O-ring keeps a seal with the needle, preventing any leaks as the plunger  valve closes  k) The sample cell is now driven to the heater station where it makes contact with electrical  terminals to provide power to the cell\\u2019s heater; temperature is monitored by an infrared thermistor  l) Once temperature and dwell time is achieved, the sample is positioned back under the  capping station and allowed to partially cool down  m) After cooling the sample (to lower internal pressures), the capping arm is actuated and the  sample cell driven into the needle of the injector assembly  n) A delivery port is selected and a fluid pump actuated to extract the solute form the sample  cell  o) After the solute is delivered, another port is selected to rinse the tubing and inject the  cleaning residue into the emptied cell.  p) After cleaning the solvent pluming, the capping arm retracts and the sample cell goes back to  its neutral position and the mechanism is ready to process another sample \\n\\nFigure 3.  WASP Components \\u2013 Mechanical Components{'source': 'AMS_2012.pdf', 'page': 328}\",\"314 h) As the test cell bottoms out into the injector needle, the needle pushes<br>the bottom plunger  valve open  i) While the test cell is bottomed out in the<br>injector station, a solvent is selected on the multiport  valve and then pumped<br>into the sample cell  j) The capping arm is retracted and a spring housed under<br>the sample cell pushes it back to its  neutral position; an O-ring keeps a seal<br>with the needle, preventing any leaks as the plunger  valve closes  k) The<br>sample cell is now driven to the heater station where it makes contact with<br>electrical  terminals to provide power to the cell\\u2019s heater; temperature is<br>monitored by an infrared thermistor  l) Once temperature and dwell time is<br>achieved, the sample is positioned back under the  capping station and allowed<br>to partially cool down  m) After cooling the sample (to lower internal<br>pressures), the capping arm is actuated and the  sample cell driven into the<br>needle of the injector assembly  n) A delivery port is selected and a fluid pump<br>actuated to extract the solute form the sample  cell  o) After the solute is<br>delivered, another port is selected to rinse the tubing and inject the  cleaning<br>residue into the emptied cell.  p) After cleaning the solvent pluming, the<br>capping arm retracts and the sample cell goes back to  its neutral position and<br>the mechanism is ready to process another sample   Figure 3.  WASP Components \\u2013<br>Mechanical Components{'source': 'AMS_2012.pdf', 'page': 328}\",3,\"Chunks\"],[\"092a9ab4-bd43-11ee-801f-bae7cd9d315f\",6.2370939255,14.8705692291,\"depe nded  on the d evelopment of th e rocker-b ridge latch). T he corre sponding li near stroke  requi rement gre w to about  244 mm (in cluding 2 1 mm margi n). \\n\\nAt this point, the front ro ckers a nd whe els rotate  through thei r own depl oyme nt range of a pproxim ately  180\\u00b0. T his is accompli shed throu gh a series of mo tions shared between the wh eel-stee ring a ctuators and  the ro cker deployment a ctuators. Thi s sequence is detaile d in the paper e ntitled \\u201c The chall enge s of  designing th e rocke r-bogie suspension for the Ma rs Exploration Rover\\u201d. \\n\\n3. Upon reve rsing, allo w the l oose pivot joi nt in re quirem ent (2 ) to latch up at  a fixed angl e. Co ntinue   lowering the  rove r with out interruptio n, wh ile accomm odatin g the fund amentally different  kinem atic rel ationship s of the system. \\n\\nStan dup Part 1 & 2 Raise to HardstopLift Rover Deploy Rockers LowerSol #5 Retract Release Rear Wheels Deploy Bogies Sol #6-7Standup part 3 & 4\\n\\nFigure 2.  Sequenc e of Rov er standup ev ents  198{'source': 'AMS_2004.pdf', 'page': 212}\",\"depe nded  on the d evelopment of th e rocker-b ridge latch). T he corre<br>sponding li near stroke  requi rement gre w to about  244 mm (in cluding 2 1 mm<br>margi n).   At this point, the front ro ckers a nd whe els rotate  through thei<br>r own depl oyme nt range of a pproxim ately  180\\u00b0. T his is accompli shed throu<br>gh a series of mo tions shared between the wh eel-stee ring a ctuators and  the<br>ro cker deployment a ctuators. Thi s sequence is detaile d in the paper e<br>ntitled \\u201c The chall enge s of  designing th e rocke r-bogie suspension for the<br>Ma rs Exploration Rover\\u201d.   3. Upon reve rsing, allo w the l oose pivot joi nt<br>in re quirem ent (2 ) to latch up at  a fixed angl e. Co ntinue   lowering the<br>rove r with out interruptio n, wh ile accomm odatin g the fund amentally<br>different  kinem atic rel ationship s of the system.   Stan dup Part 1 & 2 Raise<br>to HardstopLift Rover Deploy Rockers LowerSol #5 Retract Release Rear Wheels<br>Deploy Bogies Sol #6-7Standup part 3 & 4  Figure 2.  Sequenc e of Rov er standup<br>ev ents  198{'source': 'AMS_2004.pdf', 'page': 212}\",3,\"Chunks\"],[\"092a9ef6-bd43-11ee-801f-bae7cd9d315f\",5.6835484505,12.6862602234,\"012345678910 -1 01 23 Drop Out Voltage, voltsSpring Force, N0.051-mm shim  0.102-mm shim thickness  (2x 0.051-mm shim)  4 \\n\\nFigure 8.  Test data from a spare brake assembly  characterizes the v ariation of drop-out v oltage  with spring force for tw o different shim thicknesses.  \\n\\n05101520253035 01 2 3 4 56 Drop Out Voltage, voltsMagnetic Force, Ny = 0.5758x2 + 2.3089x + 3.8126 R2 = 0.9772, 0.051 mm shim y = 0.1194x2 + 1.3262x + 3.7245 R2 = 0.9897, 0.102 mm shim 0.051 mm shim  0.102 mm shim thickness  (2x 0.051 mm shim) 3.711.95 \\n\\nFigure 9.  Regression curv es from test data are appropriately  shifted and used to determine the  drop-out v oltage required for a minimum 2.0 factor of safety .  \\n\\n229{'source': 'AMS_2004.pdf', 'page': 243}\",\"012345678910 -1 01 23 Drop Out Voltage, voltsSpring Force, N0.051-mm shim<br>0.102-mm shim thickness  (2x 0.051-mm shim)  4   Figure 8.  Test data from a<br>spare brake assembly  characterizes the v ariation of drop-out v oltage  with<br>spring force for tw o different shim thicknesses.    05101520253035 01 2 3 4 56<br>Drop Out Voltage, voltsMagnetic Force, Ny = 0.5758x2 + 2.3089x + 3.8126 R2 =<br>0.9772, 0.051 mm shim y = 0.1194x2 + 1.3262x + 3.7245 R2 = 0.9897, 0.102 mm shim<br>0.051 mm shim  0.102 mm shim thickness  (2x 0.051 mm shim) 3.711.95   Figure 9.<br>Regression curv es from test data are appropriately  shifted and used to<br>determine the  drop-out v oltage required for a minimum 2.0 factor of safety .<br>229{'source': 'AMS_2004.pdf', 'page': 243}\",3,\"Chunks\"],[\"0a6ab620-bd43-11ee-801f-bae7cd9d315f\",1.3306574821,15.6913394928,\"probl ems making up 23%. While th e miscell aneous category makes up a sig nificant numb er of  anomali es, there did n ot appea r to be a ny recu rring theme s althou gh ea ch on e rep resents a probl em that  had to be worked with the impleme ntation of a corre ctive action an d recu rrence control. \\n\\nPRACA Brea kdow n by Type Test 4% Fasteners 9%STE 4%Panel Retention 2% Environment\\/Proced ure 8%Manufacturing 15%Design 17%Tolerancing 18%Misc. 23%\\n\\nFigure 3.  Problem Repor ting Bre akdo wn  293{'source': 'AMS_2004.pdf', 'page': 307}\",\"probl ems making up 23%. While th e miscell aneous category makes up a sig<br>nificant numb er of  anomali es, there did n ot appea r to be a ny recu rring<br>theme s althou gh ea ch on e rep resents a probl em that  had to be worked with<br>the impleme ntation of a corre ctive action an d recu rrence control.   PRACA<br>Brea kdow n by Type Test 4% Fasteners 9%STE 4%Panel Retention 2%<br>Environment\\/Proced ure 8%Manufacturing 15%Design 17%Tolerancing 18%Misc. 23%<br>Figure 3.  Problem Repor ting Bre akdo wn  293{'source': 'AMS_2004.pdf', 'page':<br>307}\",3,\"Chunks\"],[\"0a6ab698-bd43-11ee-801f-bae7cd9d315f\",6.562458992,14.7369213104,\"easily repla ceable fa stener lo cking fe ature s and avoided this t ype of probl em. Another cau se of a  signifi cant n umber of failures was the  lack of p roper lubrication  of the fast ener or insert. Careful attention{'source': 'AMS_2004.pdf', 'page': 309}\",\"easily repla ceable fa stener lo cking fe ature s and avoided this t ype of<br>probl em. Another cau se of a  signifi cant n umber of failures was the  lack of<br>p roper lubrication  of the fast ener or insert. Careful attention{'source':<br>'AMS_2004.pdf', 'page': 309}\",3,\"Chunks\"],[\"0e7805f6-bd43-11ee-801f-bae7cd9d315f\",3.4858064651,17.8857936859,\"71 Acknowledgements \\n\\nThe author acknowledges Mr . Mark J. Jansen (Spiralab\\/ University of Toledo, OH ), Mr. William R. Jones,  Jr. (Spiralab\\/NASA Glenn Research  Center, OH) and Mr. Stephen V.  Pepper (Spiralab\\/NASA Glenn  Research Center, OH) for their cont inued guidance, knowledge and advice.   The author also acknowledges Mrs. Helen Hunter, Mr. Ian Pleavin, and Mr. Alan Swift (National Center of  Tribology\\/ESR Technology) for their help in the preparation of test samples.  The work described was performed under contract for the European Space Agency   References \\n\\n1. Anderson, M. J., \\u2018 Review and Identification of European Space-Compatible Oils \\u2019, ESA-ESTL-TM0021 (2005)  2. Cropper, M. & Anderson, M. J., \\u2018 An Assessment of an Ultra-low Vapor Pressure Oil (Fomblin Z60) \\u2019,  ESA-ESTL-TM-0043 01- (2007)  3. Sicre, J., et al. \\u2018 Perpetuation of MAPLUB Grease Range \\u2019, Proc. 13 th ESMATS Symp. SP-670 (2009)  4. Jones, W. R., et al. \\u2018 A New Apparatus to Evaluate Lubricants for Space Applications \\u2013 The Spiral  Orbit Tribometer (SOT) \\u2019, NASA\\/TM-2000- 209935 (2000)  5. Price, W. B. & Cunningham, J. M., \\u2018 Boundary Lubricant Tester: Pr e-Failure Degradation of  Lubricants \\u2019, ESTL-TM-146 (1994){'source': 'AMS_2010.pdf', 'page': 87}\",\"71 Acknowledgements   The author acknowledges Mr . Mark J. Jansen (Spiralab\\/<br>University of Toledo, OH ), Mr. William R. Jones,  Jr. (Spiralab\\/NASA Glenn<br>Research  Center, OH) and Mr. Stephen V.  Pepper (Spiralab\\/NASA Glenn  Research<br>Center, OH) for their cont inued guidance, knowledge and advice.   The author<br>also acknowledges Mrs. Helen Hunter, Mr. Ian Pleavin, and Mr. Alan Swift<br>(National Center of  Tribology\\/ESR Technology) for their help in the preparation<br>of test samples.  The work described was performed under contract for the<br>European Space Agency   References   1. Anderson, M. J., \\u2018 Review and<br>Identification of European Space-Compatible Oils \\u2019, ESA-ESTL-TM0021 (2005)  2.<br>Cropper, M. & Anderson, M. J., \\u2018 An Assessment of an Ultra-low Vapor Pressure<br>Oil (Fomblin Z60) \\u2019,  ESA-ESTL-TM-0043 01- (2007)  3. Sicre, J., et al. \\u2018<br>Perpetuation of MAPLUB Grease Range \\u2019, Proc. 13 th ESMATS Symp. SP-670 (2009)<br>4. Jones, W. R., et al. \\u2018 A New Apparatus to Evaluate Lubricants for Space<br>Applications \\u2013 The Spiral  Orbit Tribometer (SOT) \\u2019, NASA\\/TM-2000- 209935 (2000)<br>5. Price, W. B. & Cunningham, J. M., \\u2018 Boundary Lubricant Tester: Pr e-Failure<br>Degradation of  Lubricants \\u2019, ESTL-TM-146 (1994){'source': 'AMS_2010.pdf',<br>'page': 87}\",3,\"Chunks\"],[\"157a4832-bd43-11ee-801f-bae7cd9d315f\",2.5708246231,13.757437706,\"\\/g86\\/g83\\/g85\\/g76\\/g81\\/g74\\/g3\\/g73\\/g88\\/g81\\/g70\\/g87\\/g76\\/g82\\/g81\\/g3\\/g68\\/g83\\/g83\\/g79\\/g76\\/g72\\/g71\\/g3\\/g87\\/g82\\/g3\\/g87\\/g75\\/g72\\/g3\\/g72\\/g79\\/g69\\/g82\\/g90\\/g3\\/g75\\/g76\\/g81\\/g74\\/g72\\/g3\\/g87\\/g75\\/g68\\/g87\\/g3\\/g90\\/g68\\/g86\\/g3\\/g87\\/g75\\/g72\\/g3\\/g507\\/g3\\/g73\\/g88\\/g81\\/g70\\/g87\\/g76\\/g82\\/g81\\/g3\\/g83\\/g85\\/g72\\/g89\\/g76\\/g82\\/g88\\/g86\\/g79\\/g92\\/g3\\/g71\\/g76\\/g86\\/g70\\/g88\\/g86\\/g86\\/g72\\/g71\\/g17\\/g3\\/g36\\/g3\\/g83\\/g82\\/g86\\/g76\\/g87\\/g76\\/g89\\/g72\\/g3\\/g507\\/g3indicates the elbow is leading the shoulder and an internal resistive torque would be applied to the{'source': 'AMS_2014.pdf', 'page': 67}\",\"\\/g86\\/g83\\/g85\\/g76\\/g81\\/g74\\/g3\\/g73\\/g88\\/g81\\/g70\\/g87\\/g76\\/g82\\/g81\\/g3\\/g68\\/g83\\/g83\\/g79\\/g<br>76\\/g72\\/g71\\/g3\\/g87\\/g82\\/g3\\/g87\\/g75\\/g72\\/g3\\/g72\\/g79\\/g69\\/g82\\/g90\\/g3\\/g75\\/g76\\/g81\\/g74\\/g<br>72\\/g3\\/g87\\/g75\\/g68\\/g87\\/g3\\/g90\\/g68\\/g86\\/g3\\/g87\\/g75\\/g72\\/g3\\/g507\\/g3\\/g73\\/g88\\/g81\\/g70\\/g<br>87\\/g76\\/g82\\/g81\\/g3\\/g83\\/g85\\/g72\\/g89\\/g76\\/g82\\/g88\\/g86\\/g79\\/g92\\/g3\\/g71\\/g76\\/g86\\/g70\\/g88<br>\\/g86\\/g86\\/g72\\/g71\\/g17\\/g3\\/g36\\/g3\\/g83\\/g82\\/g86\\/g76\\/g87\\/g76\\/g89\\/g72\\/g3\\/g507\\/g3indicat<br>es the elbow is leading the shoulder and an internal resistive torque would be<br>applied to the{'source': 'AMS_2014.pdf', 'page': 67}\",3,\"Chunks\"],[\"157a4a30-bd43-11ee-801f-bae7cd9d315f\",4.6841225624,12.2855978012,\"In order to verify the findings, the available EM Scan Drive Equipment was submitted to a TV test  campaign with the goal to apply realistic gradients as seen in orbit to the system and to prove the influence of such gradients to the motor current and control performance. In this test, the baseplate (S\\/C I\\/F simulator) was cooled by means of cooling loops to the required low  temperature, while the mechanism rotor was controlled to the Instrument I\\/F temperature (Figure 14). At the start of the test, the mechanism rotor I\\/F was heated to the orbit I\\/F temperature, while the S\\/C I\\/F temperature was at ambient. During continuous rotation of the mechanism, the S\\/C I\\/F temperature was decreased while maintaining the rotor I\\/F at the warm level. During the test, the rotation rate stability was also measured.  Figure 14. TV Test Setup for Gradient Test A test result overview is depicted in Figure 15. One can clearly see the influence of the thermal gradients  acting between the warm mechanism rotor and the cold S\\/C I\\/F flange on the motor current. According to Figure 16, we can also confirm the influence of the thermal gradients to the scan rate  stability. If the motor current rises due to thermal gradients in the system, the control performance of the  scan rate decreases. The effect can be explained by the fact that the SDM housing as flown on FY3B was manufactured from  aluminium whereas the rotor shaft was manufactured from steel. Therefore the gradient between rotor and stator leads to a decrease in diameter of the outer rings of the thin ring bearings, while the inner ring  stays stable. In addition, the deflection of the mechanism housing due to the lateral gradient over the  SDM mounting I\\/F, as shown by the finite element model, will influence the bearing configuration.{'source': 'AMS_2014.pdf', 'page': 84}\",\"In order to verify the findings, the available EM Scan Drive Equipment was<br>submitted to a TV test  campaign with the goal to apply realistic gradients as<br>seen in orbit to the system and to prove the influence of such gradients to the<br>motor current and control performance. In this test, the baseplate (S\\/C I\\/F<br>simulator) was cooled by means of cooling loops to the required low<br>temperature, while the mechanism rotor was controlled to the Instrument I\\/F<br>temperature (Figure 14). At the start of the test, the mechanism rotor I\\/F was<br>heated to the orbit I\\/F temperature, while the S\\/C I\\/F temperature was at<br>ambient. During continuous rotation of the mechanism, the S\\/C I\\/F temperature<br>was decreased while maintaining the rotor I\\/F at the warm level. During the<br>test, the rotation rate stability was also measured.  Figure 14. TV Test Setup<br>for Gradient Test A test result overview is depicted in Figure 15. One can<br>clearly see the influence of the thermal gradients  acting between the warm<br>mechanism rotor and the cold S\\/C I\\/F flange on the motor current. According to<br>Figure 16, we can also confirm the influence of the thermal gradients to the<br>scan rate  stability. If the motor current rises due to thermal gradients in the<br>system, the control performance of the  scan rate decreases. The effect can be<br>explained by the fact that the SDM housing as flown on FY3B was manufactured<br>from  aluminium whereas the rotor shaft was manufactured from steel. Therefore<br>the gradient between rotor and stator leads to a decrease in diameter of the<br>outer rings of the thin ring bearings, while the inner ring  stays stable. In<br>addition, the deflection of the mechanism housing due to the lateral gradient<br>over the  SDM mounting I\\/F, as shown by the finite element model, will influence<br>the bearing configuration.{'source': 'AMS_2014.pdf', 'page': 84}\",3,\"Chunks\"],[\"16394ce6-bd43-11ee-801f-bae7cd9d315f\",3.3281419277,12.7820005417,\"Observations of Spacecraft Bearing Lubr icant Redistribution Based on Thermal  Conductance Measurements Yoshimi R. Takeuchi*, Peter P. Frantz**and Michael R. Hilton*  Abstract The performance and life of precision ball bearings are critically dependent on maintaining a quantity of  oil at the ball\\/race interface that is sufficient to support a robust protective film. In space applications,  where parched conditions are intentionally the norm, harsh operating conditions can displace the small reserves of oil, resulting in reduced film thickness and premature wear. In the past, these effects have proven difficult to model or to measure experimentally. This paper describes a study addressing this  challenge, where bearing thermal conductance measurements are employed to infer changes in lubricant  quantity at the critical rolling interfaces. In the first part of the paper, we explain how the lubricant\\u2019s presence and its quantity impacts bearing  thermal conductance measurements. For a stationary bearing, we show that conductance is directly  related to the lubricant quantity in the ball\\/race contacts. Hence, aspects of bearing performance related  to oil quantity can be understood and insights improved with thermal conductance data. For a moving  bearing, a different mechanism of heat transfer dominates and is dependent on lubricant film thickness on the ball.  In the second part of the report, we discuss lubricant quantity observations based on bearing thermal  conductance measurements. Lubricant quantity, and thus bearing thermal conductance, depends on  various initial and operating conditions and is impacted further by the run-in process. A significant effect  of maximum run-in speed was also observed, with less oil remaining after obtaining higher speeds.{'source': 'AMS_2014.pdf', 'page': 129}\",\"Observations of Spacecraft Bearing Lubr icant Redistribution Based on Thermal<br>Conductance Measurements Yoshimi R. Takeuchi*, Peter P. Frantz**and Michael R.<br>Hilton*  Abstract The performance and life of precision ball bearings are<br>critically dependent on maintaining a quantity of  oil at the ball\\/race<br>interface that is sufficient to support a robust protective film. In space<br>applications,  where parched conditions are intentionally the norm, harsh<br>operating conditions can displace the small reserves of oil, resulting in<br>reduced film thickness and premature wear. In the past, these effects have<br>proven difficult to model or to measure experimentally. This paper describes a<br>study addressing this  challenge, where bearing thermal conductance measurements<br>are employed to infer changes in lubricant  quantity at the critical rolling<br>interfaces. In the first part of the paper, we explain how the lubricant\\u2019s<br>presence and its quantity impacts bearing  thermal conductance measurements. For<br>a stationary bearing, we show that conductance is directly  related to the<br>lubricant quantity in the ball\\/race contacts. Hence, aspects of bearing<br>performance related  to oil quantity can be understood and insights improved<br>with thermal conductance data. For a moving  bearing, a different mechanism of<br>heat transfer dominates and is dependent on lubricant film thickness on the<br>ball.  In the second part of the report, we discuss lubricant quantity<br>observations based on bearing thermal  conductance measurements. Lubricant<br>quantity, and thus bearing thermal conductance, depends on  various initial and<br>operating conditions and is impacted further by the run-in process. A<br>significant effect  of maximum run-in speed was also observed, with less oil<br>remaining after obtaining higher speeds.{'source': 'AMS_2014.pdf', 'page': 129}\",3,\"Chunks\"],[\"18fa2ebe-bd43-11ee-801f-bae7cd9d315f\",1.9223222733,14.2749872208,\"\\/g2033\\/g2870sin \\/g2016 \\/g3014 (9) \\/g3533\\/g1865 \\/g3036\\/g1877\\/g3036\\/g4672\\/g1878\\/g3036+\\/g1859 \\/g2033\\/g2870\\/g4673\\/g3041 \\/g3036\\/g2880\\/g2869=\\/g1839\\/g3045 \\/g2033\\/g2870cos \\/g2016 \\/g3014 (10) Because the locations of the balancing masses are known, we have a system of four linear equilibrium  Equations (7-10) to \\/g81unknown mass values  \\/g1865\\/g3036 ,\\/g1861 = 1 \\u2026 \\/g1866 . For the case of GMI, we have \\/g81\\/g3= 21. There is  no unique solution to this over-determined problem. However, an optimal unique solution may be found  by writing a linear programming problem in which we minimize the sum of the balance masses while meeting the static and dynamic balance equality constraints (7-10) and introducing inequality constraints on the balance masses that take into account the feasibility of actual mass placement with respect to size\\/mass constraints of the balance mass for a given location and the positive nature of the balance  masses. The objective function to be minimized is expressed as \\/g2030(\\/g2195)=\\/g3533\\/g2009 \\/g3036\\/g1865\\/g3036\\/g3041 \\/g3036\\/g2880\\/g2869=\\/g2235\\/g2176\\/g2195 (11)  And the optimization problem is written formally as  min{'source': 'AMS_2014.pdf', 'page': 324}\",\"\\/g2033\\/g2870sin \\/g2016 \\/g3014 (9) \\/g3533\\/g1865<br>\\/g3036\\/g1877\\/g3036\\/g4672\\/g1878\\/g3036+\\/g1859 \\/g2033\\/g2870\\/g4673\\/g3041<br>\\/g3036\\/g2880\\/g2869=\\/g1839\\/g3045 \\/g2033\\/g2870cos \\/g2016 \\/g3014 (10) Because the<br>locations of the balancing masses are known, we have a system of four linear<br>equilibrium  Equations (7-10) to \\/g81unknown mass values  \\/g1865\\/g3036 ,\\/g1861 =<br>1 \\u2026 \\/g1866 . For the case of GMI, we have \\/g81\\/g3= 21. There is  no unique<br>solution to this over-determined problem. However, an optimal unique solution<br>may be found  by writing a linear programming problem in which we minimize the<br>sum of the balance masses while meeting the static and dynamic balance equality<br>constraints (7-10) and introducing inequality constraints on the balance masses<br>that take into account the feasibility of actual mass placement with respect to<br>size\\/mass constraints of the balance mass for a given location and the positive<br>nature of the balance  masses. The objective function to be minimized is<br>expressed as \\/g2030(\\/g2195)=\\/g3533\\/g2009 \\/g3036\\/g1865\\/g3036\\/g3041<br>\\/g3036\\/g2880\\/g2869=\\/g2235\\/g2176\\/g2195 (11)  And the optimization problem is<br>written formally as  min{'source': 'AMS_2014.pdf', 'page': 324}\",3,\"Chunks\"],[\"1a56d3ac-bd43-11ee-801f-bae7cd9d315f\",1.5313169956,15.2813205719,\"\\/g51\\/g88\\/g85\\/g83\\/g82\\/g86\\/g72\\/g3\\/g38\\/g85\\/g72\\/g90\\/g3\\/g57\\/g72\\/g75\\/g76\\/g70\\/g79\\/g72\\/g3\\/g11\\/g48\\/g51\\/g38\\/g57\\/g12\\/g3\\/g38\\/g85\\/g72\\/g90\\/g3\\/g48\\/g82\\/g71\\/g88\\/g79\\/g72\\/g3\\/g11\\/g38\\/g48\\/g12\\/g3\\/g177\\/g3\\/g54\\/g72\\/g85\\/g89\\/g76\\/g70\\/g72\\/g3\\/g48\\/g82\\/g71\\/g88\\/g79\\/g72\\/g3\\/g11\\/g54\\/g48\\/g12\\/g3\\/g56\\/g80\\/g69\\/g76\\/g79\\/g76\\/g70\\/g68\\/g79\\/g3\\/g54\\/g83\\/g85\\/g76\\/g81\\/g74\\/g3\\/g54\\/g87\\/g85\\/g88\\/g87\\/g3\\/g55\\/g72\\/g86\\/g87\\/g76\\/g81\\/g74 . Doc. no. 11-00747. November 14, 2013{'source': 'AMS_2014.pdf', 'page': 420}\",\"\\/g51\\/g88\\/g85\\/g83\\/g82\\/g86\\/g72\\/g3\\/g38\\/g85\\/g72\\/g90\\/g3\\/g57\\/g72\\/g75\\/g76\\/g70\\/g79\\/g72\\/g<br>3\\/g11\\/g48\\/g51\\/g38\\/g57\\/g12\\/g3\\/g38\\/g85\\/g72\\/g90\\/g3\\/g48\\/g82\\/g71\\/g88\\/g79\\/g72\\/g3\\/g11\\/g<br>38\\/g48\\/g12\\/g3\\/g177\\/g3\\/g54\\/g72\\/g85\\/g89\\/g76\\/g70\\/g72\\/g3\\/g48\\/g82\\/g71\\/g88\\/g79\\/g72\\/g3\\/<br>g11\\/g54\\/g48\\/g12\\/g3\\/g56\\/g80\\/g69\\/g76\\/g79\\/g76\\/g70\\/g68\\/g79\\/g3\\/g54\\/g83\\/g85\\/g76\\/g81\\/g7<br>4\\/g3\\/g54\\/g87\\/g85\\/g88\\/g87\\/g3\\/g55\\/g72\\/g86\\/g87\\/g76\\/g81\\/g74 . Doc. no. 11-00747.<br>November 14, 2013{'source': 'AMS_2014.pdf', 'page': 420}\",3,\"Chunks\"],[\"1c848a16-bd43-11ee-801f-bae7cd9d315f\",2.9927959442,17.8486156464,\"CONTENTS Symposium Schedule ..................................................................................................................... viii Symposium Organizing andAdvisory Committees ............................................................................. xii ALowPowerCryogenic Shutter Mechanism forUseinInfrared Imagers ................................................ 1 ScottSchwinger &ClaefHakun ACISDoorFailureInvestigation andMitigation Procedures ................................................................. 15 William Podgorski, NeilTice&PaulPlucinsky Designing Spacecraft Mechanisms forSand,Dust,WaterandFrost................................................... 29 KurtLankford Low-Cost Ejection Mechanism forProtective CoversonMeteosat Second Generation .......................... 39 JavierOrtega, Fernando Quintana &Gabriel Ybarra Misconceptions inMechanism Reliability .......................................................................................... 51 WalterHolemans &DonaldGibbons Lessons Learned fromtheManufacturing andTestoftheInternational SpaceStation DriveLockAssembly ...................................................................................................................... 61 CurtisAIImon Development ofanAutomated BoltDriverfortheSpaceStationTrussAssembly .................................. 75 Richard Meinhold &KenSeidner DesignofaPower-Assisted Spacesuit GloveActuator ....................................................................... 89 Russell Howard EnergyAbsorber fortheInternational SpaceStation........................................................................ 103 BobWilkes&LoraLaurence Friction DriveCharacteristics fortheSpaceStationMobileTransporter ............................................. 117 Richard Hughes, DanielHoyt&JuanCarreras Development ofaCryogenic Nanometer-Class Repeatability LinearActuator ...................................... 131 RubenNalbandian &AlsonHatheway Application ofMagnetic SmartMaterials toAerospace MotionControl............................................... 137 ChadJoshi&BruceBent ASeparation System Solution fortheInterimControl Module ........................................................... 143 BrianWhalen{'source': 'AMS_2000.pdf', 'page': 7}\",\"CONTENTS Symposium Schedule ....................................................<br>................................................................. viii Symposium<br>Organizing andAdvisory Committees<br>.............................................................................<br>xii ALowPowerCryogenic Shutter Mechanism forUseinInfrared Imagers<br>................................................ 1 ScottSchwinger &ClaefHakun<br>ACISDoorFailureInvestigation andMitigation Procedures<br>................................................................. 15 William<br>Podgorski, NeilTice&PaulPlucinsky Designing Spacecraft Mechanisms<br>forSand,Dust,WaterandFrost................................................... 29<br>KurtLankford Low-Cost Ejection Mechanism forProtective CoversonMeteosat Second<br>Generation .......................... 39 JavierOrtega, Fernando Quintana<br>&Gabriel Ybarra Misconceptions inMechanism Reliability .........................<br>................................................................. 51<br>WalterHolemans &DonaldGibbons Lessons Learned fromtheManufacturing<br>andTestoftheInternational SpaceStation DriveLockAssembly .......................<br>................................................................................<br>............... 61 CurtisAIImon Development ofanAutomated<br>BoltDriverfortheSpaceStationTrussAssembly .................................. 75<br>Richard Meinhold &KenSeidner DesignofaPower-Assisted Spacesuit GloveActuator<br>....................................................................... 89<br>Russell Howard EnergyAbsorber fortheInternational SpaceStation..................<br>...................................................... 103<br>BobWilkes&LoraLaurence Friction DriveCharacteristics<br>fortheSpaceStationMobileTransporter<br>............................................. 117 Richard Hughes,<br>DanielHoyt&JuanCarreras Development ofaCryogenic Nanometer-Class Repeatability<br>LinearActuator ...................................... 131 RubenNalbandian<br>&AlsonHatheway Application ofMagnetic SmartMaterials toAerospace<br>MotionControl............................................... 137<br>ChadJoshi&BruceBent ASeparation System Solution fortheInterimControl Module<br>........................................................... 143<br>BrianWhalen{'source': 'AMS_2000.pdf', 'page': 7}\",3,\"Chunks\"],[\"1e43201a-bd43-11ee-801f-bae7cd9d315f\",5.0969424248,16.9299678802,\"Themostimportant testsperformed duringthequaliication stageofthemechanisms were: \\u2022Environmental tests:testingthevibration, thermal andacoustic environments. \\u2022Functional tests:themostremarkable testwasthejettisoning testwherethejettisoning speedwas measured andtheabilitytorelease thecoverswithout interference wasproved. Another functional testprovedtightness ofthecoverandthesealing system tobeadequate. 49{'source': 'AMS_2000.pdf', 'page': 63}\",\"Themostimportant testsperformed duringthequaliication stageofthemechanisms were:<br>\\u2022Environmental tests:testingthevibration, thermal andacoustic environments.<br>\\u2022Functional tests:themostremarkable testwasthejettisoning<br>testwherethejettisoning speedwas measured andtheabilitytorelease<br>thecoverswithout interference wasproved. Another functional testprovedtightness<br>ofthecoverandthesealing system tobeadequate. 49{'source': 'AMS_2000.pdf',<br>'page': 63}\",3,\"Chunks\"],[\"2037ca92-bd43-11ee-801f-bae7cd9d315f\",4.0893874168,17.6436195374,\"Acknowledgements Theauthorwishestorecognize theoutstanding technical effortsofMr.HughMcMenamin, LMSSC, under theverycapable management ofMr.RobertLeRoy. AlsoatLMSSC, Mr.NealShepard contributed his expertise acrosstheboardandlefttheauthorinaweofhisabilitytocutthrough thenoiseandchurnout newknowledge onasteadybasis.Finally, forhisabilitytoanalyze asituation andquicklygettotheroot ofanymechanical problem hewaspresented with,theauthorgratefully acknowledges thetalentsofMr. Charles TelekiofSwales Aerospace. Thesuccess ofthesolararrayon-orbit speaks tothevalueadded bythemembers oftheentireteamoftechnical managers, engineers, andtechnicians whobrought the flightqualification ofthearraytoasuccessful conclusion. References (Allreferences areavailablefromtheEOSLibraryatGSFC,(301)286-5641, orfromtheauthor.) \\\"Critical Design Review Package forElectrical PowerSubsystem, SolarArrayAssembly\\\" CDRL-A059, 5 May1995.(EOSLibrary# 6200) \\\"FirstSolarArrayManual Deployment\\\", LMMS PIRU-S\\/C-L7-1195-SYS RevA,NealShepard, 2 February 1998.(EOSLibrary# 9482) \\\"Design andDevelopment ofanImproved Landsat 7SolarArrayRetention System\\\", LMMSPIRU-S\\/CL7-1340-SYS, NealShepard andHughMcMenamin, 24March1999.(EOSLibrary# 11421) \\\"Landsat 7Failure Modes andEffectsAnalysis -SolarArrayPanelDeployment System (PDS)\\\", LMMS{'source': 'AMS_2000.pdf', 'page': 237}\",\"Acknowledgements Theauthorwishestorecognize theoutstanding technical<br>effortsofMr.HughMcMenamin, LMSSC, under theverycapable management<br>ofMr.RobertLeRoy. AlsoatLMSSC, Mr.NealShepard contributed his expertise<br>acrosstheboardandlefttheauthorinaweofhisabilitytocutthrough thenoiseandchurnout<br>newknowledge onasteadybasis.Finally, forhisabilitytoanalyze asituation<br>andquicklygettotheroot ofanymechanical problem hewaspresented<br>with,theauthorgratefully acknowledges thetalentsofMr. Charles TelekiofSwales<br>Aerospace. Thesuccess ofthesolararrayon-orbit speaks tothevalueadded<br>bythemembers oftheentireteamoftechnical managers, engineers, andtechnicians<br>whobrought the flightqualification ofthearraytoasuccessful conclusion.<br>References (Allreferences areavailablefromtheEOSLibraryatGSFC,(301)286-5641,<br>orfromtheauthor.) \\\"Critical Design Review Package forElectrical PowerSubsystem,<br>SolarArrayAssembly\\\" CDRL-A059, 5 May1995.(EOSLibrary# 6200)<br>\\\"FirstSolarArrayManual Deployment\\\", LMMS PIRU-S\\/C-L7-1195-SYS RevA,NealShepard,<br>2 February 1998.(EOSLibrary# 9482) \\\"Design andDevelopment ofanImproved Landsat<br>7SolarArrayRetention System\\\", LMMSPIRU-S\\/CL7-1340-SYS, NealShepard<br>andHughMcMenamin, 24March1999.(EOSLibrary# 11421) \\\"Landsat 7Failure Modes<br>andEffectsAnalysis -SolarArrayPanelDeployment System (PDS)\\\", LMMS{'source':<br>'AMS_2000.pdf', 'page': 237}\",3,\"Chunks\"],[\"245a2584-bd43-11ee-801f-bae7cd9d315f\",1.9891388416,17.2756328583,\"\\\"NEAElectronics, Inc.,Chatsworth, CA Proceedings ofthe35thAerospace Mechanisms Symposium, AmesResearch Center,May9-1I,2001 121{'source': 'AMS_2001.pdf', 'page': 131}\",\"\\\"NEAElectronics, Inc.,Chatsworth, CA Proceedings ofthe35thAerospace Mechanisms<br>Symposium, AmesResearch Center,May9-1I,2001 121{'source': 'AMS_2001.pdf',<br>'page': 131}\",3,\"Chunks\"],[\"24f4542e-bd43-11ee-801f-bae7cd9d315f\",6.5945920944,14.6398849487,\"Figure11.Tooldesign andprototypes (missing drillbitshere). Preliminary testswithdifferent typesofcuttingtoolswerecarried outinearlystageofproject. Thetests showcuttingpowerthatwouldcollectarockcore10mmindiameter and15mminheightwithinafew hours.Quicktestsonveryhardandabrasive Finnish granite indicate thatwithgiventhrustandpowerit wouldbepossible tocollectsimilarrockcoreinatimeframeoftensofhours,however, durability and selection ofdrillbitmaterial willbeacriticalissue.Thetoolsthatweretestedwere(Figure 12): 195{'source': 'AMS_2001.pdf', 'page': 205}\",\"Figure11.Tooldesign andprototypes (missing drillbitshere). Preliminary<br>testswithdifferent typesofcuttingtoolswerecarried outinearlystageofproject.<br>Thetests showcuttingpowerthatwouldcollectarockcore10mmindiameter<br>and15mminheightwithinafew hours.Quicktestsonveryhardandabrasive Finnish granite<br>indicate thatwithgiventhrustandpowerit wouldbepossible<br>tocollectsimilarrockcoreinatimeframeoftensofhours,however, durability and<br>selection ofdrillbitmaterial<br>willbeacriticalissue.Thetoolsthatweretestedwere(Figure 12): 195{'source':<br>'AMS_2001.pdf', 'page': 205}\",3,\"Chunks\"],[\"2580109a-bd43-11ee-801f-bae7cd9d315f\",5.1310276985,16.86095047,\"Toreduce risk,theteaminsisted earlyonthatahighfidelity, full-scale engineering modelbefabricated andtestedpriortospacecraft levelCDR.However, toperform theengineering modelandflighttesting, unique deployment\\/G-negation ground support equipment (GSE)wouldhavetobedesigned. Itwas obvious thattheavailable manpower wouldnotallowustodevelop theGSEfromscratch andmaintain thetightGSEdevelopment schedule. OurNASAsponsor, Goddard Spaceflight Center (GSFC), offered designdrawings oftheirairbearing deployment system usedontheTRIMM andXTEmissions. Aftera quickreviewofthedrawings, someadditional designchanges weremadeandwesetouttofabricate the system. Inaddition, GSFCwasveryfamiliar withtheDEBManufacturing damper design chosen for TIMED andgraciously offered theirdamper characterization thermal chamber forouruse.Thehelp provided byGSFCjumpstartedourGSEdesigneffortandwasinstrumental inmaintaining schedule. Deployment TableSystem Thedeployment tablesystem showninFigure6consists ofaseriesofaluminum honeycomb panels mounted onanaluminum support frame.Thesetableswerejoinedtogether toformasmooth airbearing 220{'source': 'AMS_2001.pdf', 'page': 230}\",\"Toreduce risk,theteaminsisted earlyonthatahighfidelity, full-scale engineering<br>modelbefabricated andtestedpriortospacecraft levelCDR.However, toperform<br>theengineering modelandflighttesting, unique deployment\\/G-negation ground<br>support equipment (GSE)wouldhavetobedesigned. Itwas obvious thattheavailable<br>manpower wouldnotallowustodevelop theGSEfromscratch andmaintain<br>thetightGSEdevelopment schedule. OurNASAsponsor, Goddard Spaceflight Center<br>(GSFC), offered designdrawings oftheirairbearing deployment system<br>usedontheTRIMM andXTEmissions. Aftera quickreviewofthedrawings, someadditional<br>designchanges weremadeandwesetouttofabricate the system. Inaddition,<br>GSFCwasveryfamiliar withtheDEBManufacturing damper design chosen for TIMED<br>andgraciously offered theirdamper characterization thermal chamber<br>forouruse.Thehelp provided byGSFCjumpstartedourGSEdesigneffortandwasinstrumental<br>inmaintaining schedule. Deployment TableSystem Thedeployment tablesystem<br>showninFigure6consists ofaseriesofaluminum honeycomb panels mounted onanaluminum<br>support frame.Thesetableswerejoinedtogether toformasmooth airbearing<br>220{'source': 'AMS_2001.pdf', 'page': 230}\",3,\"Chunks\"],[\"2934db6c-bd43-11ee-801f-bae7cd9d315f\",3.0839240551,15.6019153595,\"experience base for the use of these materials will grow and this will support the emergence of new best  practices. By adopting these practices, the mechanisms community will be able to capitalize on NiTi\\u2019s  excell ent corrosion resistance and static load capability properties.  \\n\\nAcknowledgments    The authors wish to thank Anita Howard, Walt Schneider and Mike Perry of the NASA Marshall Space Flight Center for their thoughtful technical input. We thank Walt Wozniak and Steve Miller at the NASA  Glenn Research Center for their technical efforts to build the test hardware to corr oborate the root cause  theory. Finally, we thank NASA Glenn\\u2019s Penni Dalton for her steadfast project management support and  for standing behind our progress despite setbacks  and other challenges. We have benefitted from the  perseverance and dedication of these colleagues.{'source': 'AMS_2016.pdf', 'page': 119}\",\"experience base for the use of these materials will grow and this will support<br>the emergence of new best  practices. By adopting these practices, the<br>mechanisms community will be able to capitalize on NiTi\\u2019s  excell ent corrosion<br>resistance and static load capability properties.    Acknowledgments    The<br>authors wish to thank Anita Howard, Walt Schneider and Mike Perry of the NASA<br>Marshall Space Flight Center for their thoughtful technical input. We thank Walt<br>Wozniak and Steve Miller at the NASA  Glenn Research Center for their technical<br>efforts to build the test hardware to corr oborate the root cause  theory.<br>Finally, we thank NASA Glenn\\u2019s Penni Dalton for her steadfast project management<br>support and  for standing behind our progress despite setbacks  and other<br>challenges. We have benefitted from the  perseverance and dedication of these<br>colleagues.{'source': 'AMS_2016.pdf', 'page': 119}\",3,\"Chunks\"],[\"35dcd590-bd43-11ee-801f-bae7cd9d315f\",5.6309022903,16.5329265594,\"correctly.Wesuspectedthecauseofthepittingwasaproblemwiththematerialbecauseofthepoor responsetoheattreatment,butotherfactorscouldhavebeenresponsible suchastheenvironment the canisterwentthroughduringprocessing. Sincewehadagoodcanister,westoppedlookingforthe cause. Thelessonswelearnedfromtheseeventswereasfollows: Carefullyreviewthecertifications on7075T7351afterheattreatmentandmakesuretheconductivity test resultsarecorrect. Insomecasesitmakessensetomakecouponstoverifytheprocesspriortotreatingtheflight components. Thisisinadditiontoin-process couponsthatvalidatehowwelltheprocesswasdone. Couponsshouldbeaprolongation ofthesamematerialafterheattreatingwheneverpossible. Ifpossible,itisbettertohaveonlyonetypeofplatingoperation,suchasallanodizeorallnickelplating. WecouldhaveransometestsearlyontotrytoeliminatethenickelplatingandjustusedTeflonimpregnated anodize.Therewasastrongfeelingatthestartoftheprogramtostickwithourheritage design,butifwehadtakenthetimetoprovethealternatesystemwassatisfactory, itwouldhavesaved overallcostandschedule. Desi.qnin.q forAssembly Thenextproblem weranintoinvolved somedesigndecisions wehadmadeearlyon.Whiledesigning the unitwedetermined thatthelengthoftheSTEMTMthatdeploys themastneeded tobeadjusted tomatch thelengthofthecanister withinatighttolerance range.Thehardware arrangement weusedtoperform{'source': 'AMS_2002.pdf', 'page': 174}\",\"correctly.Wesuspectedthecauseofthepittingwasaproblemwiththematerialbecauseofthep<br>oor responsetoheattreatment,butotherfactorscouldhavebeenresponsible<br>suchastheenvironment the canisterwentthroughduringprocessing.<br>Sincewehadagoodcanister,westoppedlookingforthe cause.<br>Thelessonswelearnedfromtheseeventswereasfollows:<br>Carefullyreviewthecertifications<br>on7075T7351afterheattreatmentandmakesuretheconductivity test resultsarecorrect.<br>Insomecasesitmakessensetomakecouponstoverifytheprocesspriortotreatingtheflight<br>components. Thisisinadditiontoin-process<br>couponsthatvalidatehowwelltheprocesswasdone. Couponsshouldbeaprolongation<br>ofthesamematerialafterheattreatingwheneverpossible. Ifpossible,itisbettertohaveo<br>nlyonetypeofplatingoperation,suchasallanodizeorallnickelplating. Wecouldhaverans<br>ometestsearlyontotrytoeliminatethenickelplatingandjustusedTeflonimpregnated<br>anodize.Therewasastrongfeelingatthestartoftheprogramtostickwithourheritage<br>design,butifwehadtakenthetimetoprovethealternatesystemwassatisfactory,<br>itwouldhavesaved overallcostandschedule. Desi.qnin.q forAssembly Thenextproblem<br>weranintoinvolved somedesigndecisions wehadmadeearlyon.Whiledesigning the<br>unitwedetermined thatthelengthoftheSTEMTMthatdeploys themastneeded tobeadjusted<br>tomatch thelengthofthecanister withinatighttolerance range.Thehardware<br>arrangement weusedtoperform{'source': 'AMS_2002.pdf', 'page': 174}\",3,\"Chunks\"],[\"382964ee-bd43-11ee-801f-bae7cd9d315f\",1.4116990566,15.7974357605,\"Page intentionally left blank{'source': 'AMS_2002.pdf', 'page': 272}\",\"Page intentionally left blank{'source': 'AMS_2002.pdf', 'page': 272}\",3,\"Chunks\"],[\"3a8a822c-bd43-11ee-801f-bae7cd9d315f\",6.2873630524,14.851020813,\"M[]TIDN CAM MDTTnN CAM \\/--AXIS(PITCH) _--SPHERICAL MIRROR \\/ (4_JfCH) X \\/ _INNER HOUSING ASSY  F .\\/ CAM FOLLOWER  _ _ASSY (PITCH) INTERMEDIATE _ _q X I _I_ HOUSING __ _ _ ___-- HOUE]TE?NG ,__ \\\\ '_r ___ 7--_ _T__-TI--_L'--_ -- TORQUE MOTOR  __ ,j, _--_\\/_ROTOR YAW AXIS TORQUE MDTDR__ _ __..._ STATOR RING __ _ _ ) SHDULDERED_ _ j\\/y_L_x_ \\\\,_ BEARING _ b_T ..... \\\\.-_..\\\"-.#  \\\"''\\/\\/\\/ARN,COVER _ \\/ THRUST BE IG  \\/ WASHERS RESOLVER ANDJ WASHER \\/ RESDLVER HUB HEXNUT Figure 3.Motion System insection showing PylonMirror Motion Basepitchaxis. Theresolver provides rotational position information toacontrol computer that compares thisinformation withthelineardisplacement ofalaserstriking thesurface of aposition sensing device (PSD). Astheimpact pointofthelasermoves onthe360 mm2(.56in2)sensing surface ofthePSD,thecontrol system sendspositioning commands tothetorque motortomaintain thestrikepointnearthecenterofthePSD. Motion Cams Therearefourmotion actuating cams(threelargeandonesmall)intheOPTIMA{'source': 'AMS_1998.pdf', 'page': 76}\",\"M[]TIDN CAM MDTTnN CAM \\/--AXIS(PITCH) _--SPHERICAL MIRROR \\/ (4_JfCH) X \\/ _INNER<br>HOUSING ASSY  F .\\/ CAM FOLLOWER  _ _ASSY (PITCH) INTERMEDIATE _ _q X I _I_<br>HOUSING __ _ _ ___-- HOUE]TE?NG ,__ \\\\ '_r ___ 7--_ _T__-TI--_L'--_ -- TORQUE<br>MOTOR  __ ,j, _--_\\/_ROTOR YAW AXIS TORQUE MDTDR__ _ __..._ STATOR RING __ _ _ )<br>SHDULDERED_ _ j\\/y_L_x_ \\\\,_ BEARING _ b_T ..... \\\\.-_..\\\"-.#  \\\"''\\/\\/\\/ARN,COVER _ \\/<br>THRUST BE IG  \\/ WASHERS RESOLVER ANDJ WASHER \\/ RESDLVER HUB HEXNUT Figure<br>3.Motion System insection showing PylonMirror Motion Basepitchaxis. Theresolver<br>provides rotational position information toacontrol computer that compares<br>thisinformation withthelineardisplacement ofalaserstriking thesurface of<br>aposition sensing device (PSD). Astheimpact pointofthelasermoves onthe360<br>mm2(.56in2)sensing surface ofthePSD,thecontrol system sendspositioning commands<br>tothetorque motortomaintain thestrikepointnearthecenterofthePSD. Motion Cams<br>Therearefourmotion actuating cams(threelargeandonesmall)intheOPTIMA{'source':<br>'AMS_1998.pdf', 'page': 76}\",3,\"Chunks\"],[\"3b365a70-bd43-11ee-801f-bae7cd9d315f\",6.2481846809,15.349313736,\"BallDetent Mechanism Theprimary focusofthedevelopment effortwastooptimize thelatchtrigger mechanism. Although theballdetenthadproved fromtheonsettobeareliable method ofsecuring andreleasing shaftloads,manydifferent iterations hadtobedesigned, manufactured andtestedbeforetheoptimum configuration couldbederived. The challenge wastoconverge onadesign thatdemonstrated theproper balance between thefollowing keyrequirements: 1)Maximize thereduction raliobetween forceapplied totheoutput shaft\\/pin (i.e., fromDecompression ortorque springs, respectively) totheforceneeded to release thelatch(i.e.,fromtheNitinolwire). 2)Minimize thestrokeneeded fromtheNitinolwiretoreliably release thelatch. 3)Ensure thatthedesign isfullystableinthelatched position soastobecapable of enduring launch shockandvibration. 4)Design sufficient margin intotheSMAforceandstrokeastomeetaerospace requirements. Figure4represents thebasicdesign evolved. Notethatthedirections oftheparticular vectors shown ismorerepresentative oftheloading forthepinpuller configuration. The rotaryactuator isdesigned tomimicthesameloaddistribution withtheforcesrotated 90 degrees aboutthevectorF,atc\\\". F(pin) 0.5F (latch) 0.87F(sleeve) Figure 4BallDetent ForceBalance 109{'source': 'AMS_1998.pdf', 'page': 121}\",\"BallDetent Mechanism Theprimary focusofthedevelopment effortwastooptimize<br>thelatchtrigger mechanism. Although theballdetenthadproved<br>fromtheonsettobeareliable method ofsecuring andreleasing<br>shaftloads,manydifferent iterations hadtobedesigned, manufactured<br>andtestedbeforetheoptimum configuration couldbederived. The challenge<br>wastoconverge onadesign thatdemonstrated theproper balance between thefollowing<br>keyrequirements: 1)Maximize thereduction raliobetween forceapplied totheoutput<br>shaft\\/pin (i.e., fromDecompression ortorque springs, respectively)<br>totheforceneeded to release thelatch(i.e.,fromtheNitinolwire). 2)Minimize<br>thestrokeneeded fromtheNitinolwiretoreliably release thelatch. 3)Ensure<br>thatthedesign isfullystableinthelatched position soastobecapable of enduring<br>launch shockandvibration. 4)Design sufficient margin<br>intotheSMAforceandstrokeastomeetaerospace requirements. Figure4represents<br>thebasicdesign evolved. Notethatthedirections oftheparticular vectors shown<br>ismorerepresentative oftheloading forthepinpuller configuration. The<br>rotaryactuator isdesigned tomimicthesameloaddistribution withtheforcesrotated 90<br>degrees aboutthevectorF,atc\\\". F(pin) 0.5F (latch) 0.87F(sleeve) Figure<br>4BallDetent ForceBalance 109{'source': 'AMS_1998.pdf', 'page': 121}\",3,\"Chunks\"],[\"3d0622f4-bd43-11ee-801f-bae7cd9d315f\",3.0976376534,13.1756391525,\"Liquid Hydrogen Testing ofSilicon Nitride Bearings forUseinHigh Speed Turbomachinery ChipMoore', Howard Gibson* andDr.RobertThom* Abstract Hybridceramic rollingelement bearings arebeingtestedinliquidhydrogen at Marshall SpaceFlightCenter. Thetestingwillevaluate theirlongtermdurability for useathighspeeds incryogenic rocketengineturbomachinery. Theuseofhybrid ceramic bearings inliquidhydrogen followssuccessful development andflightin liquidoxygen turbopumps. Introduction Hybridceramic rollingelement bearings promise significant benefits foruseinhigh speed,rocketengineturbomachinery. Theprimary benefits ofceramic rolling elements oversteelinclude increased rotordynamic stiffness andlowercentrifugal loadsduetolessmass.Siliconnitrideisthebestsuitedceramic forrollingelement bearing applications andispresently flyingonthenewerliquidoxygen, highpressure oxidizer turbopumps oftheSpaceShuttle MainEngine (SSME) [1].Similarhybrid ceramic bearings willalsobeusedinthenewliquidhydrogen, highpressure fuel turbopumps [2].Fortheliquidoxygen pumps, extensive groundtestingofthebearings wasconducted intestrigs.Thiswasfollowed byuseinpumpsongroundtestengines thenuseonflightengines. Basedonthesuccess intheliquidoxygen pumps, no preliminary bearing rigtestswereplanned forthenewfuelpumpbearings priorto insertion intopumpsongroundtestengines. Duringthesehot-fire enginetests, uniquesurface anomalies wereobserved onthesiliconnitriderollingelements. The surface anomalies resembled fine,hairline crackswhichweredubbed \\\"rivermarks\\\"{'source': 'AMS_1998.pdf', 'page': 209}\",\"Liquid Hydrogen Testing ofSilicon Nitride Bearings forUseinHigh Speed<br>Turbomachinery ChipMoore', Howard Gibson* andDr.RobertThom* Abstract<br>Hybridceramic rollingelement bearings arebeingtestedinliquidhydrogen at Marshall<br>SpaceFlightCenter. Thetestingwillevaluate theirlongtermdurability for<br>useathighspeeds incryogenic rocketengineturbomachinery. Theuseofhybrid ceramic<br>bearings inliquidhydrogen followssuccessful development andflightin liquidoxygen<br>turbopumps. Introduction Hybridceramic rollingelement bearings promise<br>significant benefits foruseinhigh speed,rocketengineturbomachinery. Theprimary<br>benefits ofceramic rolling elements oversteelinclude increased rotordynamic<br>stiffness andlowercentrifugal<br>loadsduetolessmass.Siliconnitrideisthebestsuitedceramic forrollingelement<br>bearing applications andispresently flyingonthenewerliquidoxygen, highpressure<br>oxidizer turbopumps oftheSpaceShuttle MainEngine (SSME) [1].Similarhybrid<br>ceramic bearings willalsobeusedinthenewliquidhydrogen, highpressure fuel<br>turbopumps [2].Fortheliquidoxygen pumps, extensive groundtestingofthebearings<br>wasconducted intestrigs.Thiswasfollowed byuseinpumpsongroundtestengines<br>thenuseonflightengines. Basedonthesuccess intheliquidoxygen pumps, no<br>preliminary bearing rigtestswereplanned forthenewfuelpumpbearings priorto<br>insertion intopumpsongroundtestengines. Duringthesehot-fire enginetests,<br>uniquesurface anomalies wereobserved onthesiliconnitriderollingelements. The<br>surface anomalies resembled fine,hairline crackswhichweredubbed<br>\\\"rivermarks\\\"{'source': 'AMS_1998.pdf', 'page': 209}\",3,\"Chunks\"],[\"40d595d6-bd43-11ee-801f-bae7cd9d315f\",4.4758944511,17.3955631256,\"Development oftheMarsPolarLander Retention andRelease Mechanism DaleRudolph\\\" andScottMathews* c_\\\"_---.3 7' Abstract MARS'98 isthelatestNASAprogram aimedatlearning moreaboutthe'RedPlanet'. Itispreceded bythesimilarmissions ofVikingin1976,andmorerecently, Pathfinder andMarsGlobalSurveyor (MGS)in1996.TheMARS'98 mission includes two spacecraft, theMarsClimate Orbiter, whichlaunched inDecember of1998,andthe MarsPolarLander (MPL),whichlaunched inJanuary of1999.TheLander willenter theMartian atmosphere enclosed inaprotective aeroshell (comprising abackshell andheatshield), andunlikePathfinder, willflyacontrolled descent totheplanet's surface usingrocketengines onceithasseparated fromthebackshell. Theprecisely sequenced operation oftheMPLRetention andRelease (R&R)mechanism is essential tothesuccessful separation oftheLanderfromthebackshell, andthenonoperation ofanyofthefourR&Rmechanisms comprising theseparation system represents asinglepointfailurethatwouldendthespacecraft mission. Also,asa structural loadpath,allfourR&Rmechanisms mustshareLandersupport loadsin unison, andthefailureofanyonewouldresultincatastrophic structural failureofthe vehicle. Thispaperfocuses onthedesign, development, andtestingoftheMPLR&R mechanisms andrelatedseparation systems, andlessons learned throughout this process. Introduction Retention andrelease mechanisms areamongthemostcriticaldevices onany{'source': 'AMS_1999.pdf', 'page': 115}\",\"Development oftheMarsPolarLander Retention andRelease Mechanism DaleRudolph\\\"<br>andScottMathews* c_\\\"_---.3 7' Abstract MARS'98 isthelatestNASAprogram<br>aimedatlearning moreaboutthe'RedPlanet'. Itispreceded bythesimilarmissions<br>ofVikingin1976,andmorerecently, Pathfinder andMarsGlobalSurveyor<br>(MGS)in1996.TheMARS'98 mission includes two spacecraft, theMarsClimate Orbiter,<br>whichlaunched inDecember of1998,andthe MarsPolarLander (MPL),whichlaunched<br>inJanuary of1999.TheLander willenter theMartian atmosphere enclosed<br>inaprotective aeroshell (comprising abackshell andheatshield),<br>andunlikePathfinder, willflyacontrolled descent totheplanet's surface<br>usingrocketengines onceithasseparated fromthebackshell. Theprecisely sequenced<br>operation oftheMPLRetention andRelease (R&R)mechanism is essential<br>tothesuccessful separation oftheLanderfromthebackshell, andthenonoperation<br>ofanyofthefourR&Rmechanisms comprising theseparation system represents<br>asinglepointfailurethatwouldendthespacecraft mission. Also,asa structural<br>loadpath,allfourR&Rmechanisms mustshareLandersupport loadsin unison,<br>andthefailureofanyonewouldresultincatastrophic structural failureofthe vehicle.<br>Thispaperfocuses onthedesign, development, andtestingoftheMPLR&R mechanisms<br>andrelatedseparation systems, andlessons learned throughout this process.<br>Introduction Retention andrelease mechanisms areamongthemostcriticaldevices<br>onany{'source': 'AMS_1999.pdf', 'page': 115}\",3,\"Chunks\"],[\"4333cdb6-bd43-11ee-801f-bae7cd9d315f\",1.3929800987,16.1774902344,\"amount ofoperational timethatasingleunithasachieved todate. 294{'source': 'AMS_1999.pdf', 'page': 308}\",\"amount ofoperational timethatasingleunithasachieved todate. 294{'source':<br>'AMS_1999.pdf', 'page': 308}\",3,\"Chunks\"],[\"4688dcd6-bd43-11ee-801f-bae7cd9d315f\",6.3203616142,14.3857355118,\"Bearing, Angular Contact Diaphragm, Bearing Suspension GearShield Stator ViewA -F-0800.1mm\\/ Pitch(O31.50N) I\\/ BullGear_ 0487.68 mm (O19.20 in) 24.93mm (I\\\\I(.95in)!1'__\\\\1 ToothFace  Width = \\/_'k__Bearing, Angular \\/_Contact Stator---' \\\",--Diaphragm, Bearing Suspension ViewBBracket, Interface Drive\\/Locking AssemblyHandle, EVAHandhold -'1mm(.750in) Bearing Width m _ 0728.73 mm (028.69 in) _O598.42 mm I(023.56 in) -4Angular 'Contact IBearing ITwoPlaces k__RotorStructure StatorStructure I Preload Bearing I SetofTeeth Diaphragm TwoPlaces I 645.16mm ---.I (31.87in) Figure 4.CrossSection, Bearing Assembly, TRRJ TRRJFeatures BullGear Thebullgearpitchdiameter is800.1mm(31.50in). \\u2022Materials 2219-T851 machined aluminum hubwith4340steelringsheattreated to Rc42-45, thermally-fitted tothehub 378redundant setofteeth,AGMA quality 10,machined intothesteelrings (Figure 4) \\u2022Weight: 15.9kg(35Ib) \\u2022Coating Iongolddeposition 2000-7000 Athickness onteethforcorrosion protection and enhanced lubrication 102{'source': 'AMS_1997.pdf', 'page': 118}\",\"Bearing, Angular Contact Diaphragm, Bearing Suspension GearShield Stator ViewA<br>-F-0800.1mm\\/ Pitch(O31.50N) I\\/ BullGear_ 0487.68 mm (O19.20 in) 24.93mm<br>(I\\\\I(.95in)!1'__\\\\1 ToothFace  Width = \\/_'k__Bearing, Angular \\/_Contact<br>Stator---' \\\",--Diaphragm, Bearing Suspension ViewBBracket, Interface<br>Drive\\/Locking AssemblyHandle, EVAHandhold -'1mm(.750in) Bearing Width m _<br>0728.73 mm (028.69 in) _O598.42 mm I(023.56 in) -4Angular 'Contact IBearing<br>ITwoPlaces k__RotorStructure StatorStructure I Preload Bearing I SetofTeeth<br>Diaphragm TwoPlaces I 645.16mm ---.I (31.87in) Figure 4.CrossSection, Bearing<br>Assembly, TRRJ TRRJFeatures BullGear Thebullgearpitchdiameter<br>is800.1mm(31.50in). \\u2022Materials 2219-T851 machined aluminum<br>hubwith4340steelringsheattreated to Rc42-45, thermally-fitted tothehub<br>378redundant setofteeth,AGMA quality 10,machined intothesteelrings (Figure 4)<br>\\u2022Weight: 15.9kg(35Ib) \\u2022Coating Iongolddeposition 2000-7000 Athickness<br>onteethforcorrosion protection and enhanced lubrication 102{'source':<br>'AMS_1997.pdf', 'page': 118}\",3,\"Chunks\"],[\"4688df42-bd43-11ee-801f-bae7cd9d315f\",6.2986822128,15.7177057266,\"andmadeprediction ofthetorquerequiredtoreleasetheinternalLatching Mechanism almostimpossible. Thisdesignalsohadtheembarrassing tendency toreleaseuncommanded duringvibrationorshock. 6.440Cstainlesssteelwasextremely brittleandfractured underhighloads andundercreepconditions. 7.Thetorquenutasameanstoapplyaxialloadprovedextremely cumbersome. Torquesashighas203Nom(150ftolbf)wererequiredto apply44.48kN(10000Ibf)totheBoltanddifficulties wereexperienced in maintaining theloadovertime. EDIJ1.5 EDU1.0obviously needed someimprovement. Atthatpoint,however, therewas neither timenormoney toredesign andmanufacture newparts.Fortunately, TiNi Aerospace hadjoinedtheFASSN teamandhadoffered theuseofaNitinol Rotary Actuator toreplace therotarysolenoid. EDU1.5tooktheEDU1.0mechanism and replaced theelectric rotarysolenoid withtheNitinolRotary Actuator. TheNitinol Rotary Actuator offered thefollowing advantages: 1.Itgenerated over4timesmoretorque. 2.Thetorque outputwascreated byaninternal, redundant, mechanical torque springs. Thus,thetorquewasnotaffected bytemperature. 130{'source': 'AMS_1997.pdf', 'page': 146}\",\"andmadeprediction ofthetorquerequiredtoreleasetheinternalLatching Mechanism<br>almostimpossible. Thisdesignalsohadtheembarrassing tendency toreleaseuncommanded<br>duringvibrationorshock. 6.440Cstainlesssteelwasextremely brittleandfractured<br>underhighloads andundercreepconditions.<br>7.Thetorquenutasameanstoapplyaxialloadprovedextremely cumbersome.<br>Torquesashighas203Nom(150ftolbf)wererequiredto<br>apply44.48kN(10000Ibf)totheBoltanddifficulties wereexperienced in maintaining<br>theloadovertime. EDIJ1.5 EDU1.0obviously needed someimprovement.<br>Atthatpoint,however, therewas neither timenormoney toredesign andmanufacture<br>newparts.Fortunately, TiNi Aerospace hadjoinedtheFASSN teamandhadoffered<br>theuseofaNitinol Rotary Actuator toreplace therotarysolenoid.<br>EDU1.5tooktheEDU1.0mechanism and replaced theelectric rotarysolenoid<br>withtheNitinolRotary Actuator. TheNitinol Rotary Actuator offered thefollowing<br>advantages: 1.Itgenerated over4timesmoretorque. 2.Thetorque outputwascreated<br>byaninternal, redundant, mechanical torque springs. Thus,thetorquewasnotaffected<br>bytemperature. 130{'source': 'AMS_1997.pdf', 'page': 146}\",3,\"Chunks\"],[\"4e256e28-bd43-11ee-801f-bae7cd9d315f\",5.7612700462,16.2840118408,\"The mechanism consists of an active and a passive assem ly. It can accommodate an  I linear misalignment of 6.35 mm (0.25 in) and an angular misalignment of 2\\\"  een the active and passive assemblies.  All functions -- extension of the plug, mating, and movement of the debris shield -- are  actuated by a single drive mechanism with redundant motors. An override feature in  the drive train allows manual operation in case of motor failure.  eatures and abi I ities  Key features and capabilities of the UMA are as follows:  0 Remotely connect umbilical connectors for the transfer of power and data for  multiple applications on International Space Station  Accommodate an initial linear misalignment of 6.35 mrn (0.25 in) and angular  misalignment of 2O between the active and passive assemblies  0 Provide capability for on-orbit replacement  0 Envelope of the active half is 29.21 x 34.29 x 35.56 cm (1 1.5 x 13.5 x 14 in) and  passive half is 26.92 x 28.70 x 17.78 cm (1 0.6 x 1 1.3 x 7.0 in)  Connector mating force of 11 12 N (250 Ibf) minimum  0 Design life cycles - 5000  * Capability provided for Extravehicular Activity backup  0 Male and female connectors are protected from external debris  Weight of active half is 32.0 kg (70.4 Ib) and passive half is 6.7 kg (14.7 Ib)  0 Electrical I y si ng I e fai I u re to1 e rant  0 Mechanically zero failure tolerant and designed to minimum risk{'source': 'AMS_1996.pdf', 'page': 345}\",\"The mechanism consists of an active and a passive assem ly. It can accommodate<br>an  I linear misalignment of 6.35 mm (0.25 in) and an angular misalignment of 2\\\"<br>een the active and passive assemblies.  All functions -- extension of the plug,<br>mating, and movement of the debris shield -- are  actuated by a single drive<br>mechanism with redundant motors. An override feature in  the drive train allows<br>manual operation in case of motor failure.  eatures and abi I ities  Key<br>features and capabilities of the UMA are as follows:  0 Remotely connect<br>umbilical connectors for the transfer of power and data for  multiple<br>applications on International Space Station  Accommodate an initial linear<br>misalignment of 6.35 mrn (0.25 in) and angular  misalignment of 2O between the<br>active and passive assemblies  0 Provide capability for on-orbit replacement  0<br>Envelope of the active half is 29.21 x 34.29 x 35.56 cm (1 1.5 x 13.5 x 14 in)<br>and  passive half is 26.92 x 28.70 x 17.78 cm (1 0.6 x 1 1.3 x 7.0 in)<br>Connector mating force of 11 12 N (250 Ibf) minimum  0 Design life cycles - 5000<br>* Capability provided for Extravehicular Activity backup  0 Male and female<br>connectors are protected from external debris  Weight of active half is 32.0 kg<br>(70.4 Ib) and passive half is 6.7 kg (14.7 Ib)  0 Electrical I y si ng I e fai I<br>u re to1 e rant  0 Mechanically zero failure tolerant and designed to minimum<br>risk{'source': 'AMS_1996.pdf', 'page': 345}\",3,\"Chunks\"],[\"4ed60f12-bd43-11ee-801f-bae7cd9d315f\",2.2815816402,17.532535553,\"contractors and grantees. \\u2022 CONFERENCE PUBLICATION. Collected  papers from scienti \\ufb01 c and technical  conferences, symposia, seminars, or other meetings sponsored or co-sponsored by NASA.\\n\\n\\u2022 SPECIAL PUBLICATION. Scienti \\ufb01 c,  technical, or historical information from NASA programs, projects, and missions, often concerned with subjects having substantial public interest.\\n\\n\\u2022 TECHNICAL TRANSLATION. Englishlanguage translations of foreign scienti \\ufb01 c and  technical material pertinent to NASA\\u2019s mission. For more information about the NASA STI  program, see the following: \\u2022 Access the NASA STI program home page at  http:\\/\\/www.sti.nasa.gov  \\u2022 E-mail your question to help@sti.nasa.gov \\u2022 Fax your question to the NASA STI  Information Desk at 757-864-6500 \\u2022 Telephone the NASA STI Information Desk at  757-864-9658 \\u2022 Write to: NASA STI Program  Mail Stop 148 NASA Langley Research Center Hampton, V A 23681-2199{'source': 'AMS_2018.pdf', 'page': 2}\",\"contractors and grantees. \\u2022 CONFERENCE PUBLICATION. Collected  papers from<br>scienti \\ufb01 c and technical  conferences, symposia, seminars, or other meetings<br>sponsored or co-sponsored by NASA.  \\u2022 SPECIAL PUBLICATION. Scienti \\ufb01 c,<br>technical, or historical information from NASA programs, projects, and missions,<br>often concerned with subjects having substantial public interest.  \\u2022 TECHNICAL<br>TRANSLATION. Englishlanguage translations of foreign scienti \\ufb01 c and  technical<br>material pertinent to NASA\\u2019s mission. For more information about the NASA STI<br>program, see the following: \\u2022 Access the NASA STI program home page at<br>http:\\/\\/www.sti.nasa.gov  \\u2022 E-mail your question to help@sti.nasa.gov \\u2022 Fax your<br>question to the NASA STI  Information Desk at 757-864-6500 \\u2022 Telephone the NASA<br>STI Information Desk at  757-864-9658 \\u2022 Write to: NASA STI Program  Mail Stop<br>148 NASA Langley Research Center Hampton, V A 23681-2199{'source':<br>'AMS_2018.pdf', 'page': 2}\",3,\"Chunks\"],[\"5386478e-bd43-11ee-801f-bae7cd9d315f\",5.2273087502,12.3483505249,\"provided by the motor, which, combined with internal friction, provided sufficient damping for stable  operation. After the unit was run-in during the initial TVAC cycles, the slight decrease in bearing and  harmonic drive friction from run-in and the reduction in bearing and harmonic drive viscous drag at hot,  combined with the slight reduction in motor detent hysteresis torque at hot, removed enough damping from  the motor for it to become unstable when driven with an excitation voltage above 72 V.   Stability Model Issues  Clearly, based on the TVAC failure, the original step stability analysis was not sufficient. For the CSADA, a  \\u201cheritage\\u201d stability model had been utilized, which up to this point had demonstrated a good track record. It  is important to note that the heritage stability model was designed for 4-phase unipolar stepper motors  driven at 70 V by the same motor driver. For conservatism, all combinations of the key parameters were  analyzed at all combinations of minimum and maximum (see reference 1 for stability model methodology  and background). The minimum bearing friction and damping values analyzed were zero, so a loss of  stability was not expected. The model included the dynamic properties of the harmonic drive, output shaft,  and solar array, being modeled as a multiple mass-spring torsional system. After the failure occurred,  digging into the model revealed a serious flaw \\u2013 the diode circuit in the motor driver was not modeled  correctly. The diode circuit only allows current to flow when the BEMF voltage generated by any motor  phase is less than -8 volts (as depicted in Figure 12). The model, as designed, allowed current to flow if the{'source': 'AMS_2018.pdf', 'page': 320}\",\"provided by the motor, which, combined with internal friction, provided<br>sufficient damping for stable  operation. After the unit was run-in during the<br>initial TVAC cycles, the slight decrease in bearing and  harmonic drive friction<br>from run-in and the reduction in bearing and harmonic drive viscous drag at hot,<br>combined with the slight reduction in motor detent hysteresis torque at hot,<br>removed enough damping from  the motor for it to become unstable when driven<br>with an excitation voltage above 72 V.   Stability Model Issues  Clearly, based<br>on the TVAC failure, the original step stability analysis was not sufficient.<br>For the CSADA, a  \\u201cheritage\\u201d stability model had been utilized, which up to this<br>point had demonstrated a good track record. It  is important to note that the<br>heritage stability model was designed for 4-phase unipolar stepper motors<br>driven at 70 V by the same motor driver. For conservatism, all combinations of<br>the key parameters were  analyzed at all combinations of minimum and maximum<br>(see reference 1 for stability model methodology  and background). The minimum<br>bearing friction and damping values analyzed were zero, so a loss of  stability<br>was not expected. The model included the dynamic properties of the harmonic<br>drive, output shaft,  and solar array, being modeled as a multiple mass-spring<br>torsional system. After the failure occurred,  digging into the model revealed a<br>serious flaw \\u2013 the diode circuit in the motor driver was not modeled  correctly.<br>The diode circuit only allows current to flow when the BEMF voltage generated by<br>any motor  phase is less than -8 volts (as depicted in Figure 12). The model, as<br>designed, allowed current to flow if the{'source': 'AMS_2018.pdf', 'page': 320}\",3,\"Chunks\"],[\"53864842-bd43-11ee-801f-bae7cd9d315f\",5.5523056984,12.6655654907,\"Figure 2. Motor Serial Number 041  Figure 3. Brush Assembly  Motor Diameter is 30 mm  Figure 4. View of the Shaft End with the Commutator and Winding Terminations Shown  Thermal Cycle Test Setup  Three motors were selected for thermal cycle testing and placed in the thermal chamber. The motors are  not rotated during the thermal cycle testing to enable accurate measurements of the winding resistance.  The instrumentation was connected to read the winding resistance of the motors as shown in Figure 5 while  the temperature was cycled from hot to cold. The temperature of various locations on the motor assemblies  and voltage drop across the windings (resistance) was recorded continuously during the test. The  resistance of the windings varies directly with the temperature of the test article. The expected appearance  of the recorded data for the windings would show the resistance of the windings rising and falling smoothly  with the temperature of motor as shown in Figure 6.  NASA\\/CP\\u20142018-219887 309{'source': 'AMS_2018.pdf', 'page': 327}\",\"Figure 2. Motor Serial Number 041  Figure 3. Brush Assembly  Motor Diameter is<br>30 mm  Figure 4. View of the Shaft End with the Commutator and Winding<br>Terminations Shown  Thermal Cycle Test Setup  Three motors were selected for<br>thermal cycle testing and placed in the thermal chamber. The motors are  not<br>rotated during the thermal cycle testing to enable accurate measurements of the<br>winding resistance.  The instrumentation was connected to read the winding<br>resistance of the motors as shown in Figure 5 while  the temperature was cycled<br>from hot to cold. The temperature of various locations on the motor assemblies<br>and voltage drop across the windings (resistance) was recorded continuously<br>during the test. The  resistance of the windings varies directly with the<br>temperature of the test article. The expected appearance  of the recorded data<br>for the windings would show the resistance of the windings rising and falling<br>smoothly  with the temperature of motor as shown in Figure 6.<br>NASA\\/CP\\u20142018-219887 309{'source': 'AMS_2018.pdf', 'page': 327}\",3,\"Chunks\"],[\"5484066c-bd43-11ee-801f-bae7cd9d315f\",4.3063902855,17.4147529602,\"station  via the NanoRacks  CubeSat  deployer.  After  approximately  one month  of bus checkout  tests,  the  antenna  will be deployed  for a final  time,  in low earth  orbit.  The  mission  and antenna  are designed  to  operate for approximately 1.5 years, before it reenters Earth\\u2019s atmosphere and disintegrates.    \\u00a9 2018 All Rights Reserved. Government sponsorship acknowledged.  NASA\\/CP\\u20142018-219887 370{'source': 'AMS_2018.pdf', 'page': 388}\",\"station  via the NanoRacks  CubeSat  deployer.  After  approximately  one month<br>of bus checkout  tests,  the  antenna  will be deployed  for a final  time,  in<br>low earth  orbit.  The  mission  and antenna  are designed  to  operate for<br>approximately 1.5 years, before it reenters Earth\\u2019s atmosphere and<br>disintegrates.    \\u00a9 2018 All Rights Reserved. Government sponsorship<br>acknowledged.  NASA\\/CP\\u20142018-219887 370{'source': 'AMS_2018.pdf', 'page': 388}\",3,\"Chunks\"],[\"5656bb7e-bd43-11ee-801f-bae7cd9d315f\",5.4144115448,16.4695587158,\"In addition to predicting system response, during the early development cycle, additive manufacturing  models served as advantageous visual aids to assist with communication of concepts. Handheld models  provide a foundation for quickly grasping concepts with increased levels of engagement during collaborative  sessions.   Dynamics Simulations  Multi-body simulation of the transportation route has proven to be a useful tool to ensure the mechanisms  will remain within the specified travel ranges, and to identify the locations on each route that are likely to be  most challenging. General analysis tools for multi-body dynamics were already available, but a process for  turning road survey data into boundary conditions needed to be developed from scratch. The MPTS  inherently relies upon contact and various types of nonlinearities that cannot be linearized away. Adding  control systems for dozens of wheel modules, with many contact definitions between a road surface and  the tires, would make a miles-long roadway simulation strain solvability and still require a lot of guesswork.  As an alternative, the as-built survey data was used to create splines for the center, and each side of the  road. The splines incorporate features such as cross-fall, crown, and grade. A simplified mechanism of links  and joints spans between the splines in order to be pulled along the path without binding. The resultant  pitch, yaw, roll, and elevation for each location is imposed on a dynamic model of the MPTS mechanisms.  Thereafter, the model is able to illustrate points on the surveyed road, the system will have the least  available range-of-motion margin, and operators can respond to this information appropriately.   Since the MPTS mechanism model is built using both dynamically-reduced finite element models and{'source': 'AMS_2018.pdf', 'page': 485}\",\"In addition to predicting system response, during the early development cycle,<br>additive manufacturing  models served as advantageous visual aids to assist with<br>communication of concepts. Handheld models  provide a foundation for quickly<br>grasping concepts with increased levels of engagement during collaborative<br>sessions.   Dynamics Simulations  Multi-body simulation of the transportation<br>route has proven to be a useful tool to ensure the mechanisms  will remain<br>within the specified travel ranges, and to identify the locations on each route<br>that are likely to be  most challenging. General analysis tools for multi-body<br>dynamics were already available, but a process for  turning road survey data<br>into boundary conditions needed to be developed from scratch. The MPTS<br>inherently relies upon contact and various types of nonlinearities that cannot<br>be linearized away. Adding  control systems for dozens of wheel modules, with<br>many contact definitions between a road surface and  the tires, would make a<br>miles-long roadway simulation strain solvability and still require a lot of<br>guesswork.  As an alternative, the as-built survey data was used to create<br>splines for the center, and each side of the  road. The splines incorporate<br>features such as cross-fall, crown, and grade. A simplified mechanism of links<br>and joints spans between the splines in order to be pulled along the path<br>without binding. The resultant  pitch, yaw, roll, and elevation for each<br>location is imposed on a dynamic model of the MPTS mechanisms.  Thereafter, the<br>model is able to illustrate points on the surveyed road, the system will have<br>the least  available range-of-motion margin, and operators can respond to this<br>information appropriately.   Since the MPTS mechanism model is built using both<br>dynamically-reduced finite element models and{'source': 'AMS_2018.pdf', 'page':<br>485}\",3,\"Chunks\"],[\"57fe563a-bd43-11ee-801f-bae7cd9d315f\",3.9546794891,12.5212049484,\"beari ngs, the data are in the same order of magnitude of each other,  for the same size bearing . However,  since the all -steel bearing tends to have a higher LQF than the hybrid bearing, this indicates that the torque  output of an all -steel bearing will be slightly higher than the hybrid if all other conditions are equal.  \\n\\nFigure 12. Normalized LQF vs. average temperature for 178 N ( 40 lb) load and constant temperature  gradient of 12\\u00b0C for 305- size all -Steel and Hybrid Bearing  \\n\\nDependence of LQF on DT  For both test bearings, the data generally show that LQF increases in direct proportion with the temperature  differential ( DT) across the bearing (Figures 4,5,9,  and 10) . We surmise that this is not due to an increase  in the actual quantity of oil, but more likely due to imperfections in the model since  it fails to account for  the  circumstances created by the large differential across the bearing. For example, the model may  underestimate the actual viscosity, and correct for this by overestimating the quantity . The viscosity used  in the calculations of LQF shown here was chosen to be the viscosity  at the temperature midway between  the outer and inner race temperatures . However, because the dependence of viscosity on temperature is  not linear, the actual average viscosity will be lower than the viscosity at average te mperature. The deviation{'source': 'AMS_2018.pdf', 'page': 573}\",\"beari ngs, the data are in the same order of magnitude of each other,  for the<br>same size bearing . However,  since the all -steel bearing tends to have a<br>higher LQF than the hybrid bearing, this indicates that the torque  output of an<br>all -steel bearing will be slightly higher than the hybrid if all other<br>conditions are equal.    Figure 12. Normalized LQF vs. average temperature for<br>178 N ( 40 lb) load and constant temperature  gradient of 12\\u00b0C for 305- size all<br>-Steel and Hybrid Bearing    Dependence of LQF on DT  For both test bearings,<br>the data generally show that LQF increases in direct proportion with the<br>temperature  differential ( DT) across the bearing (Figures 4,5,9,  and 10) . We<br>surmise that this is not due to an increase  in the actual quantity of oil, but<br>more likely due to imperfections in the model since  it fails to account for<br>the  circumstances created by the large differential across the bearing. For<br>example, the model may  underestimate the actual viscosity, and correct for this<br>by overestimating the quantity . The viscosity used  in the calculations of LQF<br>shown here was chosen to be the viscosity  at the temperature midway between<br>the outer and inner race temperatures . However, because the dependence of<br>viscosity on temperature is  not linear, the actual average viscosity will be<br>lower than the viscosity at average te mperature. The deviation{'source':<br>'AMS_2018.pdf', 'page': 573}\",3,\"Chunks\"],[\"57fe566c-bd43-11ee-801f-bae7cd9d315f\",3.4395370483,12.8524694443,\"and 8) , temperature gradient (F igures 4, 5, 9, and 10) and axial loads  (Figures 6 and 11) . We surmise that  these effects may be due to changes in the viscosity of the oil, affecting the volume of oil in the ball\\/race meniscus, or they may be due to changes in the thermal gradient in the vicinity of the contact, affecting the  flow of oil to the meniscus . While it is likely that the dependence on average bearing temperature is caused  by an actual change in the quantity of oil at the ball\\/race contact, the dependence on D T across the bearings  is more likely due to inadequacies in the drag torque model . The cause of the dependence on load remains  undetermined, but there are potential causes that are due to changes in actual oil volume and others due to errors in the drag torque model. Regardl ess of the cause, these dependencies should be considered  when applying the conventional drag model shown in E quation 6.    There are some differences in trends between the hybrid and all steel bearing. In the hybrid bearing, all  load conditions show a sensitivity of LQF to average temperature, but the degree of sensitivity is dependent on both temperature gradient and axial loads . The constant thermal gradient curves are NOT parallel in the  case of the hybrid bearings . This indicates that there is an interdependency between LQF and average  temperature, temperature gradient, and axial loads . The cause of differences between steel and hybrid are  the subject of future work . \\n\\nAcknowledgements    The authors  would like to acknowledge the management, Dr. Michael R. Hilton and Dr. Michael C. Lee for  their help on this project . This work would not be possible without their continued support.{'source': 'AMS_2018.pdf', 'page': 574}\",\"and 8) , temperature gradient (F igures 4, 5, 9, and 10) and axial loads<br>(Figures 6 and 11) . We surmise that  these effects may be due to changes in the<br>viscosity of the oil, affecting the volume of oil in the ball\\/race meniscus, or<br>they may be due to changes in the thermal gradient in the vicinity of the<br>contact, affecting the  flow of oil to the meniscus . While it is likely that<br>the dependence on average bearing temperature is caused  by an actual change in<br>the quantity of oil at the ball\\/race contact, the dependence on D T across the<br>bearings  is more likely due to inadequacies in the drag torque model . The<br>cause of the dependence on load remains  undetermined, but there are potential<br>causes that are due to changes in actual oil volume and others due to errors in<br>the drag torque model. Regardl ess of the cause, these dependencies should be<br>considered  when applying the conventional drag model shown in E quation 6.<br>There are some differences in trends between the hybrid and all steel bearing.<br>In the hybrid bearing, all  load conditions show a sensitivity of LQF to average<br>temperature, but the degree of sensitivity is dependent on both temperature<br>gradient and axial loads . The constant thermal gradient curves are NOT parallel<br>in the  case of the hybrid bearings . This indicates that there is an<br>interdependency between LQF and average  temperature, temperature gradient, and<br>axial loads . The cause of differences between steel and hybrid are  the subject<br>of future work .   Acknowledgements    The authors  would like to acknowledge<br>the management, Dr. Michael R. Hilton and Dr. Michael C. Lee for  their help on<br>this project . This work would not be possible without their continued<br>support.{'source': 'AMS_2018.pdf', 'page': 574}\",3,\"Chunks\"],[\"5b5ea3fc-bd43-11ee-801f-bae7cd9d315f\",6.4049649239,13.8222198486,\"stable cylindrical shape. Curved tape springs provide a self-latching function. Fundamental studies of design and performance of these elements were carried out by Pellegrino and Steffen [2] [3] at the University of Cambridge. The schematic bending behavior is illustrated in Figure 2.  The tape springs are stiff until they buckle under a bending moment. In the buckling zone, the affected  cross section is flattened. The peak value is higher for bending against the tape spring curvature  (opposite sense) than for equal sense bending. The steady state moments are almost equal in both  directions The challenge in using an ECH design is building a high deformable hinge with sufficient deployment  torque and end stiffness. This was solved by using curved spring elements of different length. The longer  222{'source': 'AMS_2008.pdf', 'page': 236}\",\"stable cylindrical shape. Curved tape springs provide a self-latching function.<br>Fundamental studies of design and performance of these elements were carried out<br>by Pellegrino and Steffen [2] [3] at the University of Cambridge. The schematic<br>bending behavior is illustrated in Figure 2.  The tape springs are stiff until<br>they buckle under a bending moment. In the buckling zone, the affected  cross<br>section is flattened. The peak value is higher for bending against the tape<br>spring curvature  (opposite sense) than for equal sense bending. The steady<br>state moments are almost equal in both  directions The challenge in using an ECH<br>design is building a high deformable hinge with sufficient deployment  torque<br>and end stiffness. This was solved by using curved spring elements of different<br>length. The longer  222{'source': 'AMS_2008.pdf', 'page': 236}\",3,\"Chunks\"],[\"5f90e1c4-bd43-11ee-801f-bae7cd9d315f\",6.1955327988,15.9153556824,\"88 The REACT design employs  a segmented nut configuration, where the load is connected with a standard  threaded interface. The nut is  split in 3 segments. The mechanism is based on an over -center configuration.  The thread segments are connected by link bars to a third element, called the external ring, which has a  single degree of freedom in the longitudinal axis. The external ring is blocked in the preload or reset  configuration by a set of balls, maintaining the nut segment s closed and therefore supporting the external  load. Once a trigger element, motorized by means of SMA initiators, unblocks the balls, the external ring is  moved to a second position by internal springs. At this position, the nut segments are open and the load is  released.  \\n\\nThe new mechanism allows its reset by simple manual operations from the interface plane, by returning the  external ring to the reset position with a simple tool. This reduces the complexity of AIT operations, reducing  costs and improving system operations.  \\n\\nFigure 1. REACT QM Models. Different sizes and mechanical interfaces.  \\n\\nDevelopment of Shape Memory Alloy Technologies for High Temperature Environments  \\n\\nREACT actuator uses a trigger system based on a SMA wire, which at the environment temperature is in  the low temperature phase called martensite. When heat ed, this SMA fibre contracts by shape memory  effect once its transformation to the high temperature phase (austenite) is reached. During this contraction,  the SMA fibre pro duces a force high enough to trigger the mechanism.  \\n\\nTwo different SMA can be used in REACT. A commercial NiTi alloy is used for operation temperatures{'source': 'AMS_2020.pdf', 'page': 98}\",\"88 The REACT design employs  a segmented nut configuration, where the load is<br>connected with a standard  threaded interface. The nut is  split in 3 segments.<br>The mechanism is based on an over -center configuration.  The thread segments<br>are connected by link bars to a third element, called the external ring, which<br>has a  single degree of freedom in the longitudinal axis. The external ring is<br>blocked in the preload or reset  configuration by a set of balls, maintaining<br>the nut segment s closed and therefore supporting the external  load. Once a<br>trigger element, motorized by means of SMA initiators, unblocks the balls, the<br>external ring is  moved to a second position by internal springs. At this<br>position, the nut segments are open and the load is  released.    The new<br>mechanism allows its reset by simple manual operations from the interface plane,<br>by returning the  external ring to the reset position with a simple tool. This<br>reduces the complexity of AIT operations, reducing  costs and improving system<br>operations.    Figure 1. REACT QM Models. Different sizes and mechanical<br>interfaces.    Development of Shape Memory Alloy Technologies for High<br>Temperature Environments    REACT actuator uses a trigger system based on a SMA<br>wire, which at the environment temperature is in  the low temperature phase<br>called martensite. When heat ed, this SMA fibre contracts by shape memory<br>effect once its transformation to the high temperature phase (austenite) is<br>reached. During this contraction,  the SMA fibre pro duces a force high enough<br>to trigger the mechanism.    Two different SMA can be used in REACT. A<br>commercial NiTi alloy is used for operation temperatures{'source':<br>'AMS_2020.pdf', 'page': 98}\",3,\"Chunks\"],[\"602eb9a8-bd43-11ee-801f-bae7cd9d315f\",5.4163899422,16.7170963287,\"165 Percussion Mechanism  for the Mars  2020 Coring Drill  \\n\\nKyle Chrystal* \\n\\nAbstract  \\n\\nThe Mars  2020 rover includes a Sampling & Caching Subsystem that is required to acquire core samples  of hard rocks and to abrade rocky surfaces flat and smooth in order to facilitate surface science . Hard, high  strength rocks exhibit brittle failure modes, and can be drilled and chiseled efficiently using percussive  impacts . The coring drill percussion mechanism was designed to provide those impacts with variable output  force and to be used with various drill bits . A unique hammering mechanism, using a base- driven hammer,  powered by a conventional rotary actuator driving a Scotch yoke, was designed to robustly provide the  required function in a Martian environment for a life exceeding 2 million impacts.  \\n\\nIntroduction  \\n\\nThe coring drill, also called the \\u201ccorer ,\\u201d is the sampling tool on the turret at the end of the rover\\u2019s robotic  arm. The primary functions of the corer are to drill into the surface with a coring bit to generate a rock core  sample and to abrade the surface with an abrasion bit . The abrasion bit creat es a spot-faced surface that  allows other turret -mounted instruments to perform contact surface science. Hard rocks are not generally  worked by cutting. They  are usually either fractured apart (a brittle failure of the rock) by some form of  chiseling or spalling or they are ground down when abraded by a harder material than the rock . A practical   method for fracturing  chips from a rocky  surface is to use a percussive impact  to chisel chips from the{'source': 'AMS_2020.pdf', 'page': 175}\",\"165 Percussion Mechanism  for the Mars  2020 Coring Drill    Kyle Chrystal*<br>Abstract    The Mars  2020 rover includes a Sampling & Caching Subsystem that is<br>required to acquire core samples  of hard rocks and to abrade rocky surfaces<br>flat and smooth in order to facilitate surface science . Hard, high  strength<br>rocks exhibit brittle failure modes, and can be drilled and chiseled efficiently<br>using percussive  impacts . The coring drill percussion mechanism was designed<br>to provide those impacts with variable output  force and to be used with various<br>drill bits . A unique hammering mechanism, using a base- driven hammer,  powered<br>by a conventional rotary actuator driving a Scotch yoke, was designed to<br>robustly provide the  required function in a Martian environment for a life<br>exceeding 2 million impacts.    Introduction    The coring drill, also called<br>the \\u201ccorer ,\\u201d is the sampling tool on the turret at the end of the rover\\u2019s<br>robotic  arm. The primary functions of the corer are to drill into the surface<br>with a coring bit to generate a rock core  sample and to abrade the surface with<br>an abrasion bit . The abrasion bit creat es a spot-faced surface that  allows<br>other turret -mounted instruments to perform contact surface science. Hard rocks<br>are not generally  worked by cutting. They  are usually either fractured apart<br>(a brittle failure of the rock) by some form of  chiseling or spalling or they<br>are ground down when abraded by a harder material than the rock . A practical<br>method for fracturing  chips from a rocky  surface is to use a percussive impact<br>to chisel chips from the{'source': 'AMS_2020.pdf', 'page': 175}\",3,\"Chunks\"],[\"60f3cd88-bd43-11ee-801f-bae7cd9d315f\",6.2304821014,13.7761545181,\"SP-3 (MoS 2 impregnated) was sufficiently flexible that it could be wound in on itself and inserted past the  shoulder of the groove (see Figure 8) and as it turned out the Vespel\\u00ae SP-3 was also slightly slower wearing  than the prior metal\\/polymer composite bushing, a Glacier Garlock Bearings (now \\u201cGGB\\u201d) DP4\\u00ae. A key  take- away for other percussion mechanisms is to reduce or eliminate small parts whenever possible that  might not easily be able to grow to accommodate high loads , and particularly to expect high reversing l oads  at the back end of the hammer or striker.  \\n\\nChallenge: High drag during cold operation{'source': 'AMS_2020.pdf', 'page': 186}\",\"SP-3 (MoS 2 impregnated) was sufficiently flexible that it could be wound in on<br>itself and inserted past the  shoulder of the groove (see Figure 8) and as it<br>turned out the Vespel\\u00ae SP-3 was also slightly slower wearing  than the prior<br>metal\\/polymer composite bushing, a Glacier Garlock Bearings (now \\u201cGGB\\u201d) DP4\\u00ae. A<br>key  take- away for other percussion mechanisms is to reduce or eliminate small<br>parts whenever possible that  might not easily be able to grow to accommodate<br>high loads , and particularly to expect high reversing l oads  at the back end<br>of the hammer or striker.    Challenge: High drag during cold<br>operation{'source': 'AMS_2020.pdf', 'page': 186}\",3,\"Chunks\"],[\"62533b6e-bd43-11ee-801f-bae7cd9d315f\",6.2289733887,13.4653167725,\"304 there is no retainer, if this orbit was left unchecked, it would result in the ball orbiting out of the two parallel  sample discs, causing the two plates to contact each other.  Fortunately, as the ball reaches the completion  of each revolution, it is pushed back into its original orbit radius by contacting what is known as the guide  plate.  The test is initiated with the sample ball touching the guide plate, which sets the initial orbit radius,  and is adjustable.  The guide plate is oriented in a position such that it  contacts the center of the ball on  each revolution. Attached to the guide plate is a charge amplifier force transducer.  This force transducer  measures the reactionary force required for the ball to be scrubbed back into its initial orbit diameter. This  location throughout the orbit is identified as the scrub region. As the lubricant becomes consumed or  degrades, this force will naturally increase.     \\n\\nFigure 2. Spiral Orbit Tribometer mechanisms, Image courtesy of Spiralab  \\n\\nVacuum Bearing Testing :  The apparatus used for these experiments tests a single angular contact ball bearing. The system operates  at a vacuum level better than 5.0 x 10- 7 Pa, from 1 to 500 R PM, up to 200\\u00b0C, and loads to 450 N. The  system uses dead weight loading and either a heat lamp or band heater. The system also measures cross  bearing electrical resistance, which is used to monitor the operating regime. Bearing torque, load, chamber  press ure, and cross bearing resistance are recorded using a data acquisition system. The system uses a  single SKF 7204 1219 ( 52100 steel) angular contact bearing. The bearing has an outside diameter of 47{'source': 'AMS_2020.pdf', 'page': 314}\",\"304 there is no retainer, if this orbit was left unchecked, it would result in<br>the ball orbiting out of the two parallel  sample discs, causing the two plates<br>to contact each other.  Fortunately, as the ball reaches the completion  of each<br>revolution, it is pushed back into its original orbit radius by contacting what<br>is known as the guide  plate.  The test is initiated with the sample ball<br>touching the guide plate, which sets the initial orbit radius,  and is<br>adjustable.  The guide plate is oriented in a position such that it  contacts<br>the center of the ball on  each revolution. Attached to the guide plate is a<br>charge amplifier force transducer.  This force transducer  measures the<br>reactionary force required for the ball to be scrubbed back into its initial<br>orbit diameter. This  location throughout the orbit is identified as the scrub<br>region. As the lubricant becomes consumed or  degrades, this force will<br>naturally increase.       Figure 2. Spiral Orbit Tribometer mechanisms, Image<br>courtesy of Spiralab    Vacuum Bearing Testing :  The apparatus used for these<br>experiments tests a single angular contact ball bearing. The system operates  at<br>a vacuum level better than 5.0 x 10- 7 Pa, from 1 to 500 R PM, up to 200\\u00b0C, and<br>loads to 450 N. The  system uses dead weight loading and either a heat lamp or<br>band heater. The system also measures cross  bearing electrical resistance,<br>which is used to monitor the operating regime. Bearing torque, load, chamber<br>press ure, and cross bearing resistance are recorded using a data acquisition<br>system. The system uses a  single SKF 7204 1219 ( 52100 steel) angular contact<br>bearing. The bearing has an outside diameter of 47{'source': 'AMS_2020.pdf',<br>'page': 314}\",3,\"Chunks\"],[\"659209cc-bd43-11ee-801f-bae7cd9d315f\",2.9450788498,13.4058151245,\"and constants given as input, constraints are generated and cover geometry consistency, targeted stiffness ,  angle, stress limit and buckling factors. T he optimization process starts from the initial set of variables . The  optimizati on process is done in two steps. Optimization loops are performed using analytical formulas that  calculate axial, radial, bending and torsional stiffness as well as the stresses  and buckling factors .  Consistency of these formulas has been correlated with f inite element analysis during process  development. The optimization aims at minimizing torsional stiffness, volume,  and the deviation between  targeted and computed rotation angles while maximizing buckling factors and stress performances. In a  second step,  a complete finite element loop is performed to evaluate the requirements. Correction factors  between FE analysis and analytical approach are then computed and considered in the next analytical  iterations. The optimal solution is reached when convergence of these correction factors is met.  The generic  flow logic of the optimization algorithm is shown in Figure 3. \\n\\nFigure 3: Optim ization methodology{'source': 'AMS_2020.pdf', 'page': 515}\",\"and constants given as input, constraints are generated and cover geometry<br>consistency, targeted stiffness ,  angle, stress limit and buckling factors. T<br>he optimization process starts from the initial set of variables . The<br>optimizati on process is done in two steps. Optimization loops are performed<br>using analytical formulas that  calculate axial, radial, bending and torsional<br>stiffness as well as the stresses  and buckling factors .  Consistency of these<br>formulas has been correlated with f inite element analysis during process<br>development. The optimization aims at minimizing torsional stiffness, volume,<br>and the deviation between  targeted and computed rotation angles while<br>maximizing buckling factors and stress performances. In a  second step,  a<br>complete finite element loop is performed to evaluate the requirements.<br>Correction factors  between FE analysis and analytical approach are then<br>computed and considered in the next analytical  iterations. The optimal solution<br>is reached when convergence of these correction factors is met.  The generic<br>flow logic of the optimization algorithm is shown in Figure 3.   Figure 3: Optim<br>ization methodology{'source': 'AMS_2020.pdf', 'page': 515}\",3,\"Chunks\"],[\"f723a6bc-bd42-11ee-801f-bae7cd9d315f\",6.2389411926,13.8284502029,\"Table 2. Ratchet wheel rotations to failure, no MoS2 on gears, no MoS2 on bearings  CP008  CP009 12 Feb 2003 180 Rough manual rotation  14 Feb 2003 260 Rough manual rotation  Several units with the wear resistant outboard gear were tested with the same disappointing result: the  units failed to operate after a few ratchet wheel cycles, and there was a thick powdered layer at the wear  zone on the gear teeth (Table 3 and Figure 5). The wear zone on the new outboard gear appeared to be  even heavier than the wear zone on the trials from Tables 1 and 2. The rotors spun roughly after the life  test. The bearings were observed to have a roughened surface on the inboard rotor, but only slightly  roughened on the outboard or stator bearings. The long stringers observed in Figure 5 on the edge of the  gear are composed of many fine particles that are magnetized. These magnetized stringers appear at the  edges of other parts as well as the gear teeth. A schematic of the solenoid is shown in Figure 6. The  solenoid bearings from left to right will be numbered 1 through 4 in many of the descriptions to follow. The  outboard rotor bearings are 1 and 2 while the inboard rotor bearings are 3 and 4.  Figure 5. Wear particles generated due to a Nitronic 60 gear tooth interface  30{'source': 'AMS_2006.pdf', 'page': 44}\",\"Table 2. Ratchet wheel rotations to failure, no MoS2 on gears, no MoS2 on<br>bearings  CP008  CP009 12 Feb 2003 180 Rough manual rotation  14 Feb 2003 260<br>Rough manual rotation  Several units with the wear resistant outboard gear were<br>tested with the same disappointing result: the  units failed to operate after a<br>few ratchet wheel cycles, and there was a thick powdered layer at the wear  zone<br>on the gear teeth (Table 3 and Figure 5). The wear zone on the new outboard gear<br>appeared to be  even heavier than the wear zone on the trials from Tables 1 and<br>2. The rotors spun roughly after the life  test. The bearings were observed to<br>have a roughened surface on the inboard rotor, but only slightly  roughened on<br>the outboard or stator bearings. The long stringers observed in Figure 5 on the<br>edge of the  gear are composed of many fine particles that are magnetized. These<br>magnetized stringers appear at the  edges of other parts as well as the gear<br>teeth. A schematic of the solenoid is shown in Figure 6. The  solenoid bearings<br>from left to right will be numbered 1 through 4 in many of the descriptions to<br>follow. The  outboard rotor bearings are 1 and 2 while the inboard rotor<br>bearings are 3 and 4.  Figure 5. Wear particles generated due to a Nitronic 60<br>gear tooth interface  30{'source': 'AMS_2006.pdf', 'page': 44}\",3,\"Chunks\"],[\"f9764712-bd42-11ee-801f-bae7cd9d315f\",2.3319749832,17.7368297577,\"Summary of the New AlAA Moving Mechanical Assemblies Standard  Brian W. Gore\\u2019  Abstract  A new American Institute of Aeronautics and Astronautics (AIAA) standard entitled \\u201cMoving Mechanical  Assemblies for Space and Launch Vehicles,\\u201d AIAA-S-114-2005, has been created. It is based on Military  Specification MIL-A-835776, which was cancelled by the Department of Defense in the mid-1 990\\u2019s. The  new standard supersedes a Technical Operating Report (TOR) (prepared by Brian W. Gore of The  Aerospace Corporation with support from the Air Force Space and Missile Center and the National  Reconnaissance Office, which was a \\u201ccleaned-up,\\u2019\\u2019 same-format version of MIL-A-83577B) and has  already been used as a compliance document in several recent acquisitions and Requests For Proposals.  This paper outlines some of the more significant changes and additions made in the new AlAA MMA  Standard since the previous TOR and MMA specification were released.  Introduction  The U.S. Air Force (USAF) Space and Missile Center (SMC) and the National Reconnaissance Office  (NRO) have recently established policies supporting and requiring government, industry, and professional  society specifications and standards for new acquisitions.  NAn  S414-20@5  -1 Standard  Moving Mechanical Assemblies  for Space and Launch Vehicles  The Aerospace Corporation, El Segundo, CA  Proceedings of the 3dh Aerospace Mechanisms Symposium, Langley Research Center, May 17- 19,2006  103{'source': 'AMS_2006.pdf', 'page': 117}\",\"Summary of the New AlAA Moving Mechanical Assemblies Standard  Brian W. Gore\\u2019<br>Abstract  A new American Institute of Aeronautics and Astronautics (AIAA)<br>standard entitled \\u201cMoving Mechanical  Assemblies for Space and Launch Vehicles,\\u201d<br>AIAA-S-114-2005, has been created. It is based on Military  Specification<br>MIL-A-835776, which was cancelled by the Department of Defense in the mid-1<br>990\\u2019s. The  new standard supersedes a Technical Operating Report (TOR) (prepared<br>by Brian W. Gore of The  Aerospace Corporation with support from the Air Force<br>Space and Missile Center and the National  Reconnaissance Office, which was a<br>\\u201ccleaned-up,\\u2019\\u2019 same-format version of MIL-A-83577B) and has  already been used<br>as a compliance document in several recent acquisitions and Requests For<br>Proposals.  This paper outlines some of the more significant changes and<br>additions made in the new AlAA MMA  Standard since the previous TOR and MMA<br>specification were released.  Introduction  The U.S. Air Force (USAF) Space and<br>Missile Center (SMC) and the National Reconnaissance Office  (NRO) have recently<br>established policies supporting and requiring government, industry, and<br>professional  society specifications and standards for new acquisitions.  NAn<br>S414-20@5  -1 Standard  Moving Mechanical Assemblies  for Space and Launch<br>Vehicles  The Aerospace Corporation, El Segundo, CA  Proceedings of the 3dh<br>Aerospace Mechanisms Symposium, Langley Research Center, May 17- 19,2006<br>103{'source': 'AMS_2006.pdf', 'page': 117}\",3,\"Chunks\"],[\"f9764780-bd42-11ee-801f-bae7cd9d315f\",1.7928116322,17.0741825104,\"Comments  %- General  8%  Figure 1. Breakdown of Submitted MMA Standard Comments  Moreover, after the final draft of the standard was prepared, AlAA initiated a 30-day public review period,  which yielded still more comments, for a grand total of approximately 400 submissions by members of  Aerospace, many contractors, NASA, etc. Figure 2 illustrates the approximate number of comments by  submitting individuals. Some of the people listed were points of contact from their entire organization.  107{'source': 'AMS_2006.pdf', 'page': 121}\",\"Comments  %- General  8%  Figure 1. Breakdown of Submitted MMA Standard Comments<br>Moreover, after the final draft of the standard was prepared, AlAA initiated a<br>30-day public review period,  which yielded still more comments, for a grand<br>total of approximately 400 submissions by members of  Aerospace, many<br>contractors, NASA, etc. Figure 2 illustrates the approximate number of comments<br>by  submitting individuals. Some of the people listed were points of contact<br>from their entire organization.  107{'source': 'AMS_2006.pdf', 'page': 121}\",3,\"Chunks\"],[\"f97647f8-bd42-11ee-801f-bae7cd9d315f\",3.8718698025,17.7830696106,\"Lessons Learned From the Development, Operation, and Review of Mechanical  Systems on the Space Shuttle, International Space Station, and Payloads  Alison Dinsel', Wayne Jermstad', and Brandan Robertson'  Abstract  The Mechanical Design and Analysis Branch at the Johnson Space Center (JSC) is responsible for the  technical oversight of over 30 mechanical systems flying on the Space Shuttle Orbiter and the  International Space Station (ISS). The branch also has the responsibility for reviewing all mechanical  systems on all Space Shuttle and International Space Station payloads, as part of the payload safety  review process, through the Mechanical Systems Working Group (MSWG). These responsibilities give the  branch unique insight into a large number of mechanical systems, and problems encountered during their  design, testing, and operation. This paper contains narrative descriptions of lessons learned from some of  the major problems worked on by the branch during the last two years. The problems are grouped into  common categories and lessons learned are stated.  Introduction  The Mechanical Design and Analysis Branch at JSC is responsible for the technical oversight of over 30  mechanical systems flying on the Space Shuttle Orbiter and the ISS. The branch houses the MSWG,  which has the responsibility to review all mechanical systems on all Space Shuttle Program (SSP) and ISS  payloads to verify compliance with the fault tolerance requirements as part of the payload safety review  process. These responsibilities give the branch unique insight into a large number of mechanical systems,  and problems encountered during their design, development, testing, and operation.  This paper describes some of the recent problems worked by the branch, and lessons that can be learned  from them to improve future mechanical systems. The paper contains narrative descriptions of some of  these problems. The problems are grouped into common categories and lessons learned are stated. The{'source': 'AMS_2006.pdf', 'page': 127}\",\"Lessons Learned From the Development, Operation, and Review of Mechanical<br>Systems on the Space Shuttle, International Space Station, and Payloads  Alison<br>Dinsel', Wayne Jermstad', and Brandan Robertson'  Abstract  The Mechanical<br>Design and Analysis Branch at the Johnson Space Center (JSC) is responsible for<br>the  technical oversight of over 30 mechanical systems flying on the Space<br>Shuttle Orbiter and the  International Space Station (ISS). The branch also has<br>the responsibility for reviewing all mechanical  systems on all Space Shuttle<br>and International Space Station payloads, as part of the payload safety  review<br>process, through the Mechanical Systems Working Group (MSWG). These<br>responsibilities give the  branch unique insight into a large number of<br>mechanical systems, and problems encountered during their  design, testing, and<br>operation. This paper contains narrative descriptions of lessons learned from<br>some of  the major problems worked on by the branch during the last two years.<br>The problems are grouped into  common categories and lessons learned are stated.<br>Introduction  The Mechanical Design and Analysis Branch at JSC is responsible<br>for the technical oversight of over 30  mechanical systems flying on the Space<br>Shuttle Orbiter and the ISS. The branch houses the MSWG,  which has the<br>responsibility to review all mechanical systems on all Space Shuttle Program<br>(SSP) and ISS  payloads to verify compliance with the fault tolerance<br>requirements as part of the payload safety review  process. These<br>responsibilities give the branch unique insight into a large number of<br>mechanical systems,  and problems encountered during their design, development,<br>testing, and operation.  This paper describes some of the recent problems worked<br>by the branch, and lessons that can be learned  from them to improve future<br>mechanical systems. The paper contains narrative descriptions of some of  these<br>problems. The problems are grouped into common categories and lessons learned<br>are stated. The{'source': 'AMS_2006.pdf', 'page': 127}\",3,\"Chunks\"],[\"fa0b3160-bd42-11ee-801f-bae7cd9d315f\",6.2182073593,15.4594306946,\"aluminum. Other materials were considered for the shrouds but aluminum was selected for both for weight  and manufacturability.  Figure 3. The Scan Drive Mechanism mounted on the ATMS instrument illustrates the packaging  challenge of this design. Two motors, two resolvers, two pairs of bearings, and a  flywheel must fit in the center section between the two spherical shrouds.  Desian for Manufacturabilitv.  The scan drive mechanism design not only met very tight packaging goals and weight requirement but  was created as a modular assembly that allowed assembly, disassembly (when required), and test as  subassemblies. This approach provided schedule and work load flexibility during assembly and test. The  modular design of the scan drive mechanism can be seen in Figure 5 where the main motor subassembly  and compensation flywheel subassembly are on the work bench together. The subassembly approach  also allowed for the separate balancing of the main assembly with the reflectors and the compensating  assembly with the flywheel.  Fabrication of the spherical shrouds and a repeatable method of assembling and disassembling the  shroud halves with the scan drive mechanism was another important manufacturing challenge. The  shrouds attach to rings that have floating nut plates and locating pins for repeatable reattachment of the  shrouds. The shrouds are split along a horizontal seam to allow removal of the upper shroud half during  reflector alignment verification (see Figure 6). The shrouds are rough machined out of one piece of  aluminum and then split along the horizontal seam. The spherical shape of shrouds provided a maximum  view factor for each reflector and covered the warm calibration source inside the ATMS during earth scan.  199{'source': 'AMS_2006.pdf', 'page': 213}\",\"aluminum. Other materials were considered for the shrouds but aluminum was<br>selected for both for weight  and manufacturability.  Figure 3. The Scan Drive<br>Mechanism mounted on the ATMS instrument illustrates the packaging  challenge of<br>this design. Two motors, two resolvers, two pairs of bearings, and a  flywheel<br>must fit in the center section between the two spherical shrouds.  Desian for<br>Manufacturabilitv.  The scan drive mechanism design not only met very tight<br>packaging goals and weight requirement but  was created as a modular assembly<br>that allowed assembly, disassembly (when required), and test as  subassemblies.<br>This approach provided schedule and work load flexibility during assembly and<br>test. The  modular design of the scan drive mechanism can be seen in Figure 5<br>where the main motor subassembly  and compensation flywheel subassembly are on<br>the work bench together. The subassembly approach  also allowed for the separate<br>balancing of the main assembly with the reflectors and the compensating<br>assembly with the flywheel.  Fabrication of the spherical shrouds and a<br>repeatable method of assembling and disassembling the  shroud halves with the<br>scan drive mechanism was another important manufacturing challenge. The  shrouds<br>attach to rings that have floating nut plates and locating pins for repeatable<br>reattachment of the  shrouds. The shrouds are split along a horizontal seam to<br>allow removal of the upper shroud half during  reflector alignment verification<br>(see Figure 6). The shrouds are rough machined out of one piece of  aluminum and<br>then split along the horizontal seam. The spherical shape of shrouds provided a<br>maximum  view factor for each reflector and covered the warm calibration source<br>inside the ATMS during earth scan.  199{'source': 'AMS_2006.pdf', 'page': 213}\",3,\"Chunks\"],[\"fe7449da-bd42-11ee-801f-bae7cd9d315f\",6.0122404099,13.2945137024,\"47 Ambient Life Test Results Summary  The two Melonite Harmonic Drive gears (36638-1 and 36638-3) were eliminated from contention due to  the reduction in torsional stiffness at the end of life and the presence of relatively large particles of metallic debris in the gear mesh. The two non-Melonite Harmonic Drive gears (36638-2 & 36638-4) were relatively comparable. 36638-2 visually looked slightly better, (primarily with regard to the circular spline teeth and gear lubricant) but the 36638-4 was nonetheless acceptable. The concern over how 15-5PH against 15-5PH would perform during vibration and in a vacuum environment, resulted in the 36638-4 configuration (15-5\\/Nitronic) being chosen as the least risky path forward for the flight build. A qualitative assessment of the key parameters of the post- life inspection is shown in Table 3. In parallel with building flight hardware with the chosen configuration, the program decided to further this study by performing a vacuum life test comparison between the non-Melonite drive configurations (36638-2 & 36638-4). \\n\\nTable 3:  Qualitative Summary of Ambient Life Test Results   36638-1   15-5\\/Melonite  36638-2   15-5\\/15-5  36638-3   Nitronic\\/Melonite  36638-4   Nitronic\\/15-5   Stiffness Change Poor Good Poor Good  Circular Spline Tooth Wear Poor Average Poor Average  Flex Spline Tooth Wear Good Average Good Average  Flex Spline Cup Good Average Good Average  Wave Generator OD Average Average Average Average  Gear Teeth Lube Poor Average Poor Average  Wave Generator Lube Good Average Good Average \\n\\nVacuum Life Test Plan{'source': 'AMS_2012.pdf', 'page': 61}\",\"47 Ambient Life Test Results Summary  The two Melonite Harmonic Drive gears<br>(36638-1 and 36638-3) were eliminated from contention due to  the reduction in<br>torsional stiffness at the end of life and the presence of relatively large<br>particles of metallic debris in the gear mesh. The two non-Melonite Harmonic<br>Drive gears (36638-2 & 36638-4) were relatively comparable. 36638-2 visually<br>looked slightly better, (primarily with regard to the circular spline teeth and<br>gear lubricant) but the 36638-4 was nonetheless acceptable. The concern over how<br>15-5PH against 15-5PH would perform during vibration and in a vacuum<br>environment, resulted in the 36638-4 configuration (15-5\\/Nitronic) being chosen<br>as the least risky path forward for the flight build. A qualitative assessment<br>of the key parameters of the post- life inspection is shown in Table 3. In<br>parallel with building flight hardware with the chosen configuration, the<br>program decided to further this study by performing a vacuum life test<br>comparison between the non-Melonite drive configurations (36638-2 & 36638-4).<br>Table 3:  Qualitative Summary of Ambient Life Test Results   36638-1<br>15-5\\/Melonite  36638-2   15-5\\/15-5  36638-3   Nitronic\\/Melonite  36638-4<br>Nitronic\\/15-5   Stiffness Change Poor Good Poor Good  Circular Spline Tooth Wear<br>Poor Average Poor Average  Flex Spline Tooth Wear Good Average Good Average<br>Flex Spline Cup Good Average Good Average  Wave Generator OD Average Average<br>Average Average  Gear Teeth Lube Poor Average Poor Average  Wave Generator Lube<br>Good Average Good Average   Vacuum Life Test Plan{'source': 'AMS_2012.pdf',<br>'page': 61}\",3,\"Chunks\"],[\"ff4c9754-bd42-11ee-801f-bae7cd9d315f\",5.9613404274,12.9062099457,\"62 Tests with older curved rotors using the M-15 stator also showed the same excellent results indicating  that the issue was with the CP49 material and not anything else. The lesson learned here is that FEA analysis is a path towards good designs but is not the end all. Practical machines with practical materials must ultimately be the final say. We stayed with the flat magnets because we had purchased the entire programs supply. In retrospect, had we had been able to have gone with the M-15 material (usually our preferred material for this type of motor) most of these delays and perturbations relative to the harmonics would not have occurred or been necessary. A photo of the G motor is shown in Figure 13.  The data in Figure 12 shows the distortion improvement with the M-15 material from 2.79% to 1.57%.  Fundamental 18.4 volts; 5 th Harmonic at 0.26 volts   Harmonic distortion = 0.260\\/18.4 = 0.0157 = 1.57% \\n\\nFigure 12.  M-15 Harmonic Distortion Data for the M-15 Material \\n\\nFigure 13.  Photo of the G Motor - Rotor is encapsulated in titanium ring \\n\\nMajor Motor Parameters for H Motor   The H motor, also an inside out design, presented with a whole different set of issues. The initial design  using CP49 and Samarium Cobalt magnets resulted so enormous a difference between performance and requirements that an initial drastic step needed to be taken before any iteration would be possible.{'source': 'AMS_2012.pdf', 'page': 76}\",\"62 Tests with older curved rotors using the M-15 stator also showed the same<br>excellent results indicating  that the issue was with the CP49 material and not<br>anything else. The lesson learned here is that FEA analysis is a path towards<br>good designs but is not the end all. Practical machines with practical materials<br>must ultimately be the final say. We stayed with the flat magnets because we had<br>purchased the entire programs supply. In retrospect, had we had been able to<br>have gone with the M-15 material (usually our preferred material for this type<br>of motor) most of these delays and perturbations relative to the harmonics would<br>not have occurred or been necessary. A photo of the G motor is shown in Figure<br>13.  The data in Figure 12 shows the distortion improvement with the M-15<br>material from 2.79% to 1.57%.  Fundamental 18.4 volts; 5 th Harmonic at 0.26<br>volts   Harmonic distortion = 0.260\\/18.4 = 0.0157 = 1.57%   Figure 12.  M-15<br>Harmonic Distortion Data for the M-15 Material   Figure 13.  Photo of the G<br>Motor - Rotor is encapsulated in titanium ring   Major Motor Parameters for H<br>Motor   The H motor, also an inside out design, presented with a whole different<br>set of issues. The initial design  using CP49 and Samarium Cobalt magnets<br>resulted so enormous a difference between performance and requirements that an<br>initial drastic step needed to be taken before any iteration would be<br>possible.{'source': 'AMS_2012.pdf', 'page': 76}\",3,\"Chunks\"]]}"
}