{"id": "AMS_2006.pdf_10210eb15-5ffa-4936-a833-a83c15df4480", "text": "NASNCP-2006-2 14290  3 sth Aerospace Mechanisms Symposium  Compiled by  Edward A. Boesiger  Lockheed Martin Space Systems Company, Sunnyvale, California  Proceedings of a symposium hosted by  the NASA Langley Research Center and  Lockheed Martin Space Systems Company and  organized by the Mechanisms Education Association  held at the Williamsburg Maniott Hotel  Williamsburg, Virginia  May 17- 19,2006  May 2006", "source": "AMS_2006.pdf", "metadata": {"source": "AMS_2006.pdf", "page": "1"}}
{"id": "AMS_2006.pdf_21f5dc771-9f0d-4264-9667-0a217dba9543", "text": "The NASA STI Program Office . . . in Profile  Since its founding, NASA has been dedicated to the  advancement of aeronautics and space science. The  NASA Scientific and Technical Information (STI)  Program Office plays a key part in helping NASA  maintain this important role.  The NASA STI Program Office is operated by  Langley Research Center, the lead center for NASA’s  scientific and technical information. The NASA STI  Program Office provides access to the NASA STI  Database, the largest collection of aeronautical and  space science STI in the world. The Program Office is  also NASA’s institutional mechanism for  disseminating the results of its research and  development activities. These results are published by  NASA in tlie NASA STI Report Series, which  includes the following report types:  0 TECHNICAL PUBLICATION. Reports of  completed research or a major significant phase  of research that present the results of NASA  programs and include extensive data or  theoretical analysis. Includes compilations of  Significant scientific and technical data and  information deemed to be of continuing  reference value. NASA counterpart of peer-  reviewed formal professional papers, but having  less stringent limitations on manuscript length  and extent of graphic presentations.  0 TECHNICAL MEMORANDUM. Scientific  and technical findings that are preliminary or of  specialized interest, e.g., quick release reports,  working papers, and bibliographies that contain  minimal annotation. Does not contain extensive  analysis.  0 CONTRACTOR REPORT. Scientific and  technical findings by NASA-sponsored  contractors and grantees. CONFERENCE PUBLICATION. Collected  papers from scientific and technical  conferences, symposia, seminars, or other  meetings sponsored or co-sponsored by NASA.  SPECIAL PUBLICATION. Scientific,  technical, or historical information from NASA  programs, projects, and missions, often  concerned with subjects having substantial  public interest.  TECHNICAL TRANSLATION. English-  language translations of foreign scientific and  technical material pertinent to NASA’s mission.  Specialized services that complement the STI  Program Office’s diverse offerings iiiclude creating  custom thesauri, building customized databases,  organizing and publishing research results .. . even  providing videos.  For more information about the NASA STI Program  Office, see the following:  Access the NASA STI Program Home Page at  http://www.sti. nasa.gov  E-mail your question via tlie Internet to  help@sti.nasa.gov  Fax your question to the NASA STI Help Desk  at (301) 621-0134  Phone the NASA STI Help Desk at  (301) 621-0390  Write to: .1  NASA STI Help Desk  NASA Center for Aerospace Information  7 12 1 Standard Drive  Hanover, MD 2 1076- 1320", "source": "AMS_2006.pdf", "metadata": {"source": "AMS_2006.pdf", "page": "2"}}
{"id": "AMS_2006.pdf_38314d9b1-5625-4194-8083-16a3954157f3", "text": "NASA/CP-2006-2 14290  3 8th Aerospace Mechanisms Symposium  Compiled by  Edward A. Boesiger  Lockheed Martin Space Systems Company, Sunnyvale, California  Proceedings of a symposium hosted by  the NASA Langley Research Center and  Lockheed Martin Space Systems Company and  organized by the Mechanisms Education Association  held at the Williamsburg Marriott Hotel  Williamsburg, Virginia  May 17- 19,2006  National Aeronautics and  Space Administration  Langley Research Center  Hampton, Virginia 2368 1-2 199", "source": "AMS_2006.pdf", "metadata": {"source": "AMS_2006.pdf", "page": "3"}}
{"id": "AMS_2006.pdf_41dededad-0ab9-4d3a-9e61-db0137de9194", "text": "The use of trademarks or names of manufacturers in the report is for accurate reporting and does not  constitute an official endorsement, either expressed or implied, of such products or manufacturers by the  National Aeronautics and Space Administration.  Available from:  NASA Center for Aerospace Information (CASI)  7 12 1 Standard Drive  Hanover, MD 2 1076- 1320  (301) 621-0390 National Technical Information Service (NTIS)  5285 Port Royal Road  Springfield, VA 22 16 1-2 17 1  (703) 605-6000", "source": "AMS_2006.pdf", "metadata": {"source": "AMS_2006.pdf", "page": "4"}}
{"id": "AMS_2006.pdf_5f1b36457-37ba-4656-b6b0-5ed2cc09e8b4", "text": "PREFACE  The Aerospace Mechanisms Symposium (AMS) provides a unique forum for those  active in the design, production and use of aerospace mechanisms. A major focus is  the reporting of problems and solutions associated with the development and flight  certification of new mechanisms. Organized by the Mechanisms Education Association,  the National Aeronautics and Space Administration and Lockheed Martin Space  Systems Company (LMSSC) share the responsibility for hosting the AMs. Now in its  38fh symposium, the AMS continues to be well attended, attracting participants from  both the US. and abroad.  The 38fh AMs, hosted by the Langley Research Center (LaRC) in Williamsburg,  Virginia, was held May 17, 18 and 19, 2006. During these three days, 34 papers were  presented. Topics included gimbals, tribology, actuators, aircraft mechanisms,  deployment mechanisms, release mechanisms, and test equipment. Hardware displays  during the supplier exhibit gave attendees an opportunity to meet with developers of  current and future mechanism components.  The high quality of this symposium is a result of the work of many people, and their  efforts are gratefully acknowledged. This extends to the voluntary members of the  symposium organizing committee representing the eight NASA field centers, LMSSC,  and the European Space Agency. Appreciation is also extended to the session chairs,  the authors, and particularly the personnel at LaRC responsible for the symposium  arrangements and the publication of these proceedings. A sincere thank you also goes  to the symposium executive committee who is responsible for the year-to-year  management of the AMs, including paper processing and preparation of the program.  The use of trade names of manufacturers in this publication does not constitute an  official endorsement of such products or manufacturers, either expressed or implied, by  the National Aeronautics and Space Administration.  ...  111", "source": "AMS_2006.pdf", "metadata": {"source": "AMS_2006.pdf", "page": "5"}}