{"page_content": "390 of safety of two. The analysis model from the torsional stiffness investigation was utilized again for the  torque output investigation, with the application of tip load changed and a small perturbation  force added  on the compressed hinge tape to promote a controlled buckling of the hinge ( Figure 12). \n\nFigure 12: Hinge torque trade study model setup{'source': 'test2.pdf', 'page': 1}", "metadata": {"source": "test2.pdf", "page": 1}, "type": "Document"}
{"page_content": "To maximize the torque output of the hinge the “w”  term from Figure 5 was minimized in order to maximize  the potential energy of the hinge. Verification of this design consisted of first evaluating the material  survivability by modeling the folded hinge with finite element s and using the evaluation methods described  earlier.{'source': 'test2.pdf', 'page': 1}", "metadata": {"source": "test2.pdf", "page": 1}, "type": "Document"}
{"page_content": "Figure 13: Initial torque output capabilities based on hinge geometry and material allowable prediction{'source': 'test2.pdf', 'page': 1}", "metadata": {"source": "test2.pdf", "page": 1}, "type": "Document"}
{"page_content": "Results of th e analytical hinge studies were to select hinges with minimalized “d” and “L” terms for the  hinge, however further investigations using a longer boom which allowed for more continuous deformation  of the tube cross section resulted in the hinge getting deformed far passed its material allowable limits. The  reason this was not seen in the initial investigation was due to the end{'source': 'test2.pdf', 'page': 1}", "metadata": {"source": "test2.pdf", "page": 1}, "type": "Document"}
{"page_content": "conditions creating a rigid circle  relatively close to the hinge cutout area, resulting in artificially positive margins for the area around the  circular cutout. To address this issue the hinges were re- evaluated using a longer tube section ( Figure 14).  This allowed for more natural curvature regions to form around the hinges.{'source': 'test2.pdf', 'page': 1}", "metadata": {"source": "test2.pdf", "page": 1}, "type": "Document"}
{"page_content": "391   Figure 14: Lengthened hinge geometry trade analysis model{'source': 'test2.pdf', 'page': 2}", "metadata": {"source": "test2.pdf", "page": 2}, "type": "Document"}
{"page_content": "This effect was exacerbated by the ability for the full ROC -PDS system to seat itself into a system low  energy state ( Figure 15), where the local curvatures around the hinge often resulted in negative margin.  Analysis results did not conclude with a geometric result which closed for this case, however a design  alteration to the overall system was devised to add rigidity to the loc al area{'source': 'test2.pdf', 'page': 2}", "metadata": {"source": "test2.pdf", "page": 2}, "type": "Document"}
{"page_content": "and hold the hinge open. This  design feature is known as a “power band” and is the topic of another study paper currently in progress at  Roccor.{'source': 'test2.pdf', 'page': 2}", "metadata": {"source": "test2.pdf", "page": 2}, "type": "Document"}
{"page_content": "Figure 15: (Left) High curvatures in full system analysis; (Right) hinge shift into low energy state.{'source': 'test2.pdf', 'page': 2}", "metadata": {"source": "test2.pdf", "page": 2}, "type": "Document"}
{"page_content": "Hinge Torque and Long- term Storage Testing   Full-scale hinged boom testing was used to validate the analysis results and determine the properties of  the hinges where analytical techniques were unable to predict  the behavior  of this complex  system. The  primary test used was hinge torque testing under ambient temperatures and operational temperature  extremes.  This was  coupled with long-{'source': 'test2.pdf', 'page': 2}", "metadata": {"source": "test2.pdf", "page": 2}, "type": "Document"}
{"page_content": "term storage testing to evaluate material survivability  and viscoelastic  effect s on strain energy relaxation.{'source': 'test2.pdf', 'page': 2}", "metadata": {"source": "test2.pdf", "page": 2}, "type": "Document"}
{"page_content": "A torque test fixture was developed and qualified to accurately measure the hinge output torque. This fixture  is shown in Figure 16; the fixture uses torque cells to measure the output torque of each hinge as the boom  is slowly allowed to deploy, resulting in a semi -static torque measurement. This fixture was qualified and  validated by measuring the torque output of an easily modelled{'source': 'test2.pdf', 'page': 2}", "metadata": {"source": "test2.pdf", "page": 2}, "type": "Document"}
{"page_content": "metallic leaf spring.{'source': 'test2.pdf', 'page': 2}", "metadata": {"source": "test2.pdf", "page": 2}, "type": "Document"}
{"page_content": "392   Figure 16: Structural testing of integrated solid- state HSC hinge{'source': 'test2.pdf', 'page': 3}", "metadata": {"source": "test2.pdf", "page": 3}, "type": "Document"}
{"page_content": "The primary resistive torque in this design was due to a flat, flexible electrical harness  inside the boom. The  behavior of this harness depends intimately on the boundary conditions supplied by the boom, so testing  of the harness alone proved impossible. Instead, the hinge torque was measured with and without the  harness , and the harness torque was derived by comparing these two torque{'source': 'test2.pdf', 'page': 3}", "metadata": {"source": "test2.pdf", "page": 3}, "type": "Document"}
{"page_content": "curves. These values were  then used to derive and show deployment torque margin.  A typical torque curve derived from this testing is  shown below in Figure 17.{'source': 'test2.pdf', 'page': 3}", "metadata": {"source": "test2.pdf", "page": 3}, "type": "Document"}
{"page_content": "393 Figure 17 Typical hinge torque of proximal hinge (left) and distal hinge (right).  \n\nLater tests at operational temperature extremes were enabled by constructing a thermal chamber around  the torque test hardware. This testing was both used to directly verify the torque margin and validate the  analytical predictions.{'source': 'test2.pdf', 'page': 4}", "metadata": {"source": "test2.pdf", "page": 4}, "type": "Document"}
{"page_content": "The impacts of the viscoelasticity on the deployment kinematics were also a key risk, and due to a lack of  standardized test methods  and stress relaxation failure models  these impacts are very difficult to analytically  model. Long- term storage testing was therefore used to sim ulate the impact of storage before deployment.  Full-length booms were stowed in the anticipated storage shape, as{'source': 'test2.pdf', 'page': 4}", "metadata": {"source": "test2.pdf", "page": 4}, "type": "Document"}
{"page_content": "shown in Figure 18, and t he timetemper ature superposition relationship was used to reduce the storage time required from years to days .{'source': 'test2.pdf', 'page': 4}", "metadata": {"source": "test2.pdf", "page": 4}, "type": "Document"}
{"page_content": "Figure 18 Long- term storage testing{'source': 'test2.pdf', 'page': 4}", "metadata": {"source": "test2.pdf", "page": 4}, "type": "Document"}
{"page_content": "During and after storage the boom was inspected for damage. The corners of each hinge w ere at particular  risk of stress rupture during long- term storage, so these areas were subjected to extra scrutiny. Detailed  images of these areas are shown in Figure 19. After storage at elevated temperature the kick -off force,  hinge torque, and final boom geometry was measured. These measured values{'source': 'test2.pdf', 'page': 4}", "metadata": {"source": "test2.pdf", "page": 4}, "type": "Document"}
{"page_content": "were fed into the analytical  model to better predict the deployment of the hinged boom after storage.{'source': 'test2.pdf', 'page': 4}", "metadata": {"source": "test2.pdf", "page": 4}, "type": "Document"}
{"page_content": "394   Figure 19 Inspection of the proximal hinge (left) and distal hinge (right).  \n\nThe results of this testing were then used to validate the analytical model , show compliance with  requirements, and provide knock -down factors for post -storage deployments. In particular , the  requirements for long- term storage survival and deployment torque margins were verified directly through  test.{'source': 'test2.pdf', 'page': 5}", "metadata": {"source": "test2.pdf", "page": 5}, "type": "Document"}
{"page_content": "Final Boom Laminate Architecture Features{'source': 'test2.pdf', 'page': 5}", "metadata": {"source": "test2.pdf", "page": 5}, "type": "Document"}
{"page_content": "At the culmination of the development program,  there were several  design features resulting from detailed  analysis and testing efforts done at Roccor. First,  the hinges were strengthened by “power bands” in order  to keep the slit from collapsing when the s ystem is required to be compressed beyond the material limit s of  the hinge deformation. Next, the “razor backs”  were added which are{'source': 'test2.pdf', 'page': 5}", "metadata": {"source": "test2.pdf", "page": 5}, "type": "Document"}
{"page_content": "localized areas with adjusted  thickness used to tune the required torque output of the hinge tapes to develop the required strain energy  balance for the deployment. Last, the “lateral lines”12 were added in the boom, which  are a localized  laminate change which is utilized to tune the kickoff energy of the system. All these features were developed  using the methods described in the previous{'source': 'test2.pdf', 'page': 5}", "metadata": {"source": "test2.pdf", "page": 5}, "type": "Document"}
{"page_content": "section for material allowable calculations , as well as physical  testing for validation of concepts and  verification against flight qualification environments.{'source': 'test2.pdf', 'page': 5}", "metadata": {"source": "test2.pdf", "page": 5}, "type": "Document"}
{"page_content": "Figure 20: ROC -PDS boom design features{'source': 'test2.pdf', 'page': 5}", "metadata": {"source": "test2.pdf", "page": 5}, "type": "Document"}
{"page_content": "395 Conclusions and Lessons Learned{'source': 'test2.pdf', 'page': 6}", "metadata": {"source": "test2.pdf", "page": 6}, "type": "Document"}
{"page_content": "The primary lesson learned from this mission goes back to the age old saying of “test early and test often”.  Much of the issues in this program stemmed from not doing enough validation testing up front to develop a  better understanding of early concepts . A notable lesson from testing early however is that care should be  taken to understand the applicable boundary conditions of the system.{'source': 'test2.pdf', 'page': 6}", "metadata": {"source": "test2.pdf", "page": 6}, "type": "Document"}
{"page_content": "Early trade studies using both  analysis and testing should be carried out with an effort to emulate the final system bou ndary conditions.  Early effort test booms in this program experienced several stress ruptures; these were eliminated by  including the long- term storage test in the development and qualification test flows. In addition, early hinge  torque tests did not incl ude the boom end{'source': 'test2.pdf', 'page': 6}", "metadata": {"source": "test2.pdf", "page": 6}, "type": "Document"}
{"page_content": "fittings or even full -length booms.  It was found that the parts of  the boom outside the hinge regions, especially the proximal end fitting, change the boundary conditions of  the hinge significantly and therefore increased the hinge output torque. Without this increased torque the  hinges would not have met the torque margin requirements, but the increased torque with the end fitting  overcame{'source': 'test2.pdf', 'page': 6}", "metadata": {"source": "test2.pdf", "page": 6}, "type": "Document"}
{"page_content": "the resistive torque from the electrical harness.{'source': 'test2.pdf', 'page': 6}", "metadata": {"source": "test2.pdf", "page": 6}, "type": "Document"}
{"page_content": "Additional critical lessons learned in this progr am were based on the lack of accepted qualification methods  for high strain composite materials.  At the start of this program,  it was identified that the allowable material  properties based on existing standards would not be enough for characterizing the relevant performance  properties for thin flexible composite structures. To  qualify these{'source': 'test2.pdf', 'page': 6}", "metadata": {"source": "test2.pdf", "page": 6}, "type": "Document"}
{"page_content": "structures in a relevant manor the simp le  methods described in this paper were devised to satisfy the needs of a high value new space customer.{'source': 'test2.pdf', 'page': 6}", "metadata": {"source": "test2.pdf", "page": 6}, "type": "Document"}
{"page_content": "References   1 Adams, D., Mobrem, M., “MARSIS Antenna Flight Deployment Anomaly and Resolution”,  AIAA.ASME.ASCE.AHS.ASC Structure, Structural Dynamics, and Materials Conference, Newport,  Rhode Isla nd. (2006)   2 Yee, J., Pellegrino, S., “Composite Tube Hinges”, Journal of Aerospace Engineering, October 2005, pp  224-231.  3 Mallikarachchi, H., Pellegrino, “Deployment Dynamics of Composite{'source': 'test2.pdf', 'page': 6}", "metadata": {"source": "test2.pdf", "page": 6}, "type": "Document"}
{"page_content": "Booms with Integral Slotted Hinges”,  50th AIAA/ASME/ASDCE/AHS/ASC  Structures, Structural Dynamics, and Materials Conference, Palm  Springs, California (2009)   4 Mallikarachchi, H., Pellegrino, S., “Design and Validation of Thin- Walled Composite Deployable Booms  with Tape- Spring Hinges”, 52nd AIAA/ASME/ASDCE/AHS/ASC Struct ures, Structural Dynamics, and  Materials Conference, Denver,{'source': 'test2.pdf', 'page': 6}", "metadata": {"source": "test2.pdf", "page": 6}, "type": "Document"}
{"page_content": "Colorado (2011)   5 Mallikarachchi, H., Pellegrino, S,. “Optimized Designs of Composite Booms with Integral Tape- Spring  Hinges” 51st  AIAA/ASME/ASDCE/AHS/ASC Structures, Structural Dynamics, and Ma terials Conference,  Orlando, Florida (2010)   6 Pellegrino, S., Kebadze, E., Lefort, T., and Watt, A., “Low -Cost Hinge for Deployable Structures” Caltech,  July{'source': 'test2.pdf', 'page': 6}", "metadata": {"source": "test2.pdf", "page": 6}, "type": "Document"}
{"page_content": "2002(http://www.pellegrino.caltech.edu/publications)   7 Fernandez, J., and Murphey, T., “A Simple Test Method for Large Deformation Bending of Thin High  Strain Composite Flexures” AIAA SciTech Forum, Kissimmee, FL. (2018).   8 Sanford, G., Biskner, A., and Murphey, T., “Large Strain Behavior of Thin Unidirectional Composite  Flexures,” 51st AIAA/ASME/ASCE/AHS/ASC Structures, Structural{'source': 'test2.pdf', 'page': 6}", "metadata": {"source": "test2.pdf", "page": 6}, "type": "Document"}
{"page_content": "Dynamics, and Materials  Conference, Orlando FL. (2010)   9 Murphey, T., Peterson, M., Grigoriev, M., “Large Strain Four -Point Bending of Thin Unidirectional  Composites”, Journal of Sp acecraft and Rockets, 52, Feb 2015, pp 882- 895.  10 Rose, T., K. Medina, W. Francis, K. Kawai, A. Bergan, and J. Fernandez. \"Viscoelastic Behaviors of High  Strain Composites.\" In 2019 AIAA Spacecraft Structures{'source': 'test2.pdf', 'page': 6}", "metadata": {"source": "test2.pdf", "page": 6}, "type": "Document"}
{"page_content": "Conference. 2019.   11 Sharma, A. H., T. J. Rose, A. Seamone, T. W. Murphey, and F. Lopez Jimenez. \"Analysis of the Column  Bending Test for Large Curvature Bending of High Strain Composites.\" In AIAA Scitech 2019 Forum, p.  1746. 2019.{'source': 'test2.pdf', 'page': 6}", "metadata": {"source": "test2.pdf", "page": 6}, "type": "Document"}
{"page_content": "301 Efficacy  of Lead  Naphthenate  for Wear  Protection  in High  Vacuum    Space  Mechanisms  \n\nJason T. Galary* \n\nAbstract{'source': 'test1.pdf', 'page': 1}", "metadata": {"source": "test1.pdf", "page": 1}, "type": "Document"}
{"page_content": "The purpose of this research is to investigate the efficacy of lead naphthenate as a wear additive in a multi - alkylated cyclopentane (MAC) fluid for use in high vacuum space mechanism applications. The use of lead  naphthenate in MAC lubricants has a spacef light history of over thirty years. However,  despite the history  of use for this additive in a variety of rolling and sliding{'source': 'test1.pdf', 'page': 1}", "metadata": {"source": "test1.pdf", "page": 1}, "type": "Document"}
{"page_content": "applications, little is known or  understood about the  tribochemical process by which these additives  function.{'source': 'test1.pdf', 'page': 1}", "metadata": {"source": "test1.pdf", "page": 1}, "type": "Document"}
{"page_content": "This research looks at the performance of this additive in simulated contact tests using SRV (Sliding in  Atmospheric and Vacuum Conditions ), as well as a scuffing test performed in a mixed rolling/sliding contact.  In addition, application simulation tests are being performed including high vacuum spiral orbit tribometry  (SOT) and vacuum angular contact ball bearing testing. This test program{'source': 'test1.pdf', 'page': 1}", "metadata": {"source": "test1.pdf", "page": 1}, "type": "Document"}
{"page_content": "evaluates the additive in both a  mixed film and boundary lubrication contact under vacuum and atmospheric conditions to better understand  how the additive functions on a metal surface. This report  of the test programs  current progress will include  high vacuum bearing life testing, boundary/mixed lubrication scuffing wear, outgassing, and SOT.{'source': 'test1.pdf', 'page': 1}", "metadata": {"source": "test1.pdf", "page": 1}, "type": "Document"}
{"page_content": "The results of this work will help the design engineer understand how materials, including lubricants, play  a critical role in  the performance and life of space mechanisms in demanding high vacuum environments.  A greater understanding of the relationship between lead content and tribological performance will be  developed along with further understanding of the tribochemical degra dation{'source': 'test1.pdf', 'page': 1}", "metadata": {"source": "test1.pdf", "page": 1}, "type": "Document"}
{"page_content": "process. Data gathered from  wear testing and application simulation work will provide mechanism design engineers with a better  understanding of the tribological performance of this lubricant additive .{'source': 'test1.pdf', 'page': 1}", "metadata": {"source": "test1.pdf", "page": 1}, "type": "Document"}
{"page_content": "Introduction and Background{'source': 'test1.pdf', 'page': 1}", "metadata": {"source": "test1.pdf", "page": 1}, "type": "Document"}
{"page_content": "Lead naphthenate has been used heavily as an anti -wear and extreme pressure additive in multi alkylated  cyclopentane lubricants for high vacuum space mechanisms. The additive consists of a centralized lead  ion that is bonded with the oxygen atoms of two carboxylate groups  each attached to naphthenate aromatic  rings . The naphthenate aromatic hydrocarbon rings provide solubility of the lead{'source': 'test1.pdf', 'page': 1}", "metadata": {"source": "test1.pdf", "page": 1}, "type": "Document"}
{"page_content": "naphthenate in different  hydrocarbon oils , but the way the additive reacts with steel and protects against wear in various lubrication  regimes is still not fully understood.{'source': 'test1.pdf', 'page': 1}", "metadata": {"source": "test1.pdf", "page": 1}, "type": "Document"}
{"page_content": "The historical use of lead naphthenate originates from industrial gears and bearings where it was used an  extreme pressure additive over fifty years ago. Over the last thirty years, it has gained a lot of spaceflight  history although there are still many questions regarding its efficacy , primarily how does it function in various  lubrication regimes, the effects of different metallurgy, and{'source': 'test1.pdf', 'page': 1}", "metadata": {"source": "test1.pdf", "page": 1}, "type": "Document"}
{"page_content": "how environmental pressure effect its  performance.{'source': 'test1.pdf', 'page': 1}", "metadata": {"source": "test1.pdf", "page": 1}, "type": "Document"}
{"page_content": "With the increasing number of space mechanisms being developed and launched as well as the increasing  length of mission time required, it is critical to have a robust design with high reli ability. To improve the  reliability, it is necessary  to have long lives  for all of the components in the design. This will require  that the  lubricants used for space  mechanisms  must also improve. The{'source': 'test1.pdf', 'page': 1}", "metadata": {"source": "test1.pdf", "page": 1}, "type": "Document"}
{"page_content": "use of lead naphthenate additive in multi  alkylated cycl opentane fluids  is a proven additive package with spaceflight history but in order to develop{'source': 'test1.pdf', 'page': 1}", "metadata": {"source": "test1.pdf", "page": 1}, "type": "Document"}
{"page_content": "* Nye Lubricants, Inc., Fairhaven, MA  \n\nProceedings of the 45th Aerospace Mechanisms Symposium, NASA Johnson Space Center, 2020{'source': 'test1.pdf', 'page': 1}", "metadata": {"source": "test1.pdf", "page": 1}, "type": "Document"}
{"page_content": "302 and advance the lubrication technology  for high vacuum space mechanisms, additional understanding of  its tribological performance is needed  to facilitate  innovations .{'source': 'test1.pdf', 'page': 2}", "metadata": {"source": "test1.pdf", "page": 2}, "type": "Document"}
{"page_content": "When considering how to research the efficacy of lead naphthenate and how it functions as a tribofilm, it is  important to look at various methodologies to characterize its performance. In the beginning stages, this is  easiest performed by using simulated contact testing. In this respect, an SRV makes the best choice as it  is very flexible regarding the contact mechanics and envi ronmental{'source': 'test1.pdf', 'page': 2}", "metadata": {"source": "test1.pdf", "page": 2}, "type": "Document"}
{"page_content": "conditions. The availability of SOT  testing is somewhat limited but a Mini Traction Machine (MTM) can be used in a manner to simulate the  same type of application conditions with a ball running in an orbital pattern on a disc with a mixture of  rolling/sliding. While the MTM cannot currently run in a vacuum condition, it can be used to understand the  fundamental complexities of lead{'source': 'test1.pdf', 'page': 2}", "metadata": {"source": "test1.pdf", "page": 2}, "type": "Document"}
{"page_content": "naphthenate operating in a rolling/sliding mixed application. When this is  combined with the vacuum/atmospheric testi ng on the SRV, the performance of the lead naphthenate can  be made clearer.   In more recent research  done on lead naphthenate using the SRV and other sliding tribometers, results  have typically been inconclusive regarding the efficacy of this additive to protect a lubricated{'source': 'test1.pdf', 'page': 2}", "metadata": {"source": "test1.pdf", "page": 2}, "type": "Document"}
{"page_content": "contact. The  standard SRV testing includes conditions that could be inappropriat e for evaluating many anti -wear  additives including lead naphthenate. This includes the sliding speed which would create a thicker film  preventing the additive function from being studied. The contact stress is also much higher in standard  ASTM tests which  will influence how the tribofilms are created and in{'source': 'test1.pdf', 'page': 2}", "metadata": {"source": "test1.pdf", "page": 2}, "type": "Document"}
{"page_content": "the case of lead naphthenate, the  higher contact stresses will create additional wear which will react and consume available lead naphthenate  making it unavailable to create a protective tribofilm.{'source': 'test1.pdf', 'page': 2}", "metadata": {"source": "test1.pdf", "page": 2}, "type": "Document"}
{"page_content": "From the authors previous  resear ch [7], the following was determined:  In oscillatory testing, Lead  Naphthenate had better anti -wear performance at lower temperatures (~20°C) and increasing the amount  of lead directly reduced the wear rate. Under high vacuum conditions, the samples with lead naphthenate  offered twice the wear protection with 440C performing the best. At higher temperatures{'source': 'test1.pdf', 'page': 2}", "metadata": {"source": "test1.pdf", "page": 2}, "type": "Document"}
{"page_content": "(75°C) the wear  rate was almost double for the samples with a higher content of lead across all experiments. The 75°C  testing in pure oscillatory sliding on 52100 steel, showed that samples with lead naphthenate in an  atmospheric environment performed worse as th e concentration of lead increased. However,  when in a  vacuum environment, as the concentration increased the wear rate decreased.{'source': 'test1.pdf', 'page': 2}", "metadata": {"source": "test1.pdf", "page": 2}, "type": "Document"}
{"page_content": "In 440C testing, samples  with lead offered up to twice the wear protection over the neat samples in a vacuum environment.  In mixed  rolling/sliding experiments, Lead Naphthenate had better anti -wear performance at high temperatures and  increasing the amount of lead directly reduced the wear rate. At lower temperatures (50°C) in the counter - rotation wear test, lead naphthenate offered three{'source': 'test1.pdf', 'page': 2}", "metadata": {"source": "test1.pdf", "page": 2}, "type": "Document"}
{"page_content": "times the wear protection when in a 3% concentration  and eleven times the protection for 5% lead compared to the neat MAC fluid. At higher temperatures   (150°C) in the counter -rotation wear test, lead naphthenate offered five times the wear protec tion when in  a 3% concentration and twenty times the protection for 5% lead compared to the neat MAC fluid. There  appears to be is a transition{'source': 'test1.pdf', 'page': 2}", "metadata": {"source": "test1.pdf", "page": 2}, "type": "Document"}
{"page_content": "point between 3% and 5% lead naphthenate where the available lead can react  with both the surface and worn metal  to create a strong lead anti -wear tribofilm. This tribofilm that is created  is between 2- 4µm thick and while it will cause an overall increase in friction at the surface, the wear of the  contact is greatly reduced.{'source': 'test1.pdf', 'page': 2}", "metadata": {"source": "test1.pdf", "page": 2}, "type": "Document"}
{"page_content": "Previous Lessons Learned from AMS 2018:   - The additive function of lead naphthenate is a combination of physical absorption through rubbing  or pressure and chemisorption.   - Depending on the mechanics in the contact (sliding versus rolling), the effect of temperature had a  significant influence . This appears to indicate that higher concentrations of lead would be required  for more severe{'source': 'test1.pdf', 'page': 2}", "metadata": {"source": "test1.pdf", "page": 2}, "type": "Document"}
{"page_content": "applications involving pure sliding and/or high temperatures as the lead is  consumed faster through reaction with surface layer steel oxides and sublayers.   - In rolling and mixed contacts, lead naphthenate creates a strong tribofilm on the steel surface that  aids in protecting from wear but at the same time will increase the friction in the contact.   - The formation and durability of lead{'source': 'test1.pdf', 'page': 2}", "metadata": {"source": "test1.pdf", "page": 2}, "type": "Document"}
{"page_content": "naphthenate tribofilm is depende nt on the environment with  higher performance coming under vacuum conditions. It is also believed the lack of oxygen{'source': 'test1.pdf', 'page': 2}", "metadata": {"source": "test1.pdf", "page": 2}, "type": "Document"}
{"page_content": "303 promotes this life due to the lack of oxide formation on the steel and degradation of the lead  naphthenate.   - In general, an increase in lead content will decrease the wear rate.  \n\nFigure 1: Mixed Film Oscillatory Wear Results from AMS 2018  \n\nScope of Work  \n\nThe following work was covered in this research.{'source': 'test1.pdf', 'page': 3}", "metadata": {"source": "test1.pdf", "page": 3}, "type": "Document"}
{"page_content": "• Fluid Lubricant Evaluation: The performance of five multi- alkylated cyclopentane (MAC) fluid   lubricants were performed included the heritage material Synthetic Oil 2001A, two lead  naphthenate versions (2001- 3PB and 2001- 5PB),  and comparable versions that utilize triphenyl  phosphate (2001B) and tricresyl phosphate (2001T) .  • Grease Lubricant Evaluation: The grease counterparts to the{'source': 'test1.pdf', 'page': 3}", "metadata": {"source": "test1.pdf", "page": 3}, "type": "Document"}
{"page_content": "materials in the fluid evaluation  (Rheolube 2000F , 2004, 2000- 5PB, 2000B, and 2000T ) were tested under a vacuum bearing  configur ation.{'source': 'test1.pdf', 'page': 3}", "metadata": {"source": "test1.pdf", "page": 3}, "type": "Document"}
{"page_content": "Testing Apparatus{'source': 'test1.pdf', 'page': 3}", "metadata": {"source": "test1.pdf", "page": 3}, "type": "Document"}
{"page_content": "Three different tribological test methods were used in this research. One of the methods is run in pure  sliding under both atmospheric and vacuum conditions (5 x 10-5 Torr Min) while the other two methods   utilize  a mixed rolling/sliding contact in atmospheric conditions for both mixed film and boundary lubrication.  The friction/traction properties along with the wear rates were measured for{'source': 'test1.pdf', 'page': 3}", "metadata": {"source": "test1.pdf", "page": 3}, "type": "Document"}
{"page_content": "two multiply alkylated  cyclopentane (MAC) hydrocarbon oils formulated with  3% and 5% lead naphthenate (2001- 3PB and  2001- 5PB) along with unformulated MAC oil (2001A). The lead naphthenate used in these samples was  vacuum treated prior to formulation to improve vacuum outgassing characteristics and make it suitable for  a space mechanism lubricant.{'source': 'test1.pdf', 'page': 3}", "metadata": {"source": "test1.pdf", "page": 3}, "type": "Document"}
{"page_content": "Spiral Orbit Tribometer   The Spiral Orbit Tribometer (SOT) is a single contact simulation that replicates Angular Contact Ball  Bearings in a semi -starved lubrication mode while under vacuum. It is simply a ball held between two  parallel  plates which essentially makes it a thrust bearing. The SOT utilizes two flat, concentric discs  between which a ½” lubricated ball rolls and pivots during{'source': 'test1.pdf', 'page': 3}", "metadata": {"source": "test1.pdf", "page": 3}, "type": "Document"}
{"page_content": "test operation.  A very small amount of lubricant,  approximately 50μg, is applied to the ball to ensure the system operates in the boundary lubrication regime,  providing a fast and efficient screening method of lubricant performance.  The upper disc applies a load  which can be varied depending on the desired Hertzian Contact Stress (material, load, and bal l diameter  dependent).        During{'source': 'test1.pdf', 'page': 3}", "metadata": {"source": "test1.pdf", "page": 3}, "type": "Document"}
{"page_content": "test operation, the lack of a ball retainer allows the ball to orbit in an opening spiral pattern whose  orbit radius continuously increases throughout the course of one revolution of the bottom sample disc.  Since{'source': 'test1.pdf', 'page': 3}", "metadata": {"source": "test1.pdf", "page": 3}, "type": "Document"}
{"page_content": "304 there is no retainer, if this orbit was left unchecked, it would result in the ball orbiting out of the two parallel  sample discs, causing the two plates to contact each other.  Fortunately, as the ball reaches the completion  of each revolution, it is pushed back into its original orbit radius by contacting what is known as the guide  plate.  The test is initiated with the sample ball{'source': 'test1.pdf', 'page': 4}", "metadata": {"source": "test1.pdf", "page": 4}, "type": "Document"}
{"page_content": "touching the guide plate, which sets the initial orbit radius,  and is adjustable.  The guide plate is oriented in a position such that it  contacts the center of the ball on  each revolution. Attached to the guide plate is a charge amplifier force transducer.  This force transducer  measures the reactionary force required for the ball to be scrubbed back into its initial orbit diameter. This{'source': 'test1.pdf', 'page': 4}", "metadata": {"source": "test1.pdf", "page": 4}, "type": "Document"}
{"page_content": "location throughout the orbit is identified as the scrub region. As the lubricant becomes consumed or  degrades, this force will naturally increase.{'source': 'test1.pdf', 'page': 4}", "metadata": {"source": "test1.pdf", "page": 4}, "type": "Document"}
{"page_content": "Figure 2. Spiral Orbit Tribometer mechanisms, Image courtesy of Spiralab{'source': 'test1.pdf', 'page': 4}", "metadata": {"source": "test1.pdf", "page": 4}, "type": "Document"}
{"page_content": "Vacuum Bearing Testing :  The apparatus used for these experiments tests a single angular contact ball bearing. The system operates  at a vacuum level better than 5.0 x 10- 7 Pa, from 1 to 500 R PM, up to 200°C, and loads to 450 N. The  system uses dead weight loading and either a heat lamp or band heater. The system also measures cross  bearing electrical resistance, which is used to monitor the{'source': 'test1.pdf', 'page': 4}", "metadata": {"source": "test1.pdf", "page": 4}, "type": "Document"}
{"page_content": "operating regime. Bearing torque, load, chamber  press ure, and cross bearing resistance are recorded using a data acquisition system. The system uses a  single SKF 7204 1219 ( 52100 steel) angular contact bearing. The bearing has an outside diameter of 47  mm, a bore of 20 mm, eleven 12.7 mm balls and a steel  retainer. The bearing is mounted in a fixture that  holds the outer race and rotates{'source': 'test1.pdf', 'page': 4}", "metadata": {"source": "test1.pdf", "page": 4}, "type": "Document"}
{"page_content": "the inner race. Temperature information is gathered from a thermocouple  mounted just below the inner race.{'source': 'test1.pdf', 'page': 4}", "metadata": {"source": "test1.pdf", "page": 4}, "type": "Document"}
{"page_content": "Wear Testing:   Three different wear rates were calculated including a mixed film in pure sliding, mixed film (rolling/sliding),  and boundary (rolling/sliding). A normalized wear rate for all these tests were calculated to compare  materials tested. The wear rate will indicate the volume of wear (µm3) over a distance traveled (in  millimeters) which will normalize the data in the case of{'source': 'test1.pdf', 'page': 4}", "metadata": {"source": "test1.pdf", "page": 4}, "type": "Document"}
{"page_content": "premature failures. For the pure sliding test, the  ASTM  D-5707 SRV Coefficient of Friction test was used. For both the mixed film and boundary testing in a  rolling/sliding contact, a custom experimental method using a Mini Traction Machine (MTM)  (as show in  Figure 3) was used [1][2][4][7][ 13]. In the MTM, the ball and disc are driven independently which allows any  combination of rolling{'source': 'test1.pdf', 'page': 4}", "metadata": {"source": "test1.pdf", "page": 4}, "type": "Document"}
{"page_content": "and sliding. The measurement of friction force is done through a load cell that is  attached to the bearing housing of the ball motor shaft.{'source': 'test1.pdf', 'page': 4}", "metadata": {"source": "test1.pdf", "page": 4}, "type": "Document"}
{"page_content": "305  \n\nFigure 3. Schematic of Mini Traction Machine, image courtesy of PCS Instruments{'source': 'test1.pdf', 'page': 5}", "metadata": {"source": "test1.pdf", "page": 5}, "type": "Document"}
{"page_content": "The experimental method using the MTM utilized a ball -on-disc configuration. In the MTM, the ball and disc  are driven independently which allows any combination of rolling and sliding. The measurement of  friction  force is done through a load cell that is attached to the bearing housing of the ball motor shaft. In previous  work by the author and when considering other scuffing tests, it was{'source': 'test1.pdf', 'page': 5}", "metadata": {"source": "test1.pdf", "page": 5}, "type": "Document"}
{"page_content": "noted that most simulations use a load  stage progression [5,6,13] . This can be seen in the FZG  (Forschungsstelle fur Zahnrader und Getriebebau) ,  4-Ball EP  (Extreme Pressure) , SRV, OK Load Test, and Timken tests . The testing in this work is  done using  progressive speed as opposed to progressive load stages . On benefit of this approach is that  the higher  sliding speeds will allow for a{'source': 'test1.pdf', 'page': 5}", "metadata": {"source": "test1.pdf", "page": 5}, "type": "Document"}
{"page_content": "more aggressive wear rate to help differentiate the efficacy of the additives .  However, the primary reason for using the progressive speed approach is the fact that in a test w here the  contact stress increases at every stage, the size of contact patch will also increase at every stage. This  leads to fresh nascent metal being exposed at every stage. This new area of contact has not yet{'source': 'test1.pdf', 'page': 5}", "metadata": {"source": "test1.pdf", "page": 5}, "type": "Document"}
{"page_content": "developed  a tribofilm  when it comes into contact , so it is more likely to have aggressive wear. Therefore,  tests run in  a progressive load methodology will typically have failures at the step increase and have lower repeatability.{'source': 'test1.pdf', 'page': 5}", "metadata": {"source": "test1.pdf", "page": 5}, "type": "Document"}
{"page_content": "The experimental testing methodology is as follows  [1,7]: The testing apparatus is assembled and filled with  oil for the experiment. The temperature of the oil is then heated to 150oC while the ball and disc are rotated  at a slow speed while not in contact. This continues for 30 minutes to allow for any chemical absorption of  the additives on the surfaces. After this, there is a 10- minute{'source': 'test1.pdf', 'page': 5}", "metadata": {"source": "test1.pdf", "page": 5}, "type": "Document"}
{"page_content": "run- in period with a Hertzian contact stress of  1.25 GPa and a  Sliding to Rolling Ratio ( SRR ) of 1. Once the run- in has completed, a progressive speed  test starts with running stages for 1 min ute and rest stages for 30 seconds. The SRR is varied at each stage  in order to maintain the entrainment speed for each stage but increase the sliding speed at the contact. The  test continues until{'source': 'test1.pdf', 'page': 5}", "metadata": {"source": "test1.pdf", "page": 5}, "type": "Document"}
{"page_content": "either all stages (51) are completed (maximum speed for MT M) or scuffing wear and  seizure occurs.{'source': 'test1.pdf', 'page': 5}", "metadata": {"source": "test1.pdf", "page": 5}, "type": "Document"}
{"page_content": "Samples   The test plates for the SOT were machined from 440C stainless steel with a surface roughness of  <0.05 microns. Balls used were 12.7- mm or 7.14- mm 440C stainless steel depending on the contact stress  requirements. For the vacuum bearing tests , SKF 7204 Angular contact ball bearings made from 52100  steel were used. In the SRV testing, AISI 52100 steel balls and discs were used with{'source': 'test1.pdf', 'page': 5}", "metadata": {"source": "test1.pdf", "page": 5}, "type": "Document"}
{"page_content": "a Young’s Modulus  of 210 GPa and a Poisson ratio of 0.30. The balls had a 10- mm diameter with a roughness (Ra) of 25 nm  and a Rockwell hardness of 62 HRC. The 24mm discs are vacuum arc re- melted and had a hardness of  58 HRC with a lapped surface that has a roughness (Rz) of 500 nm. All the tests were run in duplicate and  with a maximum Hertzian contact stress of 2.12 GPa and a sliding speed{'source': 'test1.pdf', 'page': 5}", "metadata": {"source": "test1.pdf", "page": 5}, "type": "Document"}
{"page_content": "of 300 mm/s.  The experimental  MTM test used AISI 52100 steel balls and discs were with a Young’s Modulus of 210 GPa and a Poisson  ratio of 0.30. The balls had a 19.05- mm diameter with a roughness (Rq) of 10 nm and a Rockwell hardness{'source': 'test1.pdf', 'page': 5}", "metadata": {"source": "test1.pdf", "page": 5}, "type": "Document"}
{"page_content": "306 of 62.5. The discs had a hardness of 60.5 and a roughness (Rq) of 11 nm. All the tests were run in duplicate  and with a maximum Hertzian contact stress of 1.25 GPa.  \n\nProcedures{'source': 'test1.pdf', 'page': 6}", "metadata": {"source": "test1.pdf", "page": 6}, "type": "Document"}
{"page_content": "Sample Preparation   All test specimens are ultrasonically cleaned in heptane followed by acetone. For the SOT testing, the fluid  lubricants were plated via the preparation of a solution of lubricant diluted into an appropriate solvent. This  solution was then applied directly to a rotating ball and the solvent allowed to evaporate from the surface.  This left the fluid lubricant on the ball’s{'source': 'test1.pdf', 'page': 6}", "metadata": {"source": "test1.pdf", "page": 6}, "type": "Document"}
{"page_content": "surface. The lubricant plating method allows for the application of  very smal l amounts of lubricant. The application of grease was done by rubbing the ball between cleanroom  grade polyethelye sheets until and even coating of lubricant was applied. The target amount of applied  lubricant for both fluids and greases were 50 μg. The contact area for the SRV was coated with 5 ml of  lubricant{'source': 'test1.pdf', 'page': 6}", "metadata": {"source": "test1.pdf", "page": 6}, "type": "Document"}
{"page_content": "while the MTM specimens were fully flooded.{'source': 'test1.pdf', 'page': 6}", "metadata": {"source": "test1.pdf", "page": 6}, "type": "Document"}
{"page_content": "Results and Discussion{'source': 'test1.pdf', 'page': 6}", "metadata": {"source": "test1.pdf", "page": 6}, "type": "Document"}
{"page_content": "SRV (Sliding in Atmospheric and Vacuum Conditions)   The results in  Tables 1- 3 and Figure 4 are from the experiment on  the MAC  with 0%, 3%, and 5% lead  naphthenate when tested in a boundary lubricating  regime , at 20°C on the SRV under both atmospheric  and vacuum conditions. These plots illustrate the wear rate of each material which is determined by the  total wear volume (µm3) per{'source': 'test1.pdf', 'page': 6}", "metadata": {"source": "test1.pdf", "page": 6}, "type": "Document"}
{"page_content": "millimeter traveled in the test. The wear volumes  were measured using an  Ametek  3D Optical Profilometer.{'source': 'test1.pdf', 'page': 6}", "metadata": {"source": "test1.pdf", "page": 6}, "type": "Document"}
{"page_content": "Table 1: Wear Performance for MAC fluid with 0% Lead at 20°C  \n\nTable 2: Wear Performance for MAC fluid with 3% Lead at 20°C  \n\nTable 3: Wear Performance for MAC fluid with 5% Lead at 20°C{'source': 'test1.pdf', 'page': 6}", "metadata": {"source": "test1.pdf", "page": 6}, "type": "Document"}
{"page_content": "Material Temp ( °C)Environment Specimen Avg Wear Scar (mm2)Disc Wear Volume (μm3)Wear Rate (μm3/mm) 0% Lead 20 Atmosphere 440C 1.302 599,972 0.28 0% Lead 20 Vacuum 440C 1.294 518,400 0.24 0% Lead 20 Atmosphere 52100 1.499 481,018 0.22 0% Lead 20 Vacuum 52100 1.420 410,400 0.19 Material Temp ( °C) Environment Specimen Avg Wear Scar (mm2)Disc Wear Volume (μm3)Wear Rate (μm3/mm) 3% Lead 20{'source': 'test1.pdf', 'page': 6}", "metadata": {"source": "test1.pdf", "page": 6}, "type": "Document"}
{"page_content": "Atmosphere 440C 2.409 410,400 0.19 3% Lead 20 Vacuum 440C 1.942 216,000 0.10 3% Lead 20 Atmosphere 52100 1.950 342,356 0.16 3% Lead 20 Vacuum 52100 1.820 259,200 0.12 Material Temp ( °C)Environment Specimen Avg Wear Scar (mm2)Disc Wear Volume (μm3)Wear Rate (μm3/mm) 5% Lead 20 Atmosphere 440C 1.468 291,600 0.14 5% Lead 20 Vacuum 440C 1.259 172,800 0.08 5% Lead 20 Atmosphere 52100 1.389 259,200{'source': 'test1.pdf', 'page': 6}", "metadata": {"source": "test1.pdf", "page": 6}, "type": "Document"}
{"page_content": "0.12 5% Lead 20 Vacuum 52100 1.242 216,000 0.10{'source': 'test1.pdf', 'page': 6}", "metadata": {"source": "test1.pdf", "page": 6}, "type": "Document"}
